{
  "source": "/home/salouri/Projects/starter_story/transcripts/wqN-gjnpns8/wqN-gjnpns8_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "This is Hunter hammons. He's launched $4 million businesses in the last four months, all of them productized services that use essentially the same strategy. I flew out to Chicago to meet him and he broke down each of his businesses as well as the method he's using to launch a million dollar business every 30 days.",
      "start": 160,
      "end": 16480
    },
    {
      "speaker": "B",
      "text": "Really what we're doing at the end of the day is just talking to our friends and seeing if it makes sense for us to build a business together.",
      "start": 16560,
      "end": 21840
    },
    {
      "speaker": "A",
      "text": "But Hunter's journey is not some lucky overnight success story. He started and failed multiple businesses over the last 15 years.",
      "start": 21920,
      "end": 29680
    },
    {
      "speaker": "B",
      "text": "Just decided like it's time to take a break con now.",
      "start": 29840,
      "end": 32780
    },
    {
      "speaker": "A",
      "text": "Hunter's goal is to build $12 million businesses in 12 months and then turn those businesses into a cash flowing machine so we can build something even bigger.",
      "start": 32780,
      "end": 41940
    },
    {
      "speaker": "B",
      "text": "We just view productized services as the first phase of what we're building.",
      "start": 41940,
      "end": 46460
    },
    {
      "speaker": "A",
      "text": "I'm Pat Walls and this is starter story. Tell me a little bit more about yourself and what you're building.",
      "start": 46540,
      "end": 51060
    },
    {
      "speaker": "B",
      "text": "I run a company called assembly which builds creator led B2B brands. We're building one company a month with the goal that each company hits a million dollar run rate within the first 30 days. Today like I'm happy to say that, you know, out of the four companies that were operating, they're in the multiple seven figures of revenue and growing quickly. We're on track to crack, you know, kind of the million a month mark by the end of this year, which is incredible. And across the board like each of these businesses is just delivering incredible work to its customers. So it feels pretty special.",
      "start": 51060,
      "end": 78340
    },
    {
      "speaker": "A",
      "text": "Can you break down each of the businesses that you've built?",
      "start": 78420,
      "end": 81420
    },
    {
      "speaker": "B",
      "text": "Sure. Most recently we launched hey friends which is our done for you YouTube agency with Ali Abdaal. Another is off Menu which is our full service design agen. We have viralcuts, which is our high end premium short form agency with Sam Parr and Cody Sanchez. We've got Keyframe, our animation studio with Dan Ko and then we have a few other businesses that we're kind of currently building in stealth that have some customers that will launch publicly pretty soon.",
      "start": 81420,
      "end": 105440
    },
    {
      "speaker": "A",
      "text": "And can you break down a little bit how these businesses are doing? What's been the most successful one and then how does it look in terms of revenue and customers?",
      "start": 105440,
      "end": 112280
    },
    {
      "speaker": "B",
      "text": "So we started launching companies four months ago. Kind of crazy to say that all of our companies are doing over a million a year in ARR, three out of the four that are public are doing multiple seven figures a year right now. Out of the current portfolio. Hay Friends and Off Menu are by far and away gonna be the biggest winners. But Off Menu is probably most exciting to talk about right now. Cause it's the one that we're getting ready to announce next week. I'm gonna call it a shot. I think Off Menu is gonna crack a $5 million run rate by the end of October. Fast. Yeah.",
      "start": 112280,
      "end": 141100
    },
    {
      "speaker": "A",
      "text": "How does it work? Fundamentally?",
      "start": 141100,
      "end": 142460
    },
    {
      "speaker": "B",
      "text": "Fundamentally, at the end of the day, a customer pays us for a predefined service. So in the case of hey, Friends, for example, we have the creator package that starts at $10,000 a month and bas everything you need to release six really high quality YouTube videos per month. One of the biggest things for us there is setting clear expectations with our customers about how much volume you can expect from us. We're really not big fans of the idea of, like, unlimited, so we really want to make sure that our customers understand exactly what they're getting for when they pay us money.",
      "start": 142700,
      "end": 174680
    },
    {
      "speaker": "A",
      "text": "Yeah. You built these amazing businesses in the short few months. What's your backstory? How do you get here?",
      "start": 174680,
      "end": 180040
    },
    {
      "speaker": "B",
      "text": "I mean, I've been building businesses for the better part of 15 years, which makes you feel super old at this point. And I started my first agency when I was 19. There I met one of my closest friends to this day. His name's Austin Cameron. I hired him as my lead engineer at the time. And together we started working on this idea for a startup. We built that business to 3.2 million active users. Unfortunately, we could never really monetize, so we ended up selling all the assets of that. And then I got an offer I couldn't refuse from a big agency here in town that basically said, look, we'll give you a $3 million a year budget to build your own team and basically build digital for our agency. It was fun at first. We created an amazing team, but then there were all these constraints that started stacking up even ways that we could, like, collaborate with our clients that were really, really cool brands. So that's where we got the idea originally of just saying, like, screw this, let's just start our own agency. That's where Everest was born. And I built that business into the eight figures of revenue. We worked with Nike or Samsung or Obama. Right? Our accounts got bigger and bigger, but the budgets were still kind of constrained. And my life just became one phone call after another from VPs and EVPs just bitching about problems that didn't matter. And I quickly grew to just hate running that business ultimately. Just decided, like, it's time to take a break. And burned out. So I took a six month sabbatical and basically just like dicked around all day for six months, did zero work, Just kind of reading and relaxing and really storing up enough energy to go and build assembly. Along the way of building Everest, Sahil Bloom and I became pretty fast friends and kept trying to find ways to like, work on something together. And near the end of my break, we had a call scheduled and, you know, both of us hopped on the phone and he's like, dude, I got this idea that I want to talk to you. And I was like, me too. We basically discussed the concept of partnering with creators to build B2B businesses. I said, look, let's build 12 of them in 12 months because that'll give us A, the most diversified source of revenue we could possibly imagine, B, it'll allow us to generate so much cash that we can go and take a lot of really big bets. That's what we started doing. So I flew out to New York, we had dinner, kind of aligned on what we were doing, and I said, look, let's just, let's build a productized agency first. And Key frame was born three weeks later.",
      "start": 180040,
      "end": 306130
    },
    {
      "speaker": "A",
      "text": "I spent seven years trying to build 24 different businesses, but only one of them was successful. Now that business makes over a million dollars a year. But I could have done it a lot faster if I studied already successful businesses. Imagine you could read the exact steps to how someone built a million dollar business and the mistakes they made so you can avoid them when you launch. Well, at Starter Story, we have a library of over 4,000 case studies and business idea breakdowns where you can do this, all backed by real data. For example, Luke joined Starter Story and dove into our case study about a newsletter that makes $25 million a year. Just one month later, he launched his own newsletter and did $5,800 in in 30 days. It's simple. He studied what works, implemented it, and avoided the mistakes of people that were just a few steps ahead of him. So if you're serious about finding a business idea that works and making your first dollar 10 times faster, check out the first link in the description. We're running a special right now for anyone coming from the channel. Anyways, enjoy the rest of the video. Peace. How do you usually come up with ideas for a new productized service to launch and how do you validate them?",
      "start": 306130,
      "end": 366570
    },
    {
      "speaker": "B",
      "text": "When we're looking at building a productized service, we're looking for a really crowded market. If we can come into the market with a really great brand already Populated with a ton of success stories and case studies. Make sure that it's a really concierge experience that feels high end and premium and then have a really trusted creator that serves as this massive boost of distribution at the beginning of the business. We can probably win in that space really quickly. The success of the relationship really comes down to something that we call product audience fit. So if you take Ali Abdul, for example, it made total sense for Ali to have a YouTube agency because he taught thousands of people how to succeed on YouTube. So what we do is we come in with our playbook, with our team, our expertise, our recruiting engine, and we build the entire business productized services.",
      "start": 366570,
      "end": 412010
    },
    {
      "speaker": "A",
      "text": "They've kind of blown up over the last couple years. What do you think the opportunity is here?",
      "start": 412010,
      "end": 415570
    },
    {
      "speaker": "B",
      "text": "I think the opportunity is huge. It's an interface to where a customer says, hey, this is the problem I'm trying to solve or the goal that I have and instantly sees work. So I think that that way of working and just making it the super clear transactional relationship, I pay you X dollars, you give me Y result and is beautiful. We wanted to come in and approach it from the perspective of like, let's build a really great operationally sound business. You know, our contribution margins and like our cash flow cycles and how we're servicing customers to make sure that they're really well taken care of. When you can do all of that and wrap it in the simple like pretty $10,000 a month price point, it becomes really easy to sell, especially when we have the distribution that we do. But there's downsides, of course. I think every subscription or productized service wants to view their business from the standpoint of mrr. But at the end of the day, there's a finite nature to a lot of these projects. You know, off menu has like decently high churn. But what's crazy is that doesn't matter because our average customer values 60 to $75,000 while they're with us and the margins are fantastic.",
      "start": 415570,
      "end": 482440
    },
    {
      "speaker": "A",
      "text": "What you've done so brilliantly is you find influencers or creators in the space and build businesses with them. Can you tell me a little bit more about that and how other people watching could do something similar?",
      "start": 482440,
      "end": 492860
    },
    {
      "speaker": "B",
      "text": "First, I have to acknowledge that we kind of have an unfair advantage. We're really fortunate that we have great network. There's no big sales pitch for us to go to a creator and try and convince them to work with us. We already have these relationships. Really what we're doing at the end of the day is just Talking to our friends and seeing if it makes sense for us to build a business together. But I think what's most interesting is how did I get there? I slowly, over years, just built my network by never asking for anything, which is always giving along the way. You build a lot of trust and people know you as a person that is just really high integrity, really loyal. I think that's a really special thing that a lot of people miss when they look for that like quick buck.",
      "start": 493020,
      "end": 528949
    },
    {
      "speaker": "A",
      "text": "And how does it work in terms of the partnership? Is there an equity split with the influencer or profit sharing or what's the typical model for this?",
      "start": 528949,
      "end": 537869
    },
    {
      "speaker": "B",
      "text": "They're not like affiliate partners, they're actual partners in these businesses. They're really instrumental in helping get them off the ground. They're instrumental in the insights that drive the business and the service it provides. And that works really well for us.",
      "start": 537949,
      "end": 550570
    },
    {
      "speaker": "A",
      "text": "Building businesses like these require seemingly a lot of scale. And you've gone from three people to over 50 in four months. Tell me about how you've been able to scale.",
      "start": 550650,
      "end": 560650
    },
    {
      "speaker": "B",
      "text": "So I have this method that basically I say like, let's move super fast, break fucking everything and just create this wake of chaos and then stop and just clean it all up. And so we just went through our clean it all up phase. I do want to be honest and say like, for us to hit that scale so quickly, we really had to cut a lot of corners, which has its pros and its cons. But fortunately I think we did a good job of recruiting people that were okay with that, that could like thrive in that sense of ambiguity.",
      "start": 560730,
      "end": 588950
    },
    {
      "speaker": "A",
      "text": "What's your approach to finding great people and hiring them?",
      "start": 589030,
      "end": 591790
    },
    {
      "speaker": "B",
      "text": "It's different for every company that we run. You know, for off menu, for example, we're only looking for like principal or creative level designers and above. So there it's all network driven, very carefully curated. But if you look at a company like Viralkots, they're like, hey, friends to where we need to hire 50 video editors as fast as we can. A lot of what we rely on is careful recruiting for the first handful. And then we offer really great referral incentives. If you know another editor or you're friends with somebody that's looking for a new role, have them come here. At the end of the day, like one of our secrets to recruiting is just being like a really great, generous employer. And that's where corners for us.",
      "start": 591790,
      "end": 629120
    },
    {
      "speaker": "A",
      "text": "You're able to launch all these businesses. Most people, including me, have trouble just figuring out how to launch one business. Why is it different for you? What's your approach?",
      "start": 629120,
      "end": 637010
    },
    {
      "speaker": "B",
      "text": "It's a tremendous amount of really hard work. I'm only able to do it because I've got a fantastic team that I'm working with. Some of the core team members that we have are guys that I've worked with for years. And it's easy for us to just get in a rhythm and go. So that's been one of the biggest drivers. But at the end of the day, it's still, you know, I work 10 to 14 hours a day, six days a week.",
      "start": 637170,
      "end": 657730
    },
    {
      "speaker": "A",
      "text": "Yeah. Tell me about these 10 to 14 hour days. What does a typical day in the life look like? You, what do you spend most of your time doing?",
      "start": 657730,
      "end": 664370
    },
    {
      "speaker": "B",
      "text": "I have this framework that I call dam. Decisions that I have to make, actions I have to take, and messages I have to send. I structure my week that way. So Monday is all about decisions, Tuesday is all about actions, and Wednesday is all about messages. I wake up on Mondays with a ton of data from our team and then I use that time to make a lot of decisions on what we need to do to essentially optimize the businesses that we're running or the businesses that we're currently incubating. Tuesdays, you know, the action part of my week, I really spend thinking through what actions do I have to take to day to move the rest of these businesses forward for the week based on the decisions that I made yesterday. Wednesday's messages, I communicate all that to the team. That's really the core driver of my work. Thursdays I leave for calls, talking with other CEOs, sometimes helping out with sales calls, things like that. And then Fridays I typically write, I try and do more deep work.",
      "start": 664450,
      "end": 715290
    },
    {
      "speaker": "A",
      "text": "Seems like you are making a big bet on productized services. Can you tell me more about that?",
      "start": 715290,
      "end": 718770
    },
    {
      "speaker": "B",
      "text": "I want to be clear, it's just the launch pad. We just view productized services as, as the first phase of what we're building. When you think about productized services, you have this fantastic free cash flow engine. From there, the question is, what do you do with all that free cash flow? And that's where we're thinking much bigger. Right? We're looking at products, we're looking at SaaS, we're looking at really interesting ways for us to scale what we're building at assembly in phase two, beyond this notion of a human being is required to turn a profit.",
      "start": 718770,
      "end": 748040
    },
    {
      "speaker": "A",
      "text": "But it sounds like the productized service, as you said, is a great way to start generating cash. Even for someone watching this video, it's kind of a great first business to start.",
      "start": 748040,
      "end": 756650
    },
    {
      "speaker": "B",
      "text": "100%. If you think that you have a skill set and you're better at that skill than let's say 80% of the market, yeah, you could probably build a successful productized service around that. But I think the thing you have to do is recognize three things. One, really think critically about the model of the business that you're building, right? Make sure that you have a value prop for your customer that's super clear. Make sure you're building it in a way that's healthy and that you can scale, scale. The second thing I think is super important is make sure that in everything you do, you're constantly over delivering that value to customers because that's how you'll build your business long term because you need referrals. And three, I think the thing you have to keep in mind is how are you actually building a business and not just freelancing in disguise as solopreneurship.",
      "start": 757130,
      "end": 803030
    },
    {
      "speaker": "A",
      "text": "So last question that we asked to all founders is, if you go back 10 years and sit on Hunter's shoulder, what advice would you give him?",
      "start": 803030,
      "end": 810740
    },
    {
      "speaker": "B",
      "text": "The number one piece of advice I would give myself is to create content, share publicly what I'm doing. That's my biggest regret in my career, 100%, is that I didn't spend the last decade building an audience. The second, I would say, like, I probably want to think more clearly about my long term goals. Ten years ago, all I did was like make money and spend money. If I wanted to do it, I did it, which was great because I collected a ton of, of like amazing experiences. But I really wish I'd taken a different approach and I'd built a more scalable business. And really the other thing I would do, I would have spent a lot more time nurturing long term relationships. That's something that has always been one of my weaknesses. I get kind of introverted. I get like lost in like whatever it is I'm doing. And I'm horrible at like following up with friends and staying on top of that. As I've gotten older, I've learned from some friends that are just absolute masters at that art form. It's not easy, like to pick up that phone and be like, how you been, dude? Like, and keep that conversation going. It's tough.",
      "start": 810740,
      "end": 869340
    },
    {
      "speaker": "A",
      "text": "You just want to go into your hole and go heads down. I think you can do it yourself.",
      "start": 869340,
      "end": 873140
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 873140,
      "end": 873500
    },
    {
      "speaker": "A",
      "text": "All right, man, thank you so much.",
      "start": 873500,
      "end": 874940
    },
    {
      "speaker": "B",
      "text": "Thanks for coming, man.",
      "start": 875420,
      "end": 876380
    },
    {
      "speaker": "A",
      "text": "Follow this advice and you will be launching 12 companies in 12 months.",
      "start": 877740,
      "end": 882300
    }
  ]
}