{
  "source": "/home/salouri/Projects/starter_story/transcripts/1nfPvJKrYYQ/1nfPvJKrYYQ_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "A few weeks ago, I came across a tweet that blew my mind. This app got 250,000 downloads and made $100,000 in revenue in just three months.",
      "start": 160,
      "end": 9840
    },
    {
      "speaker": "B",
      "text": "First month, 41k dollars, second month, 32k dollars and third month, 27k dollars.",
      "start": 10240,
      "end": 18800
    },
    {
      "speaker": "A",
      "text": "So in typical fashion, I reached out to the founder to see if I could uncover how. And he responded with something that I couldn't believe.",
      "start": 19040,
      "end": 26080
    },
    {
      "speaker": "C",
      "text": "Onset get. We started getting a lot of sales immediately.",
      "start": 26240,
      "end": 30810
    },
    {
      "speaker": "A",
      "text": "Him and his friend Evgeny did it all from their bedrooms in Europe with a single TikTok account.",
      "start": 30890,
      "end": 36170
    },
    {
      "speaker": "C",
      "text": "In the beginning, we didn't expect like this video will reach 4 million views.",
      "start": 36490,
      "end": 42410
    },
    {
      "speaker": "A",
      "text": "I had to know more. So I brought them onto the channel to share everything. And in this video we'll go over the AI app that they built, their step by step TikTok marketing playbook that made them $100,000 in three months. And they'll break down their most viral TikToks and share special sauce that generated millions of views. This one's gonna be fun. I'm Pat Walls and this is Starter Story. All right, real quick guys. Before you meet Evgeny and Nikita, I just want to mention that this was the first time that they were sharing their story on any podcast. English isn't their first language and they were a little bit nervous to come on here, but they worked really, really hard to give you guys as much value as possible, which I think is really cool. And hopefully you guys enjoy the video, I hope. All right, Nikita and Evgeny, welcome to the channel. Tell me about who you guys are, what you built, and what's your story?",
      "start": 42570,
      "end": 95900
    },
    {
      "speaker": "C",
      "text": "Hi, Nikita, based in Serbia, and I'm.",
      "start": 96220,
      "end": 99140
    },
    {
      "speaker": "B",
      "text": "Evgeny, based in Poland.",
      "start": 99140,
      "end": 100540
    },
    {
      "speaker": "C",
      "text": "Together we built an AI writing tool called Natural Write.",
      "start": 100780,
      "end": 104620
    },
    {
      "speaker": "B",
      "text": "And in just three months we took this app from 0 to 100k dollars in revenue and we did it all from a single TikTok account.",
      "start": 104620,
      "end": 114220
    },
    {
      "speaker": "A",
      "text": "Alright, so tell me a little bit more about Natural, right? What exactly is it and who's using this?",
      "start": 114540,
      "end": 119110
    },
    {
      "speaker": "C",
      "text": "You know, concept is super simple. So users just pass the E generated text, click Humanize button and receive 100% human written text. And this text usually bypass most AI detectors. And mostly it's popular in schools, in universities, for students, but it's also used in businesses for marketers. You know, most interesting thing here is that we came to that idea little bit, you know, randomly. So during our research we noticed that there are so many videos about humanizers and I just thought that, okay, we can do the same. It's much easier to promote it on TikTok because it's hot topic and we decided, okay, let's go two weeks, we make a product, start promoting it and it's. It's worked out.",
      "start": 119510,
      "end": 165810
    },
    {
      "speaker": "A",
      "text": "Yeah, I think that's really cool. Kind of finding an idea from a growth first strategy. And that's one of the big reasons I wanted to bring you on the channel, is that you really did all this in the last three months. So I'd love to hear more about that growth story. How do you go from basically no idea to getting something with serious traction?",
      "start": 165810,
      "end": 184120
    },
    {
      "speaker": "B",
      "text": "Firstly, we tried hiring influencers and paying them to make videos for us, but it was unsuccessful experience because they generated just some views and almost no conversions. So after that we decided to create our own accounts on TikTok and we started filming ourselves. We started posting videos every day just from the first video. We got the first sale. But after that things started to snowball. So first month 41k dollars, second month 32k dollars and third month 27k dollars and total 100k dollars in revenue.",
      "start": 184920,
      "end": 227260
    },
    {
      "speaker": "A",
      "text": "Nice. I like that you guys really focused on growth. You really focus on TikTok and you had a pretty unique approach to tackling TikTok from a programmer's mindset. Can you tell me a little bit more about your strategy?",
      "start": 227670,
      "end": 239190
    },
    {
      "speaker": "C",
      "text": "So our approach is pretty simple. So first you properly set up your account, then you just find viral videos from your niche, then you just make copies of that videos, then you post one video per day and finally once you go viral, start testing your own unique ideas.",
      "start": 239670,
      "end": 255990
    },
    {
      "speaker": "A",
      "text": "I like that strategy, but I think for a lot of people watching this, and I'm also curious to know, like let's get into the details on this. Can you really break down this TikTok marketing strategy in full?",
      "start": 256529,
      "end": 267169
    },
    {
      "speaker": "B",
      "text": "Yeah, sure. Step one, do a niche research before you even start coding because you need to find proofs. Proof that you have competitors on TikTok and proof that these competitors have viral videos on TikTok as well. TikTok search is your best friend and creator. Search Insights also on TikTok is your best friend too. Step two, create a TikTok account. So if you are not in your target location, you need to buy a vpn. You need a raised iPhone, phone number from your target location, a new email, a new Apple ID. It is very important. Your first TikTok account should be registered on your phone number. And step three, warm up. You have to spend 50, 30 minutes a day for three, five days engaged with content in your niche. So like videos, leave comments Follow Creators use search to find Videos in your niche Recreate what works. Start by making one to one high quality copies of viral videos in your niche. It is very important to add captions in TikTok editor as well. Step 5 posting Start with posting just one video per day at optimal time for your target audience, so usually it will be the second half of the day. And Step six Innovate when your videos start going viral and you figure out how everything works on TikTok. So you can probably begin experimenting with your own ideas and your own formats on TikTok. Step 7 Scale Once you have success and getting views, you can scale your operation by creating more accounts and hiring creators.",
      "start": 267889,
      "end": 375940
    },
    {
      "speaker": "A",
      "text": "Before we keep going, I got to call out something I'm seeing with a lot of founders right now. You're moving fast, maybe close to product market fit or you're prepping for your next round. This feels amazing. But then enterprise prospects start asking about security compliance and suddenly everything slows down. The reality? Well, in 2025, especially with AI security expectations and harder than ever, you can either get ahead of it or let it become the thing that kills your momentum. And that brings me to Vanta, today's sponsor, which basically solves this entire headache. Instead of spending months figuring out SoC2 compliance, Vanta's automated workflows gets you audit ready fast. And here's what I think is really cool. It's not just a one time setup. Vanta keeps monitoring and updating as you scale. Fast growing startups like LangChain, Rider and Cursor trusted Vanta to build their security foundation early, which meant they could focus on growth instead of getting stuck in compliance hell. Right now Vanta's offering $1,000 off for starter story viewers. If you want to check it out, you can go to vanta.com starterstory or click the first link in the description. Over 12,000 companies are already using Vanta to scale smarter. Huge thanks to Vanta for partnering with us. I love what you guys are doing. All right, let's dive back in. That's a very nice playbook. What I'd love to see from you guys is the actual examples. Would you be able to pull up your most successful TikTok videos that led to the most downloads and customers?",
      "start": 376420,
      "end": 465920
    },
    {
      "speaker": "C",
      "text": "Yeah, sure. The first one is you have an essay to submit in five minutes and you know is just from a popular American comedy with Jim Carrey there is the great video that exactly show the problem to users like okay, you have just one minute. You need to submit your essay and show them solution in very funny way this video took couple of hours to make and in the beginning we didn't expect like this video will reach 4 million views. This format was already proven by other creators so we just copy it and it works really well. Here's another example. In this case we show exactly the problem. Like you have 100% AI generated text. You do this and you have like 100% human written text. Once it gets viral, we start getting a lot of sales immediately. Funny stuff here. That original video has around 150k views, but the copy from Yogini gets 1.5 million views.",
      "start": 466320,
      "end": 529440
    },
    {
      "speaker": "A",
      "text": "Thank you guys for showing those two examples. I think it's super cool to be able to see what actually worked for you. So I appreciate you guys showing those you came up with and you executed on this TikTok strategy just a couple months ago. Break down some of the numbers for me.",
      "start": 529680,
      "end": 543530
    },
    {
      "speaker": "C",
      "text": "Yeah, sure. Total views on TikTok is around 9 million views from all our accounts. Total visits around 300k. Sign ups 250k. Also conversion rate from visit to sign up is around 80%. That is crazy. And revenue 100k. Yeah.",
      "start": 543930,
      "end": 562810
    },
    {
      "speaker": "A",
      "text": "Wow, that's insane. 80% conversion to sign up ratio on your website is absolutely nuts. So congrats on that. So I'd love to hear how you guys actually built this app and what kind of tech stack you're using to build this.",
      "start": 563050,
      "end": 575440
    },
    {
      "speaker": "B",
      "text": "First we'd like to mention that we have a third member of our team, Aleksandr, who takes care of all tech stuff. Our stack is pretty simple. Next js postgres, koolify, nextauth plus resend and our server costs $35 per month. Resend $20 per month. Next. We have VPN so $5 per month per 5 devices and US phone numbers. $5 per month per phone number. So other than cost of our time, the cost to run this business is very low.",
      "start": 575760,
      "end": 613430
    },
    {
      "speaker": "A",
      "text": "Thank you for sharing that. The last question that I want to ask both you guys, Nikita and Evgeny when it comes to figuring out TikTok marketing, if you could stand on each other's shoulders just three months ago before you had a successful app. While you're trying to figure this out, what would be your advice?",
      "start": 613670,
      "end": 627520
    },
    {
      "speaker": "C",
      "text": "I would say that you need to start your TikTok journey by yourself. Try find out what works and only then start thinking about delegated or hiring other people. So just try it by yourself and.",
      "start": 627760,
      "end": 642240
    },
    {
      "speaker": "B",
      "text": "Also don't over complicate it. So skip inventing your own TikTok format and just replicate what's already going viral.",
      "start": 642480,
      "end": 651600
    },
    {
      "speaker": "A",
      "text": "I just want to say thank you again to Nikita and Evgeny for coming onto the channel. I know they're a little nervous and English wasn't their first language, but I think their TikTok strategy is awesome and hopefully you do too. Before I sign off, I do want to remind you to check out Starter Story Build. It's our program where in just a few weeks you'll build a real working project and you'll build it using only AI coding tools. Hundreds of people have joined Starter Story Build and launch their first projects, so if you're ready to get started, just head to the link in the description to join Starter Story Build. Thanks again for watching. We'll see you in the next one. Peace.",
      "start": 652020,
      "end": 685660
    }
  ]
}