{
  "source": "/home/salouri/Projects/starter_story/transcripts/plrni3IBEyI/plrni3IBEyI_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "I made $1 million building and selling apps using this five step strategy.",
      "start": 160,
      "end": 4720
    },
    {
      "speaker": "B",
      "text": "Meet Domenico. While working at 9to5job, he set out on a challenge to build and sell a new app every 30 days.",
      "start": 4800,
      "end": 12720
    },
    {
      "speaker": "A",
      "text": "So I started a challenge where I just build, scale and sell projects.",
      "start": 12880,
      "end": 17120
    },
    {
      "speaker": "B",
      "text": "And fast forward three years, Dom had quit his 9 to 5, sold seven different apps and even exited one of the apps for over seven figures.",
      "start": 17120,
      "end": 25920
    },
    {
      "speaker": "A",
      "text": "I think the secret to building a successful app is.",
      "start": 26270,
      "end": 28990
    },
    {
      "speaker": "B",
      "text": "So today I brought Dom onto the channel to break down his five step process for building, scaling and selling an app. How he shipped a new project every month while working a full time job and his method to get users without writing a single line of code. If you're looking to build on the side, this one is a must watch. Let's get into it. I'm Pat Walls and this is Starter story. All right Domenico, welcome to the channel. Tell me about who you are, what you built and what's your story.",
      "start": 30750,
      "end": 60190
    },
    {
      "speaker": "A",
      "text": "Thanks Pat. I'm Dom and I built and sold six microsize projects while working a full time job. Then applied the same strategy to Softgen and we grow it from 20k error to half million RR in three months selling it for nearly a three times multiple of error.",
      "start": 60510,
      "end": 77150
    },
    {
      "speaker": "B",
      "text": "Well before we get into all these businesses you built and sold, which I think is really cool, I'd just like to get a little bit of a background on you. What's your timeline? How do you get up to this point?",
      "start": 77390,
      "end": 86650
    },
    {
      "speaker": "A",
      "text": "Yeah, sure. Between 2017 and 2019 I tried to launch different projects and small startups. While enrolled at university I studied economics. Then in 2019 I launched my first physical business in the micro mobility field. Then I had a co founder breakup and then I left it. Then I worked for different companies as a full time employee, as an analyst role. My main goal has always been to start something from scratch, my own project or my own business and work for something that was bigger than the tradition traditional 9 to 5 job. I've always used these projects to escape from the 9 to 5 and try to reach something different.",
      "start": 86890,
      "end": 125670
    },
    {
      "speaker": "B",
      "text": "All right, so you're in this job, you want to do something bigger, so you decide to do the build and sell challenge. Can you tell me a little bit more about what that was? What were the rules or the idea behind the challenge and what you built during that challenge?",
      "start": 125830,
      "end": 137990
    },
    {
      "speaker": "A",
      "text": "Yeah, sure. So the build and sell challenge was really simple. You needed to launch, validate and sell micro business in 30 days. The first product was pitch 2.0 pitch deck generator. I worked only for 45 days on this project, I made $300 and then we decided to sell it for 2,500. I thought, this is the challenge, this is the fast execution. You can apply, you know, to the products. So let's try to do the same. The same, the same, month after month. Then the second product we launched was One Tap AI. OneTap AI was, I would say, very simple EXC formula generator. So you just needed to type in plain English what you want to do on Excel. And the tool was going to give, you know, the exact formula to use in your spreadsheet. In this case, we made like almost $7,000 and we sold it for almost 25k dollars after 3 months. Then we launched your coverletter.com and we sold it for 7k after 40 days. Very interesting product because you could generate a cover letter based on the job application. Then we worked on recapturegpt.com, an AI summarizer. So basically you could summarize whatever you want. YouTube videos, presentation, docs. And we sold it for 34k of dollars after six months. Then we had tweetsbot IO. So basically you could generate tweets based on a doc or on a website. Was not so successful. We made 1k and we sold it after 3 months for 5k. The last product was AiwebDesigner IO. You could generate a landing page by just prompting. We made 1.2k and we sold it after three months for 12k in that case. And then we got Softgen AI. Softgen AI was the first AI by coding apps and we grew it from 20k to half million error. And then we sold it after three months.",
      "start": 138070,
      "end": 252530
    },
    {
      "speaker": "B",
      "text": "Wow. I mean, that's amazing. Could you break down your framework for anyone watching on how to think about building and selling apps right now?",
      "start": 252690,
      "end": 260810
    },
    {
      "speaker": "A",
      "text": "Yeah, sure. So the first step is, of course, you need to set your goals. Do you want to sell it in three months, six months or more? So this is important because it defines, of course, your product roadmap development, your needs, and how fast you need to go. Start with, of course, defining what you want to do with your product. The step two is the validation stage. I usually validated product by using a single landing page builder named. Yep. So my only goal was, you know, to distribute the landing page on my X channel, collect emails from interested people and use the building public strategy. I usually consider like a 15% conversion rate on my landing page as a good buff. Then we have the step three, which is the building stage. So once it's validated, I can start building the Product with I call it the feedback loop approach. So in this case you need to build one key feature. You need to send the product link to the first batch of users who left the emails on the landing page you built. You can ask the feedback and based on that you can improve, improve the product and relaunch it. So it's going to be, you know, a sort of loop of build, feedback, edit and rebuild feedback, edit. The step four, of course, is the growth. So you need to grow your product. One key strategy here I've always applied to the organic growth has been the building public strategy, as mentioned before. And then the last step is the selling stage. You need to package, you know, the business as an asset someone else can run. The most important thing buyers want to know are error growth margins, average revenue per use, lifetime value, customer acquisition, cost, churn rate. So these are all key values and you should always work on getting the best as possible here.",
      "start": 260810,
      "end": 360960
    },
    {
      "speaker": "B",
      "text": "All right, Pat, from the future here. We're putting the finishing touches on this video and I just love the specific steps that DOM is sharing to go from an idea to a bank wire from the buyer. The key here is to ship fast. And if that's something you're struggling with, well, I have something for you. We just launched something called Starter Story Build. It's a program where you will learn how to use AI to build and launch a project to the real world. And the best part is that you don't need to have any coding experience. We'll give you the right prompts to use so that AI does the work for you. If you're actually ready to build and launch your product, head to the first link in the description to check out Starter Story Build. All right, let's get back into dom's story. When you look back at the projects you built, what was the difference maker? What was the trend in the really, really valuable stuff and the stuff that didn't really pan out?",
      "start": 360960,
      "end": 407980
    },
    {
      "speaker": "A",
      "text": "One interesting point here regarding the products I sold is that everything started from, I would say X, like all the projects based on trends and you know, sentiment analysis. I would say I code on X. The main difference between the projects is based on the trend you were running and the moment. So basically the timing, you know, that's the main difference.",
      "start": 408140,
      "end": 430600
    },
    {
      "speaker": "B",
      "text": "My other question that I have for you is around building with a full time job. You mentioned that you had a full time job, you were working a 9 to 5. How did you work on your projects and when did you decide to quit your job and go all in on this?",
      "start": 430600,
      "end": 442350
    },
    {
      "speaker": "A",
      "text": "I Started before all these side projects while working full time and I was, you know, looking for something different from the mass to just quit my job and that was basically Softgen. I quit my job as soon as I understood that Softgen could be really, really interesting. While working 9 to 5, I organized everything in my calendar. So I use different technique. I would say the most useful one is the Pomodoro technique where you break your work into focused intervals and typically 25 minutes followed by very short breaks. That was one of the most important techniques I used.",
      "start": 442580,
      "end": 479180
    },
    {
      "speaker": "B",
      "text": "All right, let's move topics a little bit. Could you walk me through what your tech stack looks like right now and what tools you use to build your businesses?",
      "start": 479180,
      "end": 485980
    },
    {
      "speaker": "A",
      "text": "The first projects were built using Babel for a very quick development. Then we have the cobotsai.com which is a Jo Rush product. Then we have Push Store for example for all the coding partners. Then we use for mailtrap for marketing Future base for the Public Roadmap Hunter IO for the outreach strategy. Make UGC AI for the UGC creators Hatio.com for the CRM Stripe for the financial services. Tiny Adz.com this is for running smart advertising campaigns. CreateOranted IO this is useful if you want to start marketing campaign with influencers. Ledit Co for the Reddit marketing Suna so for general agent tasks, these are the main tools I've been using for the past three years.",
      "start": 485980,
      "end": 532610
    },
    {
      "speaker": "B",
      "text": "Well, thanks for sharing that. Could you tell me a little bit more about, you know, what the next step looks like for you?",
      "start": 532610,
      "end": 537290
    },
    {
      "speaker": "A",
      "text": "Yeah. So right now I'm working on a setup named Cortex AI. Cortex is enabling the migration from human to AI workforce. When I answered the question how we can go into a company and automate up to 80% of the manual, the mundane and the ordinary tasks that humans do today.",
      "start": 537290,
      "end": 555630
    },
    {
      "speaker": "B",
      "text": "The last question that I have for you and what we ask everyone who comes onto the channel, if you could stand on young Domenico's shoulders when you're working that 9 to 5, what would be your advice?",
      "start": 555870,
      "end": 565550
    },
    {
      "speaker": "A",
      "text": "My advice here is the most important thing today. Adapt yourself to different situations and even change perspective if necessary. This is an untold story. Back in 2024, I was almost ready to quit my job. I was ready to jump into another company. I've already signed everything, so signed the new contract, left the house where I was staying. They. They called me and they said hey Dom, I'm sorry but we had financial problem and we are not able to hire you in this case. The event of course was a negative event, but I changed my perspective and said myself, okay, maybe this is the right time, the right opportunity to jump into something different. And that was object. So from a negative, of course, to a positive perspective. That's my advice to all the young founders.",
      "start": 565710,
      "end": 611390
    },
    {
      "speaker": "B",
      "text": "I think what you built is amazing and I'm really excited what you're building now over in sf. Thanks for coming on the channel. Looking forward to seeing what you do.",
      "start": 611390,
      "end": 619070
    },
    {
      "speaker": "A",
      "text": "Thanks for having me, but I want.",
      "start": 619230,
      "end": 620709
    },
    {
      "speaker": "B",
      "text": "To thank Dom for coming onto the channel. It's stories like this where someone changes their life completely by taking action on their dream even while working nine to five. These always inspire me. If you're looking to do something similar, then definitely check out Starter Story Build. It's our program where we will help you find an idea, build it with AI and ship it to the real world. In just a few days. You'll go from wanting to build something to actually building it, even if you have a full time job like Dom did. Just head to the first link in the description to learn more about what we're doing at Starter Story Build. All right, that's it for the episode. Thank you guys for watching. Let me know in the comments what you think, what you want me to cover next. We'll see you in the next one. Peace.",
      "start": 620709,
      "end": 660170
    }
  ]
}