{
  "source": "/home/salouri/Projects/starter_story/transcripts/GFnBp8lMIf4/GFnBp8lMIf4_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "Best kept secret in business is this product right here. What's up, Starter Story? My name is Pat. I'm the founder of Starter Story. And these are the essential tools I use to make over a million dollars a year. This might not be as cool as gq. I'm just a regular guy, but I wanted to show you just some of my little tchotchkes and random things that I use to make money online. The first tool that I use is Loom. I use Loom for, like, everything. Anytime I was going to write an email or give someone feedback on something or delegate some sort of project or teach someone in my business how to do something or give them feedback, I use it instead of writing an email. I think the craziest story about Loom is my buddy Peter Levels Levels IO on Twitter. If you're not familiar. I was telling him about some stuff that I'd done with email marketing. Just recorded a quick five minute Loom video, went over all of our Klaviyo flows, sent it off to him, just thinking nothing of it. He comes back to me and he's like, yo, this is like the most valuable thing I've ever watched. I think you could actually just like, sell this Loom video. I created the stripe payment link. We put it online, and it made $20,000 in one day just from pre orders. I didn't have to do anything. It was just a five minute loom video. Became $20,000 in a day. The most money I'd probably ever seen in a day at that point. All right, this is my latest obsession, which is tea. I'll let you guys know that I have a very addictive personality. And a few years ago, I found myself addicted to caffeine, addicted to coffee. I found myself having like five cups a day and then found myself having panic attacks and anxiety where my whole body was tingling all the time. And I thought that I had cerebral palsy, but I looked it up and it was just anxiety. So a couple years ago, me and my girlfriend decided to just quit coffee and switch to tea. This is my new favorite thing. And my favorite tea I just love the taste of it, is Earl Grey. And it's actually really cheap. Basically, you just get this tea right here, and you get hot boiling water in here, and then you just scoop some tea in there. And this really isn't gonna work because this isn't actually hot water right now. But let's pretend that that's gonna steep for a little bit. And then after about four minutes, I get my little cup and check this thing out. This is. What is this thing called again? No, this one. But basically you take this, you put it on top and it has this little magical little device right here where it just goes right through. And then you have your tea right here, put the cap back on and enjoy your tea. All right. What is this yellow thing? This is my favorite book. This is the book that changed my life. It's called Deep Work. When I first started my business, it was a side hustle. I had a full time job and obviously I had to pay the bills. I had to go into work from, you know, 9:00am to 5:00pm and that left me with only a few hours left in the day to actually make progress. And I found myself kind of scattered. I had like Twitter open. I had all these different things open and I wasn't getting anything done. Then I found this book and I learned about this idea of deep work, which is basically distraction free work. So I actually built my business while I had a full time job by waking up early, going to the Starbucks down the street, locking in, putting my headphones on, putting my playlist on, blocking all sites, blocking all distractions, turning my phone off and just doing deep work. Actually coding, writing, delegating and doing like the hardest, scariest things that I had to do to actually get a business launched while I had a full time job. After 365 days, I built a business that made money and I was able to quit my job. And it was really just that deep work showing up every day and actually making progress in this crazy distracted world that we live in. And shameless Plug. I believe in Deep Work so much that I've created a community around deep Work inside the Starter story Academy. There are hundreds of people doing deep work right now. Logging their progress, logging their deep work hours, building their idea, getting feedback and actually launching their thing and changing their life. If it's something that you think that you would be interested in trying out, you can download our Deep Work checklist. It's a full checklist on how to do the most effective deep work if you have a full time job and how that can tie into actually building a business. The link is in the description. I'd love if you guys checked it out. So this is a 16 inch MacBook Pro. It's the perfect size, if you know what I'm saying. I think the 16 inch is perfect because it has like a big enough screen that you can not need an external monitor. And also it can fit in your backpack. I like it. So that this is all that I need. So that if I'm working from a coffee shop or I'm working from the airplane, I'm working from somewhere all the way across the world, or if I'm just working in my house, this, that I don't need anything. I don't need a mouse, I don't need a keyboard, I don't need an external monitor. I have my whole setup right here. If Apple charged $20,000 for this, I would still buy it. I think it is the most. It just blows my mind that, you know, in 2024, now that you can build a billion dollar business from one laptop in one idea. Do you remember the video with Alex Goldberg, I think his name was? It was my laptop we were using for B roll. And they were talking about all the crumbs on his laptop in the comments. I didn't see it. That was because when we flew there, I ate one of those little, you know, those little gingerbread things they give you on the flight and I got crumbs all over it. You've probably heard of this before. This is Reddit, one of the biggest websites in the world, one of the biggest platforms in the world. One of the best ways to get the first customers from your startup. I had created Starter Story. I thought it was going to be this massive success when I first created the website, and then no one showed up. Right after a few months of trying to figure out how can I get customers, I created one post on Reddit that essentially went viral. And it wasn't even that viral. It got like 400 upvotes or something like that. But that led to like a thousand people that signed up for my email list and then led to like the first customers and the first audience building that I ever did. The hard part about Reddit is Redditors, they fucking hate spam. They can smell your solicitation from a mile away. My advice for anyone who's trying to get their first customer on Reddit or trying to just get their first customer in general, is go to those subreddits, sort by the top posts and look for posts that are kind of secretly showing off a startup. You'll probably figure something out. And don't give up on the first try either. Keep trying and eventually you'll get your first customer. I know, like a bunch of founders. We've interviewed some people here on Starter Story, who through one Reddit post, they changed their life. They quit their job and they built a business that changed their lives. I love that smell. All right, so what do we got here? All right, we got my favorite thing, probably in the world, which is tennis. When you're building a business, especially if you're doing something like a solopreneur, you get so caught up in the online world and all the results and all the metrics, that one of the best things I've done is found a hobby that can take me away from that for even just an hour or two per day. I picked up tennis maybe four years ago when Covid was happening. You know, before that, I was doing a lot of running. I ran a couple marathons. I liked running, but I would always kind of dread going for runs a little bit. And when I started playing tennis, I found myself wanting to get up early in the morning and go play. And looking forward every single time. For anybody that's struggling to get to the gym or workout, my number one advice is to find something that's actually fun to do that doesn't feel like working out. I've heard rock climbing is pretty good. I've heard pickleball, and tennis is the one for me. What's your favorite tennis player? Djokovic. Novak Djokovic is my favorite tennis player because he's the black sheep. Nobody liked him. He was the underdog. And as you guys know, I love the underdog. This right here, this is our pride and joy. This is our 100,000 YouTube subscriber plaque in 2024. It doesn't matter what product you build. It doesn't matter how good your product is. It is about the distribution of your product. YouTube is, I think, one of the best ways to do that, because there's real people watching this right now, real people behind the screen that actually you build a relationship with can change your life overnight by just creating a video. How crazy is that? So I think that's amazing. I think that YouTube is the future. Like, you just saw that Tom Brady and Cristiano Ronaldo created YouTube channels. Everybody wants to be on YouTube. Everybody wants to be a YouTuber now, and it's definitely not too late. So I think that YouTube is probably one of the most. It's the most essential thing in starter stories business. It has changed our business, and I want to create more great content that you guys love, and we'll see you at a million subscribers. So tell me about your addiction. This one's gonna get dark, by the way. Yeah, good. My name is Pat, and I'm a nicotine aholic. This is Zyn. These are pouches of nicotine that you can put into your mouth and get high. Being completely transparent and vulnerable. I've been addicted to nicotine on and off my whole life. In high school I had my first cigarette and I loved that shit. That shit was amazing. I was chasing that high for a long time. I'm not proud of this. I'm ashamed of it. But the goal of this video is to be honest with you and show you the actual things that I use on the day to day. I like it for zoning in, for coding, pop that in, zone in, put my headphones on and just do the thing. This shit is super addicting. And actually my family has a history of heart disease. So when I told my doctor this, they told me that I needed to get off of it immediately. So right now put it in the comments and tell me that I should stop and I hope to be off it by next time. Billion dollar company, fucking legit. Best kept secret in business is this product right here. Tell me about it. This is Klaviyo. It is email marketing software. It's email and SMS marketing software. Right now we have a list of 250 to 300,000 people, which means we spend about $4,000 a month and send some millions of emails every month. This is actually cheap compared to the revenue that it generates. It technically generates somewhere between 80 to $120,000 a month. It's different every month, but that would be like an average of what that looks like. So Funny Story is actually Klaviyo. They were the very, very first sponsor of starter story. The CEO who started it, he sent me a check for $12,000 to sponsor the newsletter. They're probably a big reason that Starter Story exists now. But you don't have to use Klaviyo. I think the most important thing is that you do implement some sort of email marketing strategy into your business. I think it's one of the most underrated things that people don't actually do. Really simple stuff like having a welcome sequence. When someone signs up to your email list, you send 1, 2, 3, 4, 5 different emails and tell a story in your emails and, and then set up basic stuff like when they go to your checkout page and they don't buy something, you send them some emails to remind them and potentially even send them a discount. These are called either called email flows or email sequences. All businesses that make a lot of money, they do this. So yeah, Klaviyo, that shit works. Thank you guys for watching. I hope you got some inspiration, maybe found a cool thing or two. I'll see you guys in the next one. Peace, Sam.",
      "start": 640,
      "end": 777090
    }
  ]
}