{
  "source": "/home/salouri/Projects/starter_story/transcripts/G5cbMnFXcj0/G5cbMnFXcj0_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "This is Charlie. He makes $200,000 a month with six different YouTube channels. And the crazy part is he's actually an introvert. I flew out to California to get his story and ask him exactly how he got good at YouTube and the monetization strategy he uses to make over $2.4 million a year.",
      "start": 240,
      "end": 20480
    },
    {
      "speaker": "B",
      "text": "Most of my money is made through it right now.",
      "start": 20560,
      "end": 23120
    },
    {
      "speaker": "A",
      "text": "Charlie started his journey making $0 for months. Then he learned a secret and created one video.",
      "start": 23120,
      "end": 30560
    },
    {
      "speaker": "B",
      "text": "Everything in the actual video itself, we had a lot. So that's really how you get people to click on it and then actually watch the entire video.",
      "start": 32380,
      "end": 39580
    },
    {
      "speaker": "A",
      "text": "In this video, he breaks down the blueprint for how Anyone can make $200,000 a month with YouTube. How to create videos that get millions of views and his advice for all new entrepreneurs just starting out.",
      "start": 39580,
      "end": 52500
    },
    {
      "speaker": "B",
      "text": "I focus on not just making viral.",
      "start": 52500,
      "end": 54900
    },
    {
      "speaker": "A",
      "text": "Videos, but I'm Pat Walls and this is Starter Story.",
      "start": 54900,
      "end": 59430
    },
    {
      "speaker": "C",
      "text": "Thanks for having me, man. Your place is awesome.",
      "start": 59830,
      "end": 61990
    },
    {
      "speaker": "B",
      "text": "Thank you. Thanks for coming.",
      "start": 61990,
      "end": 62990
    },
    {
      "speaker": "C",
      "text": "Tell me about yourself and what you built.",
      "start": 62990,
      "end": 64590
    },
    {
      "speaker": "B",
      "text": "I'm Charlie. I'm 31 years old and I am an entrepreneur in Southern California. I currently have six plus YouTube channels. On a typical month, we'll do 200 to 250k in revenue. We just had our best month ever. This month we'll do close to 300k. That's for the YouTube channels and then for the staffing company. We started that last year. It's a low six figure company right now, but I'm putting most of my energy into that one because we want to grow it and be able to maybe get acquired someday.",
      "start": 64590,
      "end": 94010
    },
    {
      "speaker": "C",
      "text": "All right, if you can break down a little bit more about all the channels and all the businesses that you've built and how you make money.",
      "start": 94010,
      "end": 99730
    },
    {
      "speaker": "B",
      "text": "So my main channel is just called Charlie Chang. My name. We have, I think 1.1 million subscribers. Have another channel called SARP wise has about 50,000 subscribers. And then we have Charlie Chang show the Penthouse. My first website is when we just started. It has like 600 subscribers. As of right now. Most of my money is made through affiliate marketing. Right now I'd say about 50 to 55% of the revenue that comes in. We also do brand sponsorships, so that's usually like 20, 25%. And then AdSense is also going to be 20, 25%. That's across all the different channels.",
      "start": 99890,
      "end": 130830
    },
    {
      "speaker": "C",
      "text": "Yeah. So you're a subscriber of Starter Story, right?",
      "start": 130830,
      "end": 133230
    },
    {
      "speaker": "B",
      "text": "I am, yeah. For about, I think, six months now.",
      "start": 133230,
      "end": 135630
    },
    {
      "speaker": "C",
      "text": "Nice. What do you like about it or what do you use it for?",
      "start": 135630,
      "end": 137790
    },
    {
      "speaker": "B",
      "text": "So I think a huge part of how I was able to do pretty well was because I spent a lot of my time brainstorming, learning, like seeing what other people do. So that's why. Yeah, I think I get a ton of value from starter story. Just because these are like crazy case studies. Just allows me to stay on trends, it allows me to see how other people do it. I sort of view it as like a mentorship.",
      "start": 137870,
      "end": 156740
    },
    {
      "speaker": "C",
      "text": "Yeah, that's awesome. If anyone is looking for ideas for their own business, you can check out start a story dot com, learn from thousands of founders who are just a few steps ahead of you. People that haven't necessarily raised money from VC or you know, have super rich parents. These are case studies. People that turned a simple side projects or passive income sources into businesses that completely changed their lives. So check it out in the link in the description. Tell me about what life was like growing up and how you became an entrepreneur.",
      "start": 156740,
      "end": 185570
    },
    {
      "speaker": "B",
      "text": "So I grew up in a non entrepreneurial household. My parents really wanted me to be a doctor. Went to college not knowing what I was going to do after I graduated, could not find a job for the life of me. So I basically just started doing work for myself. I'd done like every side hustle in the world, photography, video, print, modeling and like a little bit of acting. I started a clothing brand, I had a marketing agency, real estate, mortgages, everything. It was definitely hard though because when I first graduated college I was basically making $0. Seeing all my friends with their high paying like accounting jobs, it didn't make me feel good. I sort of felt like not successful. But I think there are a lot of people out there in a similar situation where they don't want to go the traditional route, they don't want to do something that their parents want them to do. And if I can just tell them one thing, it's like with enough persistence, with enough risk taking, you can just pretty much do anything you want. After a little bit I sort of started getting some more clients and stuff like that. I was making about like $50,000. And then in 2020 that's basically when the YouTube channel started taking off. I think I made $750 in one single day from AdSense. And that's when I was like, dang, this could be something big.",
      "start": 186050,
      "end": 256540
    },
    {
      "speaker": "C",
      "text": "What did you do after that?",
      "start": 256540,
      "end": 257860
    },
    {
      "speaker": "B",
      "text": "I just basically started learning a ton about YouTube, how to monetize, how to make more content, did a ton of brainstorming on what types of content I can make that were doing well at that time. I videos Almost every single day. I was like, if I can make this opportunity work, it's going to be life changing. The growth was pretty fast. Like 500 to 1,000 subscribers per day. In terms of Adsense, we were doing maybe 10 to 20k a month. Yeah. So that was a huge change for me.",
      "start": 257860,
      "end": 284320
    },
    {
      "speaker": "C",
      "text": "And were you just doing all by yourself then? You said we, but was it just you?",
      "start": 284559,
      "end": 287600
    },
    {
      "speaker": "B",
      "text": "Yeah, that was completely me. So I did everything myself.",
      "start": 287600,
      "end": 290200
    },
    {
      "speaker": "C",
      "text": "Yeah. How long did it take to actually get good at YouTube?",
      "start": 290200,
      "end": 293120
    },
    {
      "speaker": "B",
      "text": "I'd say one or two years. I'd started making finance content in 2018 and my first videos were super bad. A big thing that got me to be pretty good at YouTube was just being able to present information in a way that makes people want to stay and that they can actually understand. People watching YouTube aren't going to be super technical, so you have to really break it down in a way that's easy to understand. Even if you're super introverted like I am, even if you don't have, like natural ability on camera, you can get good at it.",
      "start": 293120,
      "end": 321490
    },
    {
      "speaker": "C",
      "text": "Yeah. What are little things that you would advise for people to improve as they keep making videos?",
      "start": 321490,
      "end": 326370
    },
    {
      "speaker": "B",
      "text": "I'd say it's always important to up your projection quality, quality or improve some aspect of your videos, whether it be camera, audio, storytelling, stuff like that. I think everyone needs to go into any business, especially YouTube, thinking, I just need to make enough videos until I get one that pops off. I also think it's really important to be brainstorming and thinking about different potential pivots you can make. For example, when crypto was booming, I started making content about crypto. When stocks were booming, I started making content about stocks. When side hustles were booming, I started making content about side hustles. I understand what types of things people are looking for, and I make content that doesn't need to be brand new for it to be relevant.",
      "start": 326370,
      "end": 368760
    },
    {
      "speaker": "C",
      "text": "How do you really get views on YouTube? How do you make great videos that get millions of views?",
      "start": 369320,
      "end": 374240
    },
    {
      "speaker": "B",
      "text": "I focus on not just making viral videos, but making videos that people are searching for. One of my most popular videos is just talking about my different sources of income. So something like that, where you have an age that people can relate to. Big number, like 10 sources of income. People like, whoa. And then a dollar amount just really makes them curious to click on it. Those types of titles have done really well for me. So a huge part of my channel is evergreen SEO content. For example, how to invest in stocks. I'll make something like that. That's something that people are actively searching for. I don't focus just on the virality. I prefer to go the searchable route.",
      "start": 374240,
      "end": 409660
    },
    {
      "speaker": "C",
      "text": "Yeah.",
      "start": 409660,
      "end": 409940
    },
    {
      "speaker": "B",
      "text": "In terms of videos that perform extremely well too. For example, I did a video called asking Coachella VIPs what they do for a living. I thought that was the perfect blend of an experience that most people don't get to have. Good thumbnail. It was also trending because Coachella was happening at the time. And then in the actual video itself, we had a lot of storytelling. So that's really how you get people to click on it and then actually watch the entire video.",
      "start": 409940,
      "end": 432920
    },
    {
      "speaker": "C",
      "text": "Yeah. What kind of tools and software do you use to run your business and to improve your business?",
      "start": 432920,
      "end": 437640
    },
    {
      "speaker": "B",
      "text": "So all of our content planning is on ClickUp. We use Frame IO for uploading footage and having our editors drafts on there. We make revision comments, stuff like that. There's tools like 1 of 10 and Creator Hooks Pro to come up with thumbnail ideas and title ideas. We have a pretty big team now for all team communication. We use Slack, so that's been great. In terms of managing a lot of our talent, we use Hubstaff, which is a super good time tracking tool. And then in terms of AI tools, we are using a good amount of them to help with the content production process, just to make it more efficient. For example, for short form content, we use Sub Magic descript and we use Opus. Those really help us be able to push out a lot of short form content from our long form content. That's something I always tell people. If you make long form content, you might as well cut that up into short form content.",
      "start": 438040,
      "end": 486880
    },
    {
      "speaker": "C",
      "text": "All right, let's break down some of the financials behind the business. How much does it cost to run this business and what does your team.",
      "start": 486880,
      "end": 492520
    },
    {
      "speaker": "B",
      "text": "Look like for the media business? We currently have 26 people. There's me, there's my COO, which is the other guy that's local. Under him, we basically have two or three different project managers. Each of those project managers works with a ton of video editors, thumbnail people, a graphics person, a website person, a lot of miscellaneous roles like that. In terms of the cost to run that team, it's about 20, $25,000 a month. And that's because we're just so heavily using overseas talent.",
      "start": 492520,
      "end": 520010
    },
    {
      "speaker": "C",
      "text": "And how are you able to find a lot of these team members?",
      "start": 520010,
      "end": 522410
    },
    {
      "speaker": "B",
      "text": "Combination of upwork, fiverr online jobs. But most of our current team members are actually from Paired, which is the.",
      "start": 522490,
      "end": 528980
    },
    {
      "speaker": "C",
      "text": "Overseas staffing company you're using your own app to.",
      "start": 528980,
      "end": 531740
    },
    {
      "speaker": "B",
      "text": "Oh, yeah, 100%, yeah. Yeah, it's the perfect pairing. Yeah, hiring overseas is great, but it's super hard to find really talented people. So we basically have our local recruitment teams. They go out there, they'll sort through like three to 500 people, find the best one or two people, and then present those people to you. So that's basically what our service does.",
      "start": 531820,
      "end": 550780
    },
    {
      "speaker": "C",
      "text": "And what kind of cost would people be looking at if they wanted to hire someone through your company?",
      "start": 550780,
      "end": 554780
    },
    {
      "speaker": "B",
      "text": "Yeah, so we charge a one time placement fee. We don't take money from the client and then pass it on to the talent. It's a full handoff, which saves people a lot of money. A full time person for most positions I'd say is about $600 to $1,000 per month.",
      "start": 554780,
      "end": 568160
    },
    {
      "speaker": "C",
      "text": "You have these successful YouTube channels and now you're starting a little bit of a different business with your staffing firm. Why did you decide to start that?",
      "start": 568160,
      "end": 574920
    },
    {
      "speaker": "B",
      "text": "I want to be more of a traditional entrepreneur where I have equity in a business. And while I have the channels behind me, the marketing, it makes sense to build something that I can use my channels to help grow.",
      "start": 574920,
      "end": 584520
    },
    {
      "speaker": "C",
      "text": "All right, so for anyone watching that wants to get into entrepreneurship, what should they do?",
      "start": 584520,
      "end": 588540
    },
    {
      "speaker": "B",
      "text": "Surround yourself with content and people that are doing it. It just makes it seem like it's all possible. Right. And then I would try and learn some type of high value skill. There's tons of skills you can learn within a few months, I think that you can start to monetize. They all sort of build on top of each other and they all allow you to be better at the next thing. Personally for me, I've never built a company that took up a ton of capital to start. I think doing some type of agency or service based business is the best way for anyone to to get started.",
      "start": 588540,
      "end": 614220
    },
    {
      "speaker": "C",
      "text": "For any of the viewers watching, if you want to get started with an agency or service model, you can check out our 100 productized services where you can learn exactly how businesses are using the productized service model. How much money they make, how they grew, how they got customers. That's in the link down below in the description.",
      "start": 614220,
      "end": 630340
    },
    {
      "speaker": "B",
      "text": "Another thing that I've learned recently is really not trying to do everything myself. I used to think that I wanted to be a solopreneur for the rest of my life. But after you hire first person, you realize, okay, this is what an actual business is, right? Because it's a business that can run without yourself. You don't need to always be there for it to work.",
      "start": 630340,
      "end": 647650
    },
    {
      "speaker": "C",
      "text": "Some people that might be watching this may be feeling A little bit of analysis paralysis on what idea they should start. What's your answer to that?",
      "start": 647730,
      "end": 654450
    },
    {
      "speaker": "B",
      "text": "Well, I would tell them is just don't overanalyze it. Pick something. If it's the wrong answer or if it's the wrong thing, then you'll just learn from that and you won't make that mistake. If it's the right thing, then you made a fast decision, right?",
      "start": 654450,
      "end": 664530
    },
    {
      "speaker": "C",
      "text": "Yeah.",
      "start": 664530,
      "end": 664850
    },
    {
      "speaker": "B",
      "text": "Think speed for successful people is such a universal trait. For anyone that thinks they're in a rut or they want to have a big breakthrough, I'd say one thing they can do is really change their environment or change the routine like completely. And same thing with location. If you're stuck in a city where you feel like you're not growing as much as you should be, move to a different city.",
      "start": 664850,
      "end": 685230
    },
    {
      "speaker": "C",
      "text": "All right, tell me what a day in the life is like for you.",
      "start": 685230,
      "end": 687750
    },
    {
      "speaker": "B",
      "text": "Every day is quite different, which I think is the best part about entrepreneurship, at least for me. I usually wake up 5:30 to 6:30am, do a little morning routine, probably hit the gym, get some work done, and then the rest of the day is just working, going out.",
      "start": 687750,
      "end": 702950
    },
    {
      "speaker": "C",
      "text": "How much do you usually work per day?",
      "start": 702950,
      "end": 704950
    },
    {
      "speaker": "B",
      "text": "I'd say a typical work week is going to be 30 to 50 hours of actual work and then who knows how much brainstorming and thinking about it.",
      "start": 704950,
      "end": 713430
    },
    {
      "speaker": "C",
      "text": "So you're always on kind of thing?",
      "start": 713510,
      "end": 714870
    },
    {
      "speaker": "B",
      "text": "I think I'm always on, yeah. It's like a lifestyle business. Right. I try and make my life part of the business. Yeah. And I enjoy having that mix. Yeah.",
      "start": 714870,
      "end": 723060
    },
    {
      "speaker": "C",
      "text": "What do you like to do for fun or for leisure?",
      "start": 723060,
      "end": 726500
    },
    {
      "speaker": "B",
      "text": "I like to work out. I like to watch Netflix with my girlfriend, play pickleball, play music.",
      "start": 726500,
      "end": 733060
    },
    {
      "speaker": "C",
      "text": "And this business is also afforded you some nice cars. You have a car buying habit?",
      "start": 733380,
      "end": 737940
    },
    {
      "speaker": "B",
      "text": "I would say it's a car buying habit, but yeah, I have three cars now, I guess.",
      "start": 737940,
      "end": 741300
    },
    {
      "speaker": "C",
      "text": "What you got?",
      "start": 741380,
      "end": 742060
    },
    {
      "speaker": "B",
      "text": "I have an RV Sprinter van that we just got. I have a Range Rover and I have a Ferrari.",
      "start": 742060,
      "end": 747570
    },
    {
      "speaker": "C",
      "text": "Why did you buy the Sprinter van?",
      "start": 747800,
      "end": 749080
    },
    {
      "speaker": "B",
      "text": "Tax write off.",
      "start": 749800,
      "end": 750680
    },
    {
      "speaker": "C",
      "text": "If you were to give any advice to your younger self when you were just starting out with the side hustles, what would that be?",
      "start": 751240,
      "end": 756840
    },
    {
      "speaker": "B",
      "text": "I think it'd be to carve out my own identity myself rather than try and do things that are expected or that society says is normal. So I've been a people pleaser, I think all my life. Always felt sort of out of place because I want to do different projects and things. I couldn't really ever talk with other people that want to do something similar. Moving here, meeting so many entrepreneurs, getting to pursue entrepreneurship myself, it's really allowed me to grow as a person and be surrounded by the energy that I've, I think always wanted to be surrounded by.",
      "start": 756840,
      "end": 785000
    },
    {
      "speaker": "C",
      "text": "Awesome. Thank you so much Charlie.",
      "start": 785000,
      "end": 787440
    },
    {
      "speaker": "B",
      "text": "Thank you.",
      "start": 787440,
      "end": 787880
    },
    {
      "speaker": "C",
      "text": "Follow this advice and you will be a multi million dollar and multi million subscriber YouTube channel PE.",
      "start": 788920,
      "end": 795720
    }
  ]
}