{
  "source": "/home/salouri/Projects/starter_story/transcripts/hCvy-Rt7Naw/hCvy-Rt7Naw_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "I was sitting at work getting paid 17 bucks an hour and I got a notification for a sale on my phone. $450. Nope, just got a $400 sale. I was like, I would have had to be here for like 20 something hours to make that much money. Now I'm doing about 20 to 30k a month.",
      "start": 80,
      "end": 17680
    },
    {
      "speaker": "B",
      "text": "All right, we got a fun day ahead. We're about to go meet up with Chris. He makes $30,000 a month making food. He's going to show us exactly how he does it. Hey.",
      "start": 18960,
      "end": 30090
    },
    {
      "speaker": "A",
      "text": "Hey. What's up, bro? Good to see you, brother. Yeah. How you doing?",
      "start": 30090,
      "end": 32610
    },
    {
      "speaker": "B",
      "text": "And how are you able to actually turn this into a business?",
      "start": 36050,
      "end": 38130
    },
    {
      "speaker": "A",
      "text": "So I was able to sell two different cookbooks. My like essential recipes as well as a budget cookbook. Just cheaper cuts of meat and stuff like that. Make customized meal plans. So people come to me with different goals, different issues, different schedules, schedules. And I tailor a meal plan to them to work for them. So if someone is very busy or someone is traveling a lot or they can't eat certain foods, I will tailor that meal plan to them and I will give them recipes too. And then I also do one on one nutrition coaching as well as group coaching.",
      "start": 38130,
      "end": 69620
    },
    {
      "speaker": "B",
      "text": "Where does your business live? Are you on the Internet or pretty.",
      "start": 69620,
      "end": 72940
    },
    {
      "speaker": "A",
      "text": "Much all from Twitter right now? Been fortunate enough to only use Twitter as marketing all organic content.",
      "start": 72940,
      "end": 79140
    },
    {
      "speaker": "B",
      "text": "What were you posting on Twitter?",
      "start": 79220,
      "end": 80460
    },
    {
      "speaker": "A",
      "text": "So I got a lot from longer form writing from threads on different nutrition topics, recipes and food pictures as well. I was able to quit my job in May, so I've been doing it full time since then.",
      "start": 80460,
      "end": 92680
    },
    {
      "speaker": "B",
      "text": "What were you doing before?",
      "start": 92680,
      "end": 93520
    },
    {
      "speaker": "A",
      "text": "So I bounced around a lot actually. I studied business in college. Pretty rough for a while. I really was unsatisfied with what I was doing. Probably had like five different office jobs, but I was really diving into the health stuff then I almost used it as like an escape from that life that I knew I just didn't want to do. So then I wound up leaving the office and I worked at a wellness center that did like cryotherapy and. And then just as a side hustle posting, you know, what I did as far as nutrition cooking on Twitter.",
      "start": 93600,
      "end": 124840
    },
    {
      "speaker": "B",
      "text": "So how long were you doing it as a side hustle until you went full time? What did that look like?",
      "start": 124840,
      "end": 128600
    },
    {
      "speaker": "A",
      "text": "So I started actually tweeting it probably for about a year, but as far as the business taking off, probably six months. I was doing it while I was working.",
      "start": 128600,
      "end": 137680
    },
    {
      "speaker": "B",
      "text": "So when did you realize that you could take this passion that you have, which was cooking and actually turn into a business.",
      "start": 137680,
      "end": 144010
    },
    {
      "speaker": "A",
      "text": "I really was influencing a lot of people in my life already and I saw all these people making money online and I knew I could do it, but really I just didn't know how to start. And I think a lot of people make the mistake of trying to optimize small things that don't matter. Twitter header, the profile picture, like having the perfect business plan in place, all that stuff doesn't matter. And it was one day where I just said, screw it, I'm just going to start posting what I do every day and stay consistent with it. Eventually it would catch on, and it did catch on rather quickly.",
      "start": 144170,
      "end": 176430
    },
    {
      "speaker": "B",
      "text": "What was the biggest thing that moved your business? Help it become a real.",
      "start": 176430,
      "end": 179470
    },
    {
      "speaker": "A",
      "text": "The biggest thing is just being consistent and showing up every day, even if it feels like you're talking to a wall. Obviously when you start out with a business on social media, you start out with very little followers, right? So it felt like for a while I was talking to a wall. And it is frustrating, but eventually I think I had a thread I wrote about grass fed beef that like overnight took off. Got like a few hundred followers overnight. And I was like, all right, like this is real. And then I was like, just continue to do it. And that's the biggest thing. People get discouraged, you know, after a month or two and it's not taking off the way they would expect. And I think that's the biggest thing is just continuing to do it even if you're not getting results early on.",
      "start": 179470,
      "end": 217490
    },
    {
      "speaker": "B",
      "text": "What was the amount where you're like, I'm ready to take this full time.",
      "start": 217890,
      "end": 220570
    },
    {
      "speaker": "A",
      "text": "I was probably making 5 to 8,000amonth when I quit.",
      "start": 220570,
      "end": 224050
    },
    {
      "speaker": "B",
      "text": "And when you went full time on it, did you see the revenue go up or when you were able to put all your passion?",
      "start": 224050,
      "end": 228330
    },
    {
      "speaker": "A",
      "text": "It went up pretty much every month since then. Now I'm doing about 20 to 30k a month. And what really hit me one time was I was sitting at work getting paid 17 bucks an hour and I got a notification for sale on my phone, $450. And I was like, I would have had to be here for like 20 something hours to make that much money. And then I was just like, all right, it's time, you know, and now cooking with Chris or whatever, that'd be great. We're just getting that pan nice and hot. We're just going to throw the shrimp on a salt tour. How many people have five different types of salt? Got that raw colostrum?",
      "start": 228330,
      "end": 272190
    },
    {
      "speaker": "B",
      "text": "What is that?",
      "start": 272830,
      "end": 273550
    },
    {
      "speaker": "A",
      "text": "Titty milk of the cow. They think you're A little weird when you have this, but I always do cook. I mean, when I was in college, we'd be getting home from the bar at 2am and I'd be making people French toast and stuff like that. Shrimp is pure protein. So people trying to lose weight. Shrimp is amazing for. I mean, it's been enough time. Come over here and see who's looking in my window. You always gotta add a little greenery on top of the meal. Whatever.",
      "start": 274030,
      "end": 301370
    },
    {
      "speaker": "B",
      "text": "What do you call this?",
      "start": 304650,
      "end": 305490
    },
    {
      "speaker": "A",
      "text": "Oh, honey. Garlic shrimp.",
      "start": 305490,
      "end": 307690
    },
    {
      "speaker": "B",
      "text": "How old are you?",
      "start": 312490,
      "end": 313250
    },
    {
      "speaker": "A",
      "text": "29.",
      "start": 313250,
      "end": 313736
    },
    {
      "speaker": "B",
      "text": "29, okay.",
      "start": 313844,
      "end": 314690
    },
    {
      "speaker": "A",
      "text": "I knew that I had something that I would be able to make a lot of money from. It was just about taking that first step forward and just continuing the momentum. If you solve an expensive problem, then you will get paid a lot for it. People's health is very important, and if you can change someone's life forever in two, three months of working with them, it's worth a lot of money. And I think that goes for anything, not just health.",
      "start": 314690,
      "end": 339470
    },
    {
      "speaker": "B",
      "text": "This is something that people don't realize is like a business is really just helping people. So if you can find a way to help people just in your daily life, help one person or two people, that can be a business.",
      "start": 339470,
      "end": 350390
    },
    {
      "speaker": "A",
      "text": "Exactly. And I would be doing this whether or not I was getting paid for it anyway, because this is what I love to do. So, like, why not get paid for it too?",
      "start": 350550,
      "end": 358550
    },
    {
      "speaker": "B",
      "text": "What advice would you have for people that could find something that they're passionate about?",
      "start": 358550,
      "end": 361150
    },
    {
      "speaker": "A",
      "text": "I think a lot of it's just about living life and just experiencing different things. If you are just trying to find a passion, you're probably not going to find it just by actively seeking it. So live your life, experience different things, and the things that will eventually be your passion will come to you.",
      "start": 361310,
      "end": 379990
    },
    {
      "speaker": "B",
      "text": "What advice would you have for someone who's a chef or an artist or someone who does something creative like that? What advice would you have to be able to turn that into at least a side hustle in a business?",
      "start": 379990,
      "end": 390240
    },
    {
      "speaker": "A",
      "text": "I think just documenting everything you do and thinking about unique skills that you have. You know, there are tons of chefs out there, tons of people that cook, there are tons of nutritionists. But if you have unique ability to do one thing, capitalize on that. And that's kind of what I've done, is be able to make very nice looking, enjoyable meals that are also very nutrient dense and healthy for you. So if you do have that one thing that you could really dial in on, that's where you're going to separate yourself.",
      "start": 390320,
      "end": 419140
    },
    {
      "speaker": "B",
      "text": "How much does it cost to run a business like this. And I can't imagine it.",
      "start": 419140,
      "end": 422700
    },
    {
      "speaker": "A",
      "text": "No, it's just an eight dollar a month Twitter blue fee. Really not much overhead at all. I mean, I pay a lot for groceries to make meals with very high quality ingredients. Again, I'd probably be doing that anyway whether or not I was doing this for a living. I've invested in my self having some mentors and some business coaches to help me with that side of things. So that's probably the most that I've actually paid for. People say it all the time, you need to spend money to make money. And if you don't have a lot of money and you start making it, you want to hold on to every penny. That's kind of how I felt at the beginning. Like I don't want to shell out 3, 5 grand for someone, but if that 5 grand can make you money the rest of your life, it's always worth it. But I think it is important to invest in yourself, especially early on if you're in like a safe environment, you know, you're expenses are taken care of and it will pay itself back tenfold.",
      "start": 422780,
      "end": 476720
    },
    {
      "speaker": "B",
      "text": "How much do you work every day? Do you work a lot or what's your.",
      "start": 476720,
      "end": 479680
    },
    {
      "speaker": "A",
      "text": "I've been very busy. Usually I wake up, do my little morning routine, breakfast, and then I'll do a few hours on the computer as far as like meal planning, content for Twitter, stuff like that. Then I'll usually work out, I'll come back and then I usually have a lot of afternoon calls. So I'll spend anywhere from two to four, sometimes even five hours on the phone with clients. And then usually I'm making some type of meal for dinner that you know, I share on Twitter and that helps me with cookbook sales and things like that. So yeah, definitely busy. But the good thing is you can make your own schedule. I can come up here and get some sun for an hour in the middle of the day. So I wouldn't trade it for the world.",
      "start": 481520,
      "end": 520260
    },
    {
      "speaker": "B",
      "text": "Hey, what's up guys? This is Pat. Thank you so much for watching this video. We're going to be interviewing a ton of more entrepreneurs like this, so if you like this video, please like and subscribe. And if you have any questions you want me to ask entrepreneurs that we interview in the future, just leave it as a comment. Alright guys, thanks for watching. I'll see you in the next one.",
      "start": 520260,
      "end": 537260
    }
  ]
}