{
  "source": "/home/salouri/Projects/starter_story/transcripts/IuoscQiQQLg/IuoscQiQQLg_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "What's your story? I mean, we bootstrapped this thing from day one and we needed to be profitable. We didn't have any money to put in. We couldn't afford to lose.",
      "start": 160,
      "end": 9760
    },
    {
      "speaker": "B",
      "text": "This is Aaron Spivak and he nearly lost everything launching a business. At first he thought he was a founder genius.",
      "start": 10080,
      "end": 17840
    },
    {
      "speaker": "A",
      "text": "We were doing 30k a month, 60k a month, 90k a month.",
      "start": 17920,
      "end": 21920
    },
    {
      "speaker": "B",
      "text": "But then realized it was just beginner's luck.",
      "start": 22000,
      "end": 24960
    },
    {
      "speaker": "A",
      "text": "You know. Our first summer we went to zero. It was a moment of like, are you guys actually going to do this or not?",
      "start": 25200,
      "end": 30800
    },
    {
      "speaker": "B",
      "text": "So what happens when, when you're staring in the face of failure and your bank account is losing money every day?",
      "start": 31040,
      "end": 36140
    },
    {
      "speaker": "A",
      "text": "My co founder Lior called me and he's like, hey, we gotta shut this business down.",
      "start": 36140,
      "end": 40180
    },
    {
      "speaker": "B",
      "text": "Do you give up, need to prove.",
      "start": 40180,
      "end": 41940
    },
    {
      "speaker": "A",
      "text": "That there was something here?",
      "start": 41940,
      "end": 43860
    },
    {
      "speaker": "B",
      "text": "Or do you jump even further into the abyss and go to the ends of the earth just to find a way to make it work?",
      "start": 43860,
      "end": 49420
    },
    {
      "speaker": "A",
      "text": "We broke the Internet, we went viral on Netflix for doing that for the first time ever. In that moment I was like, that's why we storytelled.",
      "start": 49660,
      "end": 58260
    },
    {
      "speaker": "B",
      "text": "This is the story of how two guys from Toronto turned $4,000 into 48 million DOL in four years. I'm Pat Walls and this is Starter Story. Growing up, Aaron was your typical young entrepreneur, hustling and starting just about everything. Lemonade stands, party buses, and even starting his own juice shop in Toronto. But everything changed when he met Lior, his eventual business partner. He realized there was a bigger opportunity, starting an online business.",
      "start": 58260,
      "end": 86440
    },
    {
      "speaker": "A",
      "text": "I always wanted to really start a business with Lior. I thought he was just super smart. He was like in that online world. I was opening up juice shops and making smoothie recipes and I actually wanted to sell cricket protein, like grinded up crickets. And I brought it to Lior and he's like, that's disgusting. But have you seen this rise in weighted blankets? And then we went on Google and we saw that there was 300,000 people searching for weighted blankets.",
      "start": 86600,
      "end": 111860
    },
    {
      "speaker": "B",
      "text": "In the coming months, with enough proof of concept and validation, Aaron and Lior started developing a sample of what they thought to be the perfect weighted blanket. And the wild thing is that they were doing all of this while they were working their current full time job.",
      "start": 111860,
      "end": 124930
    },
    {
      "speaker": "A",
      "text": "Like I was opening my juice shop at 6am till like 2, 3 o' clock and then I'd probably work out or eat dinner. Lior was running a software company the same time frame. We'd meet up every day at like 7 o' clock at his apartment. And then we'd work till like 1.",
      "start": 125400,
      "end": 138160
    },
    {
      "speaker": "B",
      "text": "2Am after grinding it out for months, the plan started to fall in place. Aaron and Lior found a new audience to market these weighted blankets to and started running ads on Google.",
      "start": 138240,
      "end": 148680
    },
    {
      "speaker": "A",
      "text": "So we literally, with basic images in one sample, put up a pre order site and then we bought ads for the most expensive keyword, which was weighted blankets. First sale came in, we made I think like 20 bucks. Next day we made three sales. I remember Leo and I took those three sales extrapolated over the year and we're like, oh my God, we're going to buy Ferraris. Like we're rich. Like this is it. We were doing 30k a month, 60k a month, 90k a month.",
      "start": 149160,
      "end": 173620
    },
    {
      "speaker": "B",
      "text": "With a little bit of beginner's luck, they were really successful out of the gate.",
      "start": 173780,
      "end": 177300
    },
    {
      "speaker": "A",
      "text": "We launched in January. We went from 1, 3, 5 sales, 20 sales a day.",
      "start": 177300,
      "end": 181220
    },
    {
      "speaker": "B",
      "text": "But they were not ready for what was about to happen.",
      "start": 181380,
      "end": 184020
    },
    {
      "speaker": "A",
      "text": "And our first July in Toronto, it's 30 degrees outside, which is the hottest month of the year. We went from all those sales to literally zero sales most days. And some days, one our best day of the month, we maybe had two sales.",
      "start": 184260,
      "end": 196480
    },
    {
      "speaker": "B",
      "text": "Aaron and Lior had made a huge mistake. They didn't forecast their inventory for the summer months and this was threatening their entire business. They were running out of cash and sitting on hundreds of unsellable inventory. Lior even came to Aaron to shut the business down.",
      "start": 196560,
      "end": 212000
    },
    {
      "speaker": "A",
      "text": "You know, our first summer we went to zero. My co founder Lior called me, he's like, hey, we got to shut this business down because I'm not interested in a seasonal business. We have a seasonal product. We're stuck with all this inventory. Let's get rid of it as fast as possible. And you know, you've got juice shops, you have a software business. Let's move on. In those moments, it was like looking yourself in the mirror and being like, am I actually the real deal? Do I wait? Do I actually know what the hell I'm doing? Like, do people actually like my shit? Like, was this all an accident?",
      "start": 212000,
      "end": 239340
    },
    {
      "speaker": "B",
      "text": "The fast success started to collapse for Aaron and Lior and the dark thoughts came pouring in as their bank accounts came closer to zero.",
      "start": 239420,
      "end": 247740
    },
    {
      "speaker": "A",
      "text": "So because we were broke, it was one of the most challenging years of our lives. And there was doubt and there was uncertainty. I mean, we bootstrapped this thing from day one and we needed to be profitable. We didn't have any money to put in. We couldn't afford to lose. It was a moment of like, are you Guys actually gonna do this or not?",
      "start": 247980,
      "end": 266760
    },
    {
      "speaker": "B",
      "text": "Even though things were tough, the boys were determined to figure it out. But with money running out, they had to do something quickly. And this is when Aaron had a brilliant idea.",
      "start": 267000,
      "end": 276600
    },
    {
      "speaker": "A",
      "text": "Needed to prove that there was something here, that someone wanted to buy this product. And once they got the product, that they were happy with it. We weren't just good marketers with shitty product. They got to the point where I was like, hey, why don't we just call everyone? Because clearly they were buying it. They're not buying it now. Why are they not buying? We'll just ask.",
      "start": 276760,
      "end": 295130
    },
    {
      "speaker": "B",
      "text": "And that's exactly what they do. In August of 2018, they send out an email to all of their customers with a calendly link. Their goal, to talk to every single one of their customers and ask them why they stopped buying the blankets.",
      "start": 295290,
      "end": 308410
    },
    {
      "speaker": "A",
      "text": "Every single person said the exact same thing. Aaron, we love the blankets.",
      "start": 308490,
      "end": 311760
    },
    {
      "speaker": "B",
      "text": "It.",
      "start": 311990,
      "end": 312230
    },
    {
      "speaker": "A",
      "text": "It's so amazing. It's incredible. But I'm sweating in places I've never sweat before. It's disgusting. So I'm putting it in my closet and in the winter, I'll pull it back out.",
      "start": 312310,
      "end": 322550
    },
    {
      "speaker": "B",
      "text": "And this is when Aaron and Lior have the biggest breakthrough in their journey. Instead of launching a product and hoping for the best, they realize the secret to building a business is talking to customers.",
      "start": 322550,
      "end": 333350
    },
    {
      "speaker": "A",
      "text": "And it was like a light bulb moment where we're like, wait a second, why don't we just make a cooling weighted blanket? Because if it was cooling, you would use it all year round. Of course we would. Of course we would. So we, we spent all of September flying around talking to suppliers and sourcing the coolest fabric ever. We ended up having to create our own fabric, which is called the iced fabric, which is the coolest fabric in the world. It literally keeps you cold without any water or fans going through your bed. But it was so expensive. It was $100,000 to get the first roll of that fabric, and we couldn't afford it.",
      "start": 333510,
      "end": 366370
    },
    {
      "speaker": "B",
      "text": "Aaron and Lior are faced with their biggest challenge yet. They need a boatload of cash to make more blankets, but they're down to their last $4,000 because they wanted to stay bootstrapped and keep 100% of the business. Investors were off the table, so they decide to throw a hail Mary and try raising a few thousand bucks on Kickstarter. They set a very low goal of $25,000 in hopes it will be enough to keep the business alive and make their next order. When the Kickstarter goes live, something amazing happens. The boys raise over $1 million in the first 30 days.",
      "start": 366530,
      "end": 401020
    },
    {
      "speaker": "A",
      "text": "So in 2019, we launched the 1.0. The Hush Ice. The world's coolest weighted blanket was a top 10 Canadian Kickstarter of all time. And when people ask us, what was the hack? How did you reverse engineer Kickstarter? What was it, a specific agency or a video style? And it's like, no. I mean, I had 3,000 people that literally told me on the phone that they would buy it if I made it.",
      "start": 401260,
      "end": 424430
    },
    {
      "speaker": "B",
      "text": "Aaron and Lior realize they need to take the momentum from their Kickstarter and push it into something even bigger. They sit down and ask themselves this. How can we get these weighted blankets in front of a massive audience? They come up with a plan. They're gonna weasel their way into one of the biggest shows on television that year.",
      "start": 424430,
      "end": 441470
    },
    {
      "speaker": "A",
      "text": "We then went on Canadian hit TV show Dragon's Den. And we went on the show, told our story, and had in 14 seasons. So 14 years in the show, there's never been a pitch that came on. And increased their valuation on live TV through debate amongst the Dragons. And we were the first. We broke the Internet. We went viral on Netflix for doing that. For the first time ever. It catapulted the brand.",
      "start": 441950,
      "end": 465550
    },
    {
      "speaker": "B",
      "text": "As 2020 comes around, the boys continue to double down on their success, reinvesting every dollar they earn. They pick up the phone again and continue talking to customers. And this gives them a new idea to create a new product. A pillow. They call thousands of customers and get feedback on what would make the perfect pillow. Then they launch it on their email list and sell 3000 pillows in 72 hours.",
      "start": 465870,
      "end": 490550
    },
    {
      "speaker": "A",
      "text": "And I remember I posted about it on LinkedIn. I'm like, okay, we just sold 3000 pillows in 72 hours. And everyone's initial reaction is like, what was the marketing? What was the email? What was the hype? What was the flow? And it's like, well, no, actually retired last year. We were talking to our customers, literally asking them, what pillow you want? Let me build it for you.",
      "start": 490870,
      "end": 507730
    },
    {
      "speaker": "B",
      "text": "They realize they have a formula. Talk to customers, understand their problems, and then create more products to sell them. So they do the same thing and launch the hush ice blanket 2.0 and then do the same thing again and launch the Hush Ice Bedsheets. That year, they do 20 million in sales.",
      "start": 507730,
      "end": 523970
    },
    {
      "speaker": "A",
      "text": "We over doubled the business again heading into 21, where we just said, it's time to shine. We had big goals. We wanted to do 40 million bucks. We really wanted to sell the business.",
      "start": 524210,
      "end": 534930
    },
    {
      "speaker": "B",
      "text": "At that time with big plans to sell the business. Aaron and lior need to find a final product to create that will increase their valuation. So they decide to do something that nobody expects in an industry where it's nearly impossible to make a profit.",
      "start": 534930,
      "end": 549370
    },
    {
      "speaker": "A",
      "text": "We had the stupidest idea in the world, which was to launch a mattress in a box. No one makes money selling mattresses in a box. But for whatever reason, we thought we could. And we spent three months calling customers because we were so nervous. So expensive, the inventory was so expensive.",
      "start": 549690,
      "end": 564770
    },
    {
      "speaker": "B",
      "text": "So for the next few months, they of course spend all of their time calling up their customers and asking them what would make the perfect mattress. And to their surprise, the biggest pain point was that their current mattresses were super uncomfortable when it came to making love.",
      "start": 565090,
      "end": 580930
    },
    {
      "speaker": "A",
      "text": "So we went out, we create a specific zone technology that has specific springs and specific areas that keep you flat no matter how you're positioned or how you're leaning up against something. We did a million and a half dollars on launch, which nobody believed that we can do.",
      "start": 581330,
      "end": 595890
    },
    {
      "speaker": "B",
      "text": "Then In October of 2021, the biggest sleep company in Canada gives them a call. They want to acquire Hush Blankets.",
      "start": 596050,
      "end": 604050
    },
    {
      "speaker": "A",
      "text": "We sold the business to the largest sleep company in the country. We went from 0 to 48 million in 48 months. And it's been a really fun ride.",
      "start": 604290,
      "end": 611930
    },
    {
      "speaker": "B",
      "text": "Along their journey, Aaron and Lior learned hundreds of lessons. But there's one lesson that stands out and it's something they didn't realize until they sat down and really looked back. All of these phone calls and customer conversations created a community of super fans, customers that would buy from them forever. And it's actually what makes Hush stand out from the thousands of other companies selling the same products.",
      "start": 612010,
      "end": 634810
    },
    {
      "speaker": "A",
      "text": "We opened our first pop up store, the highest grossing mall in the country, fourth in all of North America. And alo also decided to come to Canada and open the same time as us. And they had 700 people come through their door on opening day. We had 1500. And who came?",
      "start": 635290,
      "end": 649900
    },
    {
      "speaker": "B",
      "text": "Our people.",
      "start": 650060,
      "end": 650620
    },
    {
      "speaker": "A",
      "text": "There's a blanket behind you. Someone had us sign their blanket and they gave it back to us as a souvenir. One of the executives from the company that purchased us was there, watched it happen in real time and came up to me after and he's like, I've never in my 25 years in this industry would think that someone would ask a guy that sells blankets to sign the blanket. In that moment I was like, that's why we storytelled.",
      "start": 650780,
      "end": 674990
    },
    {
      "speaker": "B",
      "text": "Today, customers care more about the people behind a brand than they do about the product itself. Aaron and Lior documented their journey and Got customers involved from the start. They weren't just selling blankets and pillows. They were bringing their customers along for the ride. Being vulnerable and sharing all the ups and the downs.",
      "start": 674990,
      "end": 692380
    },
    {
      "speaker": "A",
      "text": "I think storytelling is the most important thing you can have when you're marketing a brand. And storytelling is the emotions and it's the magic that people want to feel before they go out and purchase something. Like if you think about Abercrombie walking into a mall, there's two shirtless teenagers with six pack abs and cologne that's like oozing out and we're all like, yeah, that's us, you know, and like now that story doesn't resonate, but that's who we wanted to be. We wanted to be the guys with the cool hair, the six pack ads that the girl loves and that we smell good. We walked into the store, we bought those jeans and we put them on and we felt like those guys, that essence, that emotion, that magic is everything when building a brand. People can have that feeling with small brands and small businesses. And I don't know why founders are not leaning into that. Perhaps they think it's beneath them. But that's how you build community.",
      "start": 692850,
      "end": 747060
    },
    {
      "speaker": "B",
      "text": "From $4,000 in the bank to $48 million. Aaron and Liora have proved that thanks to the Internet, anyone can build something huge. As long as you're willing to pick up the phone and tell your story, anything is possible.",
      "start": 747380,
      "end": 760420
    },
    {
      "speaker": "A",
      "text": "What the Internet afforded us was guys like me are able to go and compete with the big guys because the Internet, previously you needed to go and knock doors of these retailers and beg for them to take your product. They'd put you in a shitty corner. No one would try and you'd have no sales. You have returns. And the barrier to entry was so big. But now there's a story for the underdog. There's a story for the guy shooting on their cell phone that gets to be that way. I think that's.",
      "start": 760740,
      "end": 787590
    }
  ]
}