{
  "source": "/home/salouri/Projects/starter_story/transcripts/G4nsGvL4Fo0/G4nsGvL4Fo0_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "I personally used to think that I could never ship a profitable product because I was not amazing at coding. Reaching this point where I'm earning 15k on my products, it feels unreal.",
      "start": 160,
      "end": 10320
    },
    {
      "speaker": "B",
      "text": "How did this guy build two SaaS products to $15,000 MRR as an average coder? Well, it's because of his approach on how to find winning ideas.",
      "start": 10400,
      "end": 20320
    },
    {
      "speaker": "A",
      "text": "Niche down as much as possible. I only need 0.1% of the market and I'm good.",
      "start": 20560,
      "end": 26000
    },
    {
      "speaker": "B",
      "text": "Fernando started his journey as an agency owner working with clients for over a dec. But then his entrepreneurial dreams came to a halt when he had to go back to his 9 to 5 job.",
      "start": 26160,
      "end": 37180
    },
    {
      "speaker": "A",
      "text": "While working my 9 to 5, I was always daydreaming about what to do. Deep down, I knew I wanted to find a way to go back to this sense of autonomy that I had.",
      "start": 37340,
      "end": 45500
    },
    {
      "speaker": "B",
      "text": "At one point, after unexpectedly getting fired, he decided he had enough and went all in on his dream.",
      "start": 45500,
      "end": 52220
    },
    {
      "speaker": "A",
      "text": "Now the stakes were real. I always relied on my nine to five. But not anymore. I needed to show up and build something.",
      "start": 52380,
      "end": 58780
    },
    {
      "speaker": "B",
      "text": "A year after he took the leap, Fernando became a solopreneur, making a good living while working only four hours a day. So I gave him a call to ask him how he did it and how you guys watching could do something similar. And he shares everything, including his process for finding profitable ideas, his strategy for building and validating those ideas quickly, and the distribution channel that gets him most of his paying customers when it comes.",
      "start": 59020,
      "end": 85650
    },
    {
      "speaker": "A",
      "text": "To distribution for both Resumemaker Online and AI carousels with the main channel.",
      "start": 85650,
      "end": 90810
    },
    {
      "speaker": "B",
      "text": "All right, let's dive in. I'm Pat Walls and this is Starter Story. Welcome, man. Thanks for coming on Starter Story. Tell us about who you are and what business you built so well.",
      "start": 91050,
      "end": 104650
    },
    {
      "speaker": "A",
      "text": "I am Fernando, a product designer, originally from Argentina, now living in Sweden and working in two SaaS projects full time. Resumemaker Online and AI Carousels. When it comes to Resumemaker Online, I like to define it as the easiest way to build your resume. And then there's aicarousells.com which I launched last year, and it's the first AI carousel generator, and it allows users to create stunning social media carousels even if you don't know anything about design. Both products run on the freemium model, so you can start right away for free, but subscriptions unlock all the AI and Pro features. Together they bring in about 15K MRR, which allow me to finally step away from the 9 to 5. And this hope stays that way.",
      "start": 104650,
      "end": 144380
    },
    {
      "speaker": "B",
      "text": "Okay, since you've built not one, but two successful projects, can you tell us A little bit more about your process for how to find winning ideas.",
      "start": 144540,
      "end": 152350
    },
    {
      "speaker": "A",
      "text": "I always find it easier to scratch my, my own itch when I see something that I know that it can be time consuming. I thought could be, could be a great idea. Why not creating something that simplifies this, something that solves this problem specifically instead of having multiple features like Canva on Battle. Most users are not pro users. They just want the simplest way to achieve something. That's the advantage of being a solo entrepreneur. Canva cannot afford to go for very, very specific solutions because they need to target a wider audience. So I think that's where sole entrepreneurs can thrive. Niche down as much as possible, find the portion of a huge market that they can serve better than these big companies with AI care results. It's only me. I don't have a co founder, I don't have employees. I only need 0.1% of the market and I'm good. I think there's very fertile ground for indie hackers or entrepreneurs to create solutions that are laser focused and solve one specific issue.",
      "start": 152510,
      "end": 208630
    },
    {
      "speaker": "B",
      "text": "All right, so your approach is to take these big markets and niche it down and build one simple solution for users. But how do you look at validating these ideas and how do you know that it's something worth building?",
      "start": 209030,
      "end": 220710
    },
    {
      "speaker": "A",
      "text": "I go after markets that are already validated, but I try to be just a little bit different. Take a new approach with the resume maker online, all these resume builders were really bloated you needed to sign up for before even seeing how the resume is going to look like. I took a completely different approach. You just press one button, you're right there, you can see how good it's looking already. And I think people really resonated with that. That's my philosophy. I think that's going to be my philosophy going forward. Let's take a validated market niche down and find a way to save people time. I always say that I don't sell design, I sell time. That's, that's the value that I provide. I help you to get you to a good enough point, and that's more than enough.",
      "start": 221510,
      "end": 263680
    },
    {
      "speaker": "B",
      "text": "Sometimes validating your idea is one of the most important steps when it comes to starting something new. And Fernando is proof of that. Profitable side projects are built on the right idea, the right market and the right launch strategies. But that process to go from zero to one can be long and it might make you feel lost if you aren't following a solid blueprint. That's why I created the Academy and it's a five Week program where you'll find an idea, build it, launch it, validate it, all while only working two hours a day. It's the same framework I use to build a million dollar business and it's what I've seen thousands of other successful founders use. It's what actually works because it's all about taking action and actually building stuff and putting it out into the world, which is what I really want to see you take a shot at. So if you're curious about building a side project like Fernando and you want to surround yourself with other builders, then, then head to the first link in the description to see if the academy might be a good fit for you. Now let's get back to Fernando's story and the amazing business he built. Okay, now let's talk about actually building the product. I know you did a 10 day challenge to go from zero to one with AI carousels. Can you tell us a little bit more about that approach?",
      "start": 263840,
      "end": 332040
    },
    {
      "speaker": "A",
      "text": "While working at my nine to five, I was always daydreaming about what to do after a year and a half working there. It's just a few weeks after very positive perform a review, they tell me that I'm fired. That was just one day before my planned vacations and honestly I was quite burnout from the nine to five. That left such a sour taste in my mouth. So I was not very optimistic and I didn't really want to find another job. I think maybe this was the push that I needed. Now the stakes were real. I always rely on my 9 to 5, but not anymore. I needed to show up and build something. So I thought, okay, let's go for a building public challenge. The first days I just tried to get the main features running. Also as a designer and given that this is a design product, it had to look somewhat nice. But it was really, really simple. The most basic text carousels that you could create. It's a good thing also to launch these barebones products because then when you start getting feedback, the feedback kind of tells you where to go. The biggest value that I get from this challenge is that if it would have failed, I could have moved on into the next thing without any issues. But if you work for during six months, one year on the product, it's easy to get attached. It can be harsh to hear like the product sucks, right? If I launch in the future, I would like to try to replicate this sense of urgency.",
      "start": 332360,
      "end": 412740
    },
    {
      "speaker": "B",
      "text": "Wow, that's an awesome story. Thank you for sharing that. So after you built the mvp, I see that you then launched On Product Hunt, can you tell me more about that launch?",
      "start": 413220,
      "end": 421780
    },
    {
      "speaker": "A",
      "text": "Yeah. Despite my concerns, the launch went really well for results. And five users sign up and people can say that they like your product and you might have intuition that there's a demand for it, but the ultimate validation is when you get paid for it. Right. And the product was super buggy. For me, that was like the ultimate proof. If they pay for this buggy product, there's really an opportunity here. I need to double down.",
      "start": 422260,
      "end": 446150
    },
    {
      "speaker": "B",
      "text": "So after you get those first five customers, how did you continue to get more of them? What kind of distribution methods did you.",
      "start": 446390,
      "end": 453180
    },
    {
      "speaker": "A",
      "text": "Use when it comes to distribution for both Resumemaker Online and AI Carousel, Product Hunt helped a lot to spread the word about it, especially with Resumemaker Online winning first product of the week. It got spread so quickly and I got so many backlinks. But then SEO is the main channel and I'm definitely better at building that at marketing. So I started building a lot of free tools for both products. I think it's about 30. It just have to be something complementary to your main product, like a natural extension. It's a good way to bring in traffic, especially if you, if you're not a SEO expert and the building public also helps to spread the word on Twitter, on LinkedIn. I think people like, especially when you try to make it personal, can be a bit cringe sometimes, but that's LinkedIn. Also launch an affiliate program for both products which is working okay. It's in progress.",
      "start": 453180,
      "end": 501050
    },
    {
      "speaker": "B",
      "text": "Yeah. So after you started to get more paying customers, was there a specific pricing strategy you used to monetize the product to its potential pricing?",
      "start": 501050,
      "end": 509610
    },
    {
      "speaker": "A",
      "text": "It was a bit tricky at the beginning. I mean I knew it wasn't beta, so I launched it at $999. Now I, after adding so many features and the product has matured so much, it's 1495 and I want to be seen as an affordable tool, not a cheap one. Right. And when it comes to Resume Maker Online, I started with a one time purchase model which made total sense for the type of product. But after I relaunched it as a SaaS early this year, even though the churn is is high, the revenue is much more predictable. It's really nice because yeah, with one time purchases you go back to zero. That's a bit scary each time.",
      "start": 509610,
      "end": 545350
    },
    {
      "speaker": "B",
      "text": "Yeah, got it. Okay, I want to double click into the topic of churn. Do you have a strategy you use to reduce churn for AI carousels?",
      "start": 545350,
      "end": 553750
    },
    {
      "speaker": "A",
      "text": "Yeah, that my strategy was to start with carousels but expand and offer Other tools. So people might come for the carousels and they stay for a whole package. It's way easy to communicate the proposition value when you can focus on only one package. The core message, which in this case is carousels. It's easier for me to stand out among all the competitors by presenting myself as the best AI carousel generator. But when people come, they find out that there's a lot of other tools that they can use to maximize their online presence. That's really helping to make the product better so people don't cancel, but also to bring expired users back.",
      "start": 554070,
      "end": 589250
    },
    {
      "speaker": "B",
      "text": "I want to go into the topic of customer support. I know it can be tricky as a solopreneur. So how do you go about it?",
      "start": 589490,
      "end": 595410
    },
    {
      "speaker": "A",
      "text": "Yeah, when it comes to customer support, I think it's key. I mean, I think that's another like product feature. It's part of the experience and I try to just reply as fast as possible because it's not only about helping users. For me, especially when I launch, getting this initial feedback was a bit like a cheat code. Not only helped to shape the direction of the product, but also turn all these frustrated customers into loyal fans. Because you write about a bug or a feature request and maybe in like, I don't know, like an hour, the bug is fixed and the feature is up. And I always try to embrace being small. Even I have in both personal maker and the ICA results, I have an about page that I'm saying, hey, it's only me here. You're not talking directly with the founder. And on the emails it's always I. It's never we. It's Fernando, the sole founder. And I really try to embrace that instead of trying pretending to be like, like a big company. And I feel like that's really working. People don't want to deal with it. Faceless big company. I think as SOL entrepreneurs we should leverage on that.",
      "start": 596170,
      "end": 653580
    },
    {
      "speaker": "B",
      "text": "Okay, now let's get technical. Which tools and software do you use to make $15,000 a month as a solopreneur?",
      "start": 653980,
      "end": 661340
    },
    {
      "speaker": "A",
      "text": "Yeah, when it comes to tools, I keep things very lean. I just use Notion to organize both products. I use Outta. It's a no code tool that is perfect for SaaS founders. For me, no, no code is ideal for speeding up all the basic things like billings, CRM subscriptions, all the repetitive stuff that you don't need to reinvent it. Let me say just focus on improving the actual product. Yeah, that's basically it.",
      "start": 661820,
      "end": 684080
    },
    {
      "speaker": "B",
      "text": "Wow, that is lean. And how much does it actually cost to run your businesses?",
      "start": 684640,
      "end": 689440
    },
    {
      "speaker": "A",
      "text": "The costs are around like 1000 per month. So the profit margins are above 90 90%. And I don't have any employees or co founders. It's only me. Although this year I did bring a freelancer to help me some more time consuming content tasks. So yeah, I just bring him in when, whenever I need to do some type of stuff like that.",
      "start": 689840,
      "end": 710850
    },
    {
      "speaker": "B",
      "text": "Geez, 90% margin is impressive. Wow. Let's talk about competition. I'm sure since you're building invalidated markets that you face a lot of it. How do you deal with competitors?",
      "start": 711250,
      "end": 722690
    },
    {
      "speaker": "A",
      "text": "I'm glad competition exists. I mean it's a good sign. You don't, you don't want to be the only one. And also it can be easy I think to get caught up on trying to one up each other all the computers with the new cool feature when often users care about something entirely different. So that's why I keep my focus on the user feedback.",
      "start": 723170,
      "end": 740050
    },
    {
      "speaker": "B",
      "text": "All right, now let's get a little bit more personal. What does your actual day to day look like right now?",
      "start": 740290,
      "end": 745330
    },
    {
      "speaker": "A",
      "text": "After so many hectic years of managing my office job with my personal projects, I moved to different countries. I switched jobs, launched products. Early this year I decided to take things a bit slower just to enjoy the summer. So I decided to work only four hours a day. And it was quite difficult at first. I keep thinking about the opportunity cost, right? Watching the movie, thinking, but I could be working, I could be shipping features. But it turned out to be just the best decision for the business. Things start going even better by working less time. So I decided to stick with these four hours of deep work each morning. Having this constraint kind of forces you to be intentional about your to do list. You focus on what's important. One thing I do is though is I make sure to work even on weekends. I feel that really keeps the momentum going. It feels great just to skip the daily stand ups. On my past nine to five, I woke up without any alarm. My calendar is empty. I only had your call. When I get invites from friends, I'm always available. I'm in a better mood, I'm happier overall. I'm more patient with my girlfriend. And this gives me also the mental clarity to focus on and what's important on the business. Right. I think that's why the business doing better because I am feeling better. For me that's, that's, that's more important to optimize for, for lifestyle, not for revenue.",
      "start": 745490,
      "end": 827540
    },
    {
      "speaker": "B",
      "text": "Okay, Fernando, the last question that we always ask all the founders that we interview, if you could give a piece of advice to all solopreneurs just starting out right now, what would you say?",
      "start": 827700,
      "end": 837300
    },
    {
      "speaker": "A",
      "text": "Yeah, sure. I personally used to think that I could never ship a profitable product because I was not amazing at coding. I have all these self limiting beliefs and I was wrong most of the times. Especially in B2C products, users don't need like a super complex solution. There's just one simpler one. So if you can provide a way to make something faster, simpler, that is value and most likely people are gonna pay for it. There's absolutely nothing bad of focusing on building a tiny little tool that saves people time. You get paid and it free up time for you to do whatever you care in life. I mean, I'll be honest, I personally couldn't care less about social media carousels. Like I like helping people with all the design challenges. But what I care is creating something that allows me to free up my time, happier life, spend time with my family, with my girlfriend, spend a bit less time on the front of the screen. Being able to do that, having that freedom, that's so cool, man. That's for me, it's something that's not in the chart, but this is, this is what I'm doing. It. This allows me to improve my lifestyle and that's what I'm here for.",
      "start": 837460,
      "end": 902370
    },
    {
      "speaker": "B",
      "text": "Yeah. All right, man. Thank you for coming on. I love the business that you built. Thank you for sharing everything with our audience. Have a good one. Hey guys, thanks for watching and if you made it this far, I want to share something with you. As you've seen with a ton of these interviews we've done on YouTube, anybody can change their life with an idea. The ability to code in a couple of hours of work per day. In these videos we talk about tons of cool strategies and tactics, but the thing that's really going to get you your dream outcome is taking action. And if you feel like you're struggling at all with that, no matter what you do, then I highly recommend checking out the Academy. It's the community and accountability that I wish that I had when I first started. And it's got a ton of resources to help you find an idea, help you ship that product and help you get those first users. Just head to the first link in the description if you want to check it out. Much love and I'll see you guys in the next one. Peace.",
      "start": 902370,
      "end": 956630
    }
  ]
}