{
  "source": "/home/salouri/Projects/starter_story/transcripts/ptT0tfzeu8I/ptT0tfzeu8I_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "This thing made me a millionaire. No, not the dollar bill. I'm talking about this, the eyeball. Or as I like to call it, attention. Nowadays, with the click of a few buttons, you can capture millions of eyeballs in minutes. And with a few more clicks, you can turn those eyeballs into money. But there's a catch. You need to know what buttons to click. I tried for days, months, years to crack the code. Failure after failure. Then I finally did. One day I was a nobody. And the next day, thousands of followers, customers, users, and of course, dollars. This is the story of how I hacked Reddit to build a million dollar business.",
      "start": 160,
      "end": 46060
    },
    {
      "speaker": "B",
      "text": "The story starts a few years back in New York City. Nine to five, six figure salary, parties, profit, but numb on the inside. I want, no, I need something more. In that moment, I vowed to myself to become an entrepreneur. Someone who would never have to work a 9 to 5 ever again. And that's when I came to the idea to start a business. The idea was called starter Story. In my head, I really believe that this is the idea that will set me free. So I spend months working on it. I want it to be perfect. The perfect landing page, the perfect design, the perfect font, the perfect launch nights, weekends, meticulously making everything perfect. I could see the end result in my head. Thousands of users, thousands of dollars. A new life. Finally it was ready. I put it out in the world. I press, publish. Then I sit there refreshing my analytics. I'm waiting for the success to start happening. And sure enough, nothing. Zilch, nada, zero users. I keep refreshing, just waiting for the word of mouth, the sharing, the millions of users to show up. But they never do. And this, this is when I realized everything I was told about startups and business was a lie. Nobody gives a about me or the thing that I launched. Then I thought, how do I make them give a fuck? That night I got to work. I start studying other successful businesses to see how they got traction. After a couple hours, it all clicks. The smartest companies in the world started by leveraging thing and one thing only, attention. And they did it using free channels. YouTube, Instagram, TikTok, Reddit. They went to their customers, created content for them and in return attracted millions of eyeballs. And then they turned those eyeballs into users, AKA dollars. So I asked myself, where do my customers hang out?",
      "start": 53260,
      "end": 183900
    },
    {
      "speaker": "A",
      "text": "Then I look at my screen, that's it, Reddit.",
      "start": 184300,
      "end": 188500
    },
    {
      "speaker": "B",
      "text": "I post a link to my website, it starts getting a few upvotes, I start getting traffic. 10 users, 20 users, 100 users. Holy sh. I'M jumping around the room.",
      "start": 190420,
      "end": 201780
    },
    {
      "speaker": "A",
      "text": "I could see my future. Quitting my job, traveling the world, a new life.",
      "start": 201939,
      "end": 207380
    },
    {
      "speaker": "B",
      "text": "And then boom. Oh no. Your post has been removed. Sincerely, the mods. Oh, what the f. Sorry, dude. Your post breaks the rules of this subreddit.",
      "start": 207780,
      "end": 223700
    },
    {
      "speaker": "A",
      "text": "How stupid. Deleted.",
      "start": 223700,
      "end": 225700
    },
    {
      "speaker": "B",
      "text": "Gone. All my hopes and dreams ruined by some mod on a power trip. But I'm not giving up that easy. From that moment, I had a new goal. Find a way to break the rules. Rule number one, no link posts. Only self posts allowed. And then it hits me. Redditors hate the idea of you spamming your website. So what if I made it feel like this wasn't spam at all? I won't post a direct link to my site. I'll just take all of the content and put it in its own post. I'll keep it on platform and then at the end of my post, I'll put a small link to my product. If they want more stuff like this. I spend the next few hours putting it all together, doing it meticulously, making it perfect so no moderator can say a thing. And then finally, I press publish. I sit there and I watch it for a few minutes. It didn't work.",
      "start": 225780,
      "end": 285320
    },
    {
      "speaker": "A",
      "text": "F this.",
      "start": 286440,
      "end": 287240
    },
    {
      "speaker": "B",
      "text": "I'm going to bed.",
      "start": 287480,
      "end": 288520
    },
    {
      "speaker": "A",
      "text": "Holy sh.",
      "start": 302440,
      "end": 303160
    },
    {
      "speaker": "B",
      "text": "It worked. Hundreds of upvotes. Dozens of comments. Thousands of people reading my content. I open up analytics. Thousands of people are visiting my website right now. I've never felt anything like this before. The engagement was like crack to me. This is product market fit. Before, nobody gave a shit about my website, and now people are begging me for more. I hacked the system, one simple piece of content. And now I have thousands of eyeballs on my product. But there was still a problem. I need to turn these eyeballs into dollars. I knew one thing for certain. This hack was like a ticking time bomb. The mods were going to catch on to me. Others would come and copy my strategy. I knew this wouldn't last forever. I needed to act and I needed to act fast. It was time to go all in. Initiate step one of the plan. More attention. I posted again and again and again. And to my amazement, it kept working. My stuff kept hitting the front page. Hundreds of thousands were visiting my website and millions were reading my content. But attention was only one part of the formula. Initiate step two of the plan. Converting attention into money. How would I do it? Email. I knew I needed to convert this attention into my own email list. An email list would allow me to own my audience. I could sell them whatever I wanted, whenever I wanted, without Reddit So I optimized a signup box on my site to collect emails from the millions of visitors. Then the email signups started flooding in. 100 email subscribers, 200 email subscribers. 500 email subscribers. But time was running out. Then one day, it happened. Petition to banstarterstory.com posts this was the end. Well, as they say, all good things must come to an end.",
      "start": 304200,
      "end": 449160
    },
    {
      "speaker": "A",
      "text": "The Redditors formed a mob against me. I was donezo. But actually, I was fine. By that point, I'd built an email list to tens of thousands of subscribers. The formula worked. I captured that attention onto my email list. I had my own users and my own product and my own business now. And I just quit my job to go all in on it. And as I look back, I just remember how crazy that whole thing was. To launch something and completely flop and then one morning wake up to millions of people using my product.",
      "start": 450850,
      "end": 483890
    },
    {
      "speaker": "B",
      "text": "Over the years, I've talked to thousands of successful founders.",
      "start": 484610,
      "end": 487810
    },
    {
      "speaker": "A",
      "text": "They all have stories like this. They built something, nobody gave a f and then they had to figure out how to get in front of their customers.",
      "start": 488130,
      "end": 496530
    },
    {
      "speaker": "B",
      "text": "That's the secret sauce that nobody talks about.",
      "start": 497090,
      "end": 499810
    },
    {
      "speaker": "A",
      "text": "If I didn't focus on that, then I wouldn't be here today. I'd still be building things and hoping that people would magically show up.",
      "start": 500130,
      "end": 507290
    },
    {
      "speaker": "B",
      "text": "There are thousands of opportunities like this.",
      "start": 507690,
      "end": 510090
    },
    {
      "speaker": "A",
      "text": "Hacks and cracks in the algorithm that you can build a million dollar business on top of. All you need to do is find them. Which is why I'm hosting a live workshop where I'll teach you my framework for hacking attention in 2024, just like I did on Reddit, and how you can find a million dollar business idea in the process. If you're curious, the link is in the description. I hope I got your attention. See you in the next one.",
      "start": 510250,
      "end": 537650
    }
  ]
}