{
  "source": "/home/salouri/Projects/starter_story/transcripts/OoFqTMPW_3E/OoFqTMPW_3E_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "This Guy built a $10 million business thanks to one simple skill, writing. What's even crazier is that he started this business while he had a 9 to 5 job and didn't quit that job until he was making a million dollars a year. He invited us into a studio in Miami, Florida to tell us exactly how he made his first dollar and his exact routine to build a million dollar business while he had a full time job.",
      "start": 320,
      "end": 23760
    },
    {
      "speaker": "B",
      "text": "Wake up at 4.30am, write for two hours, get back to my desk at 7am, do my Blackrock work during the day, log off as and then built in the evenings.",
      "start": 24160,
      "end": 34220
    },
    {
      "speaker": "A",
      "text": "Before the success. Dickey was crushing it. By all accounts, New York City, Wall street, six figure job. But deep down, he was unhappy slaving away at a job that gave him no freedom. Then one day he wrote a tweet that changed his life forever.",
      "start": 34380,
      "end": 49820
    },
    {
      "speaker": "B",
      "text": "That was how I earned my first $5,000. I didn't have 20,000 100,000 Twitter followers at the time.",
      "start": 49980,
      "end": 55140
    },
    {
      "speaker": "A",
      "text": "In this video, Dicky shares his exact blueprints on how to master the $10 million skill of online writing, how to scale your writing business to $800,000 a month, and the best way to get to $10,000 a month as a beginner.",
      "start": 55140,
      "end": 68910
    },
    {
      "speaker": "B",
      "text": "The fastest way to monetize is actually.",
      "start": 69390,
      "end": 71310
    },
    {
      "speaker": "A",
      "text": "I'm Pat Walls and this is Starter Story.",
      "start": 71710,
      "end": 74830
    },
    {
      "speaker": "C",
      "text": "Thanks for having me, Pat.",
      "start": 76910,
      "end": 77830
    },
    {
      "speaker": "B",
      "text": "What's going on man? Welcome to the shipyard. Appreciate you being here.",
      "start": 77830,
      "end": 80270
    },
    {
      "speaker": "C",
      "text": "Tell me about who you are and what you built.",
      "start": 80510,
      "end": 82110
    },
    {
      "speaker": "B",
      "text": "I am Dickie Bush. Two years ago I was a Wall street hedge fund trader working 60 hour weeks under fluorescent lights trying to make 90k a year. That led me to start writing online. Now two or three years later, I am a free full time writer with a portfolio of writing based businesses. On pace to do $10 million in 2024.",
      "start": 82110,
      "end": 99110
    },
    {
      "speaker": "C",
      "text": "Break down all the businesses that you run.",
      "start": 99430,
      "end": 101430
    },
    {
      "speaker": "B",
      "text": "So it's a portfolio right now of four businesses. The first is ship 30 for 30, which is a community powered writing course that helps beginners who've never written anything start writing online. That one does about $3 million per year. The second is the Premium Ghostwriting Academy, which helps beginner freelance writers to position themselves as premium ghostwriters. That's a group evergreen group coaching model. That one does about $5 million a year. Then we have Write with AI, which is a paid newsletter for training AI writing tools to become your personal writing intern. That one's on pace to do 500k this year. And then the last one is Typeshare which is a SaaS business with everything you need to start writing online. Templates, analytics, hosting, all of that in one place. So all four of those, they're in the writing area. They all kind of build on one another. And three years ago I didn't know how any of this worked.",
      "start": 101510,
      "end": 148460
    },
    {
      "speaker": "C",
      "text": "Tell me a little bit about your backstory and how do you get into entrepreneurship?",
      "start": 148890,
      "end": 152250
    },
    {
      "speaker": "B",
      "text": "So my backstory you could trace back to when I was pretty young. I had a handful of obsessions. Luckily hit an athletic streak, which allowed me to play football in college at Princeton, studied math and computer science there. And then as a sophomore I got an internship at BlackRock. I was like, wow, this is the coolest thing ever. This is a dream job. I'm going to go work for a hedge fund. That led to taking that full time job. When I graduated, I was checking every single box. I got good grades, on Track to be 22 years old, making 180 grand in new York City. I'm like, I did everything right. Amazing. 18 months later, I was doing well at the job, but if I showed up at 5am and worked till 8pm, I might make 10% more money. But if I worked as little as possible, I would make the same amount. And that kind of messed with me because I couldn't apply the level of effort that I wanted to because my incentives weren't there. If I wanted to work harder, if I wanted to bring more intensity, nothing would happen. And that was a freak out moment where I said, time to go find something I could do that with.",
      "start": 152330,
      "end": 207970
    },
    {
      "speaker": "C",
      "text": "So you're working your dream job on Wall street, making good money. What was your turning point that got you into writing online?",
      "start": 207970,
      "end": 213970
    },
    {
      "speaker": "B",
      "text": "I witnessed someone I worked with ask for permission to go to their son's little league game. And he was probably 37, 38 years old, and his boss said no. So if I do everything right for 14 more years, I might be sitting here having to ask for permission to go to my kids Little league game. Uh oh, I gotta get out of here. I didn't quit right away, which I think is a big mistake. A lot of people do, because then I would have been operating from a place of scarcity the entire time. Instead I said, how can I look for ways to passively pursue new opportunities? I started a newsletter inside BlackRock as a way to get my name out there more. After three or four months of doing that, I said, why am I capping myself with people working in this company when I could use social media and the Internet, do the same thing and unlock millions of new eyeballs and that is what led me to starting my newsletter in January of 20, which was kind of my gateway into writing online.",
      "start": 214370,
      "end": 267510
    },
    {
      "speaker": "A",
      "text": "Dickie is the perfect example of someone who was able to turn a simple idea into a million dollar side project while still working a 9 to 5 job. But that's because he was working on the right idea and had a solid blueprint on what to execute on every day. And that's why I built Starter Story, a library where you can access over 4000 business ideas, breakdowns and blueprints that real entrepreneurs use to turn a simple idea into a million dollar online business. That way you can study and get inspired by what' working instead of trying to reinvent the wheel. So if you're serious about building a profitable side project and you're still working a 9 to 5 job, then head to the first link in the description and we're going to give you a free breakdown of 160 SoloPreneur business ideas to help you get started on your journey. Much love and hope you guys enjoy the rest of the video.",
      "start": 267590,
      "end": 315410
    },
    {
      "speaker": "C",
      "text": "All right, so tell me about the early days of writing online.",
      "start": 315810,
      "end": 318530
    },
    {
      "speaker": "B",
      "text": "Getting your start so I'm still working on Wall street, but realized okay, a lot of the work that I was doing on a daily basis was kind of made up. I went from working 12 hour days down three or four and spent the rest of a 10 hour workday learning, reading, immersing myself into different things and then writing in my newsletter. Hey, here's what I read this week, here's what I wrote, here's what I listened to, here's what I'm thinking about following everything that I thought was right. But I had something like 250 subscribers and so I committed to a 30 day personal writing challenge where I'm going to write and publish something every day for 30 days. And at the end of this challenge, if it doesn't work, I'm going to go have to find something else. Day 27 I hit publish. 0 likes, 0 comments, 0 retweets, went to bed, thought okay cool, this is almost over. Like what am I going to do? And at the time I was working on a different side project which was SaaS. That's the better business model. Whatever. Went to bed woke up. That post got retweeted by Naval Balaji, a handful of other kind of high profile people. It had four or five thousand likes. I dropped my newsletter at the bottom and went from 250 subscribers to 1,000. And the big takeaway that I made at the time was you never know what's gonna go viral. You never know what's gonna work. You just have to keep showing up and hitting publish. And that set the flywheel that's been spinning ever since.",
      "start": 318610,
      "end": 390420
    },
    {
      "speaker": "C",
      "text": "So now you got a little bit of popularity on Twitter. How do you actually turn this into something that makes money?",
      "start": 390900,
      "end": 395780
    },
    {
      "speaker": "B",
      "text": "The viral post was a breakdown of balogy. The result of that was people who wanted me to write a thread on them were now reaching out to me, saying, hey, I really like these worldview creation threads that you've been putting together. Would you be willing to do one for me? And I had someone reach out to me. He approached me, said, would you do this for me? I said, sure. He goes, okay, how much should I pay you? And here I am. I have no clue. I don't want to say something because I've been doing this for free. I don't want to say something that would get him to say no. So I'm like, look, I don't know what to say. I don't know what to charge. How about this? I'll go do this for you. You just let me know how valuable it is at the end of this. And you pay me that much. He's like, sure, great. Go for it. I was going to ask for $250, but again, I didn't ever say that. So I spent the weekend Saturday, Sunday, just immersing myself. Fifteen hours, all the way down the rabbit hole, and I put together a really great product form. Emails me back, like, two days later. He's like, dude, this is amazing. Thank you so much. I can't wait to use all this. Can't wait to tell my friends, like, hey, you could go do this for them. Putting you in touch with my assistant, who will help coordinate payment. So his assistant emails me and says, hey, where can I pay you? I spun up a PayPal, sent her the link, and then $5,000 hit my account the next day. I thought it was a typo, and so I sent him a message like, dude, that was so generous. Did you mean to send this much? And his response was like, dude, this was amazing. Is that enough for you? Like, there's plenty. Thanks so much. Like, anything else you need, I'm happy to help. And that was the very first time in many years I felt that I again had something where more effort, more intensity led to more results. And that completely broke my brain of, wow. The attention that I generated from writing led to a business opportunity that paid me five grand. We're clearly out of something here.",
      "start": 395940,
      "end": 491670
    },
    {
      "speaker": "C",
      "text": "So you make your first $5,000 with ghostwriting. What happens next?",
      "start": 492080,
      "end": 495120
    },
    {
      "speaker": "B",
      "text": "Over the next week or two had a couple more people reaching out where I was probably on pace to make ten grand a month. But to scale up a ghostwriting side hustle beyond 5 to 10k as a side hustle is very difficult. So I zoomed out and said, what was the input that led to this opportunity? Well, it was writing and publishing every day for 30 days on my own. So I tweeted out, hey, I just completed a 30 day writing challenge. It changed my life. Would anyone be willing to do this with me? Because I knew that was intense. I'm going to need some accountability if I want do it again. Again, I was terrified to charge money because it was like literally a Slack accountability channel. Like how much would someone be willing to pay? But there were so many responses that I couldn't just make it free. So it was $50 and you got your money back if you completed all 30 days. People loved it. The Slack channel was blowing up and I wanted to figure out if I was going to actually charge money for this. What do I need to deliver? So I held over 50 one on one interviews, ended up packaging everything that I learned from those interviews into a much better product and and charged $99 for it. And then that made 30 grand in December.",
      "start": 495440,
      "end": 555960
    },
    {
      "speaker": "C",
      "text": "You're starting to make a little bit of money online. You have this product that's working, but you're still working your full time job. Tell me about that experience.",
      "start": 556280,
      "end": 561880
    },
    {
      "speaker": "B",
      "text": "I've realized I have a scalable vehicle that I can dump a ton of effort into. I partnered with Nicholas Cole to come on and transition this from just a Slack accountability channel for $99 to a full immersive 30 day digital riding education. And so that was all of 2021. Wake up at 4:30am, write for two hours, be at my desk ready to log in for my 7:30am Blackrock call, do that during the day, log off as soon as I could and then build ship 30 in the evenings. By the end it ended up working. So 2021 ship 30 did a million like 90% margin. I had hit my goal of doubling my full time job income from my side hustle FaceTimed him, said, hey, this has been awesome but I really want to take my kind of life trajectory and in another direction. Thanks for everything and it ended up working out.",
      "start": 562680,
      "end": 608070
    },
    {
      "speaker": "C",
      "text": "Luckily you have this amazing story about how you built this business just from writing online. But tell me, why is the skill.",
      "start": 608070,
      "end": 614350
    },
    {
      "speaker": "B",
      "text": "Of writing important when you recognize that the foundation for every single Piece of content, every product, every video, every podcast is writing. It's the most applicable skill.",
      "start": 614350,
      "end": 624830
    },
    {
      "speaker": "A",
      "text": "Yeah.",
      "start": 624910,
      "end": 625350
    },
    {
      "speaker": "B",
      "text": "And so if you can learn that, plus learn to write in a persuasive way or in a compelling way, you basically write your income ticket for the rest of your life. Because you can apply it to any business, you can apply it to any venture, you can apply it in any company. Schools do such a horrible job teaching it. People leave it in the real world and go, what is writing going to do? A thesis statement and like a five paragraph essay and a word count. But that's totally not what writing is.",
      "start": 625350,
      "end": 649380
    },
    {
      "speaker": "C",
      "text": "What's your advice for becoming a good writer and a great writer?",
      "start": 649860,
      "end": 653780
    },
    {
      "speaker": "B",
      "text": "So I can help with becoming a good writer because that's all I consider myself. But the best writer I know is Nicholas Cole, who's my business partner. He wrote a book called the Art and Business of Online Writing, which is the first book I read on writing on the Internet. I think it's the number one book any person should read who's interested in writing on any kind of social platform. It's going to give you a full crash course of everything you need to know. That'd be my first piece of advice is after this video, go on Amazon and check that book out. And then my second piece of advice would be always zoom out from the lens of it doesn't matter who you are, how much time you spend on it, the reader does not care about any of that. They care about what the writing can do for them. And if you write with that, what we call an empathetic lens, putting yourself in the reader's shoes and say, how can I create something that they're going to stumble into with a problem? I'm going to solve their problem, and I'm going to solve it as quickly as two minutes. By the end of this Twitter thread or tweet or long form, it's really just solving people's problems and figuring out how you can do that in the most concise, clear, compelling way.",
      "start": 653940,
      "end": 708200
    },
    {
      "speaker": "C",
      "text": "I think when a lot of people think of writers, they think of not necessarily making a lot of money. You've been able to make a lot of money with writing. What's your recommendation for writers who want to make a lot of money?",
      "start": 708200,
      "end": 717480
    },
    {
      "speaker": "B",
      "text": "The fastest way to monetize is actually build the skill yourself and then borrow someone else's audience and ghostwrite for them. That was how I earned my first $5,000. I didn't have 20,000 100,000 Twitter followers at the time, I had a thousand. And I had one person reach out to me that I could charge $5,000 for. That's by far the most sustainable way too because you can build an income stream that's 5 to 10k a month that doesn't take 40 hours to do. So you have enough to support yourself and then you can go work on building your own audience on the side. So that's our advice to anyone who's looking to write as a career. It's figuring out first how to become a ghostwriter and then you're operating from abundance of I have enough money, I can then pursue my passion project or write about this topic that I know will take longer to monetize than starting right away trying to sell your own thing.",
      "start": 717820,
      "end": 762310
    },
    {
      "speaker": "C",
      "text": "Tell me about the tools you use as a writer. Any specific tools you recommend for writers.",
      "start": 762390,
      "end": 766870
    },
    {
      "speaker": "B",
      "text": "So if you're spending time thinking you have to have the perfect note taking system and publishing cadence and content calendar and editing system before you start writing. That's the first thing to avoid. Just hit publish. That's the best tool. So I don't really have any kind of complex organized system. If I need to find something I've written in the past, I just search my own Twitter. I use Typeshare for all my publishing. So that's a shameless plug for our SaaS that helps you write tweets, long form LinkedIn carousels for Instagram, things like that. And then I just use Apple Notes. I have Apple Notes on my phone, syncs to my computer. Anytime I come up with an idea, I just jot it down, wake up, write for 90 minutes and expand those ideas. So there's a lot of advice of use this tool, use that tool. It's gonna end up being kind of a productive procrastination exercise. So I try to avoid end up giving too much of a prescription on that.",
      "start": 767110,
      "end": 813130
    },
    {
      "speaker": "C",
      "text": "All right, so we're here. This is where you get your work.",
      "start": 813290,
      "end": 815250
    },
    {
      "speaker": "B",
      "text": "Done here I try to. I lock myself away. I lock the door behind me and try to eliminate all the distractions I lock into a little bit of a cave.",
      "start": 815250,
      "end": 822940
    },
    {
      "speaker": "C",
      "text": "But yeah, it's good.",
      "start": 822940,
      "end": 824140
    },
    {
      "speaker": "B",
      "text": "I'll mix it up.",
      "start": 824140,
      "end": 824900
    },
    {
      "speaker": "C",
      "text": "What's a day in the life like for you?",
      "start": 824900,
      "end": 826380
    },
    {
      "speaker": "B",
      "text": "So what I've realized is either be in a full build mode, which is my monk mode, 5am Wake up. I have everything scheduled down to the minute, working out twice a day. Every single meal is taken care of in advance. Going to bed at 9pm I know exactly when that's going to start, when it's going to end, so I can sprint Very hard during it. And there's a single outcome we're trying to accomplish that only happens like, three or four times a year now. So if I'm not in a monk mode, I call it maintenance mode. I take it down a notch. I try to sleep for, like, nine hours. I spend more time at the beach and take my foot off the gas because that's where those ideas actually start to percolate for the next sprint.",
      "start": 826380,
      "end": 861250
    },
    {
      "speaker": "C",
      "text": "Tell me about some of the struggles that you've had in your journey as an entrepreneur, even going back to some of the days when you're starting.",
      "start": 861330,
      "end": 868450
    },
    {
      "speaker": "B",
      "text": "If there's anything that's holding someone back from creating on the Internet more than any other factor, it's what their high school friends are going to think about them if they see them on Twitter. Like writing. It clicked with me that those people are far too busy thinking about themselves to pay any attention to you. You are not that important. I was letting the imaginary opinions of people I didn't even like hold me back from getting started writing. When that clicked for me, I go, okay, I should probably just hit publish on this. And I remember hitting publish for the first time, and no one read it. Now I have a new problem. No one cares what I have to say. So this big idea that the whole world's going to laugh at you is actually the opposite problem, which is actually harder to solve of. Well, wait. No one cares what you have to say. How do you actually put something out there that people want to engage with?",
      "start": 869170,
      "end": 913860
    },
    {
      "speaker": "C",
      "text": "All right, last question that we ask to all founders that we interview on starter story. If you could sit on Dickie's shoulder when you're just starting out, what advice would you give to him?",
      "start": 914020,
      "end": 922660
    },
    {
      "speaker": "B",
      "text": "So the first one we talked about a ton, which is, if the current vehicle you're in is not leading to more income or more skill, if you double your effort, find something else. I wish I'd have made that realization right when I started working instead of waiting two years. The second one was, once I made that realization, I started down the path of productive procrastination, where all I was doing was reading business books without a business, reading, writing books without writing, reading leadership books without a team to lead. None of that actually helped me do anything until I had something to work on where I could stop learning just in case and start learning just in time. Where, okay, I'm starting a newsletter. I need to learn how to write a compelling subject line. Now I can go read that copywriting book, jump to the single chapter on subject lines surgically Read it now. I have that skill. Now I can move on to the next thing. And you end up learning so much quicker when you have a project or something to work on that provides that relative content. And then the last one is that the people you look up to are no more special than you or more talented or smarter. They're just more than likely been doing it for longer. So just zoom out. Extend the time horizon, and you'll end up getting there, too, if you just stick with it. And then I'd say the last one is, there's never a perfect time to start anything. That's a big fallacy I had. That was once I quit my job, then I'll start this thing, or once my mom gets better, then I'll do this thing, or once work slows down, or once I move jobs that never ends. And so if you can't get started on something today thinking there'll be a better time in the future, that's never going to come. So anytime you can just throw all that out and say, how can I take one step forward on it today? I call it killing your oncees. If you can kill all the onces in your life, you'll be in a better spot.",
      "start": 922660,
      "end": 1018910
    },
    {
      "speaker": "C",
      "text": "Thank you, Dickie.",
      "start": 1019310,
      "end": 1020309
    },
    {
      "speaker": "B",
      "text": "Dude, appreciate you having me. Awesome. This is great.",
      "start": 1020309,
      "end": 1023470
    },
    {
      "speaker": "C",
      "text": "Follow this advice and you'll have a $10 million business ghost writing.",
      "start": 1023550,
      "end": 1026990
    },
    {
      "speaker": "A",
      "text": "Peace.",
      "start": 1027790,
      "end": 1028270
    },
    {
      "speaker": "C",
      "text": "All right, guys, that's it.",
      "start": 1028510,
      "end": 1029870
    },
    {
      "speaker": "A",
      "text": "I hope you liked this video. Personally, I think the coolest part about Dickie's first business is that you don't need any employees or insane funding to start. All it really requires is a laptop, an idea, and a couple of hours of work per day. So if you're curious about building a profitable side project, head to the first link in the description to get our free breakdown of 160 SoloPreneur business ideas just like Dickies, so you can get started on your own journey. All right, everyone, I'll see you in the next one. Much love. And again, thank you guys all for watching. Peace.",
      "start": 1030290,
      "end": 1062530
    }
  ]
}