{
  "source": "/home/salouri/Projects/starter_story/transcripts/h9R6ZeNruuI/h9R6ZeNruuI_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "Yep, start the story. All that I had to my name was a debt of $200,000. My business had failed. My possessions were gone. My relationships had broken down. My whole identity as a person disappeared.",
      "start": 320,
      "end": 15840
    },
    {
      "speaker": "B",
      "text": "This is Adam Lydel. And at first he thought he was a founder genius.",
      "start": 15919,
      "end": 20880
    },
    {
      "speaker": "A",
      "text": "The business was growing every year it seemed to just grow and grow. I thought I was bawling, I thought I was in invincible and I thought this is what life was always going to be like.",
      "start": 21120,
      "end": 31440
    },
    {
      "speaker": "B",
      "text": "But what comes up must come down.",
      "start": 31680,
      "end": 34640
    },
    {
      "speaker": "A",
      "text": "So all of a sudden my business collapsed pretty much overnight. I thought, that's it, I'm bankrupt and I can't fulfill this dream of mine. I'll have to work for someone and do a 9 to 5. It was very, very lonely. I'd lost my community, I'd lost my family, I'd lost my business and lost my purpose in life. I was at the absolute lowest that I could that I've ever been.",
      "start": 35040,
      "end": 63920
    },
    {
      "speaker": "B",
      "text": "When everything was at its worst, Adam came across a business that would change his life forever.",
      "start": 64080,
      "end": 70400
    },
    {
      "speaker": "A",
      "text": "As of last month, I'm 100% debt free and the only way that I was able to achieve that was through building apps.",
      "start": 70560,
      "end": 78880
    },
    {
      "speaker": "B",
      "text": "This is the story of how Adam lytle went from $200,000 in debt to making $50,000 a month with a portfolio of mobile apps. Welcome to Starter Story. Adam grew up in a troubled home with a lot of drug and alcohol use in his family. Naturally, he found himself gravitating towards computers and technology. He could understand them better than he could understand people.",
      "start": 79200,
      "end": 106990
    },
    {
      "speaker": "A",
      "text": "As a kid, I'd be role playing, having my own software business, making software even at a young age and, and I really enjoyed and loved the process of just working out how the computer works, working out how to create things. And then in high school, I started my own shareware business. I was creating my own software and releasing it online. I was making a few dollars on the side of my part time job. But then piracy came into it and people were downloading my apps for free and all of a sudden not generating much revenue from it.",
      "start": 107230,
      "end": 139590
    },
    {
      "speaker": "B",
      "text": "Adam faced his first real setback. Society expected him to follow the traditional path, get a degree, work a stable office job. But Adam had other plans.",
      "start": 139870,
      "end": 150190
    },
    {
      "speaker": "A",
      "text": "I wasn't all that great at school. I didn't feel like I was the sort of person that could do a 9 to 5 and I was the sort of person that could do this. Sitting in an air conditioned office, being away from the kids, it's not the environment that I could see myself in. So I wanted to follow my passions and turn my passions into my business.",
      "start": 150350,
      "end": 168750
    },
    {
      "speaker": "B",
      "text": "Adam knows he must follow his dreams of making a living from building stuff on his computer. So instead of going to college, he decides to pursue a different route, not realizing he's about to stumble into a gold rush.",
      "start": 169420,
      "end": 182620
    },
    {
      "speaker": "A",
      "text": "After high school, I set up my own agency creating websites for businesses. And this was prior to services like Wix and Squarespace. At the high point of the business, it was generating around about $300,000 profit per year. I thought I was bawling, I thought that I was invincible. And I thought this is what life was always going to be like.",
      "start": 184220,
      "end": 206750
    },
    {
      "speaker": "B",
      "text": "This opportunity was hot, and Adam's agency started generating really good income within just a couple years. But the success went straight to his head.",
      "start": 206990,
      "end": 217550
    },
    {
      "speaker": "A",
      "text": "Debt, I felt, was this tool to buy things, to live a lavish lifestyle now with the intention of paying it back later. So I ended up just making poor decisions and ended up getting myself into too much. $200,000 of credit debt and car loan debt.",
      "start": 217790,
      "end": 233490
    },
    {
      "speaker": "B",
      "text": "And to keep up with this lavish lifestyle and the image of being a baller, Adam had to increase his workload every year.",
      "start": 233490,
      "end": 241410
    },
    {
      "speaker": "A",
      "text": "It seemed to just grow and grow. And I didn't realize it, but I was too focused on the business, too focused on clients, too focused on deadlines. I just wasn't there with the kids and I wasn't there with the family. I was too self interested, self motivated, just fixated on what I was doing. And everyone around me just had to fall into line to accomplish the goals that I wanted to achieve with my business and my finances and the things that I wanted to purchase.",
      "start": 241410,
      "end": 268599
    },
    {
      "speaker": "B",
      "text": "As the business stayed profitable, Adam could keep his head above water. But he never planned for what would happen next.",
      "start": 269079,
      "end": 275959
    },
    {
      "speaker": "A",
      "text": "I could no longer be charging $10,000 to build a website when people were just going to Wix or Squarespace and they could create a website for $10 a month. So all of a sudden, my business collapsed pretty much overnight. My whole family was reliant on the business. It was putting a roof over everyone's head. It was putting food on the table. My logic was I have to work harder, I have to keep persevering. I have to keep digging this hole that I'm in, which meant lowering prices. And as my prices lowered, I was working more hours. And it ended up resulting in a total burnout where I couldn't do any more, couldn't access that higher level of thinking to even sit down on a desk to do work. And I started to default on some of the debts.",
      "start": 276359,
      "end": 322130
    },
    {
      "speaker": "B",
      "text": "Things started falling apart slowly. Then all at once, his cars got taken away, his accounts were frozen, and soon he was left with nothing.",
      "start": 322530,
      "end": 333330
    },
    {
      "speaker": "A",
      "text": "All that I had to my name was a debt of $200,000 that was unsecured. Now, my business had failed. My possessions were gone. My relationships had broken down. My whole identity as a person disappeared because my identity was this successful person that ran a web agency that was making good money. It was very, very lonely. I'd lost my community. I'd lost my family. I'd lost my business. I'd lost my purpose in life. I was at the absolute lowest that I could that I've ever been.",
      "start": 333810,
      "end": 366710
    },
    {
      "speaker": "B",
      "text": "Adam's life is breaking down before his eyes. And with $200,000 of debt looming over him, he realizes he has to find a new path.",
      "start": 366870,
      "end": 376150
    },
    {
      "speaker": "A",
      "text": "I could no longer sit in front of a computer, and I just had this need to just not be in the house. And I just would walk and walk and walk. And I ended up coming up with the idea of if I put a lawnmower in front of me, I could get paid to walk around. So I got the lawnmower, put an ad on Airtasker, and I'd get people, hey, can you mow my lawn for 20 bucks? Can you mow my lawn for 30 bucks? And I'd say, yes, yes, yes. And in that process, I started to sort of build my confidence again. I started to build this sense of I wanted to do more again.",
      "start": 378790,
      "end": 414210
    },
    {
      "speaker": "B",
      "text": "The more lawns Adam cut, the more confidence he got back in himself and his services. Then one day, while driving in his now secondhand car, from one mowing gig to another, he runs in to a problem.",
      "start": 414770,
      "end": 428360
    },
    {
      "speaker": "A",
      "text": "The issue that I had was I'd have to work out where people lived, plot it on Google Maps, work out the best way to get to all of the clients in the most time efficient way possible. And I asked some of the people that were mowing, they said, well, it's easy. You get a piece of paper, you write all of your jobs down on one side. That's week one. You flip it over, and you write all of your jobs down on the other side. That's week two. I said, why? Why don't you use an app for.",
      "start": 428680,
      "end": 454220
    },
    {
      "speaker": "B",
      "text": "For that?",
      "start": 454370,
      "end": 454650
    },
    {
      "speaker": "A",
      "text": "And one guy said to me, well, no app exists, and someone should look at making it. And I thought to myself, I could be that someone.",
      "start": 454650,
      "end": 463810
    },
    {
      "speaker": "B",
      "text": "With his passion reignited, Adam sets out to build an app for lawnmowers. He doesn't do it for the money, but still has high hopes that the app will perform well. Finally, it was ready.",
      "start": 464450,
      "end": 476530
    },
    {
      "speaker": "A",
      "text": "I spent Six months building this lawn mowing app. I released it and it didn't actually do all that well. I tried to work out why is it that this app that I have a very clear intention, a use case and there's a need for it. Why did that fail?",
      "start": 476530,
      "end": 492440
    },
    {
      "speaker": "B",
      "text": "Adam was stuck. His app had failed and he had no clue why. With $200,000 of debt, he needed answers fast. So he decides to do something crazy.",
      "start": 492760,
      "end": 504760
    },
    {
      "speaker": "A",
      "text": "The best way and the only way I know how to learn something new is simply just to throw myself into it and just start building. So I set myself a challenge to create one app every single month.",
      "start": 504760,
      "end": 515470
    },
    {
      "speaker": "B",
      "text": "Adam realized quickly that launching fast and validating ideas was the best way to approach new business ideas. That's what started this whole one app a month challenge. But what if you wanted to do this for a different business idea, like a service based business that only requires a website? Well, Hostinger is the fastest way to do it and they're the sponsor of today's video. Entrepreneurship is about speed and if you're wasting tons of time messing around with button design logos or worrying about the layout of your website, then check this out. The Hostinger business plan comes with a suite of AI tools and e commerce features that will allow you to go from zero to one in minutes. Let's say you want to build a website for your services business. You can select the AI website builder, add the name of your company, describe what you want, and voila. Now you have a professional brand website in minutes. And don't forget to use the AI SEO tools as a solopreneur. Building on the Internet traffic is everything. And letting AI take care of the difficult details of SEO makes your life 10 times easier. So if you want to stop wasting a bunch of time and launch your business Quickly, head to hostinger.com starter story and use the code starter story for 10% off. They're running a huge sale right now and you'll want to take advantage of it while you can. All right, now back to Adam's story.",
      "start": 515710,
      "end": 590050
    },
    {
      "speaker": "A",
      "text": "I was mowing lawns from 6am in the morning till 6pm in the evening. And then I would be sitting down and just building apps with the intention of I want to give back more to the world than I had taken previously and then learning as I'm doing it.",
      "start": 591090,
      "end": 606770
    },
    {
      "speaker": "B",
      "text": "Adam buries himself in building these small apps with the hopes of escaping his debt, his failed businesses, in his crumbling personal life. But reality would still come back to bite him.",
      "start": 607010,
      "end": 619070
    },
    {
      "speaker": "A",
      "text": "At one stage, I was taken to court over refunds for a client I looked and thought, if. If I get a judgment against me, that's it. I'm bankrupt. My career as my own independent developer stops, and I can't fulfill this. This dream of mine. I can't keep building apps. I'll have to work for someone and do a 9 to 5.",
      "start": 619150,
      "end": 639800
    },
    {
      "speaker": "B",
      "text": "One of his past agency clients had demanded a refund, and Adam didn't have the money to pay it back. Filing for bankruptcy would mark an end to his entrepreneurship career, but it seemed like that was the only choice until a miracle happened.",
      "start": 640430,
      "end": 657630
    },
    {
      "speaker": "A",
      "text": "Starting this journey of building an app per month. One of the first apps that I built became hugely successful. It was generating around about $1,000 a month, which at the time was huge. And at this stage, I had someone reach out who wanted to buy the app. He said, I'll buy it for two times annual revenue, $24,000. That was a lot of money to me. I was able to pay back the amount before I ended up going to court, and I was able to keep the debt collectors at bay. Just enough to keep my dream alive and just enough to keep creating and building.",
      "start": 657950,
      "end": 694710
    },
    {
      "speaker": "B",
      "text": "With a little beginner's luck, Adam had an initial success with building apps that not only saved him from his bankruptcy, but more importantly, made him realize that you can actually make money with this thing.",
      "start": 695030,
      "end": 707270
    },
    {
      "speaker": "A",
      "text": "That's when this business model flipped from I can create an app every month, and this is a really nice creative outlet to I can create an app every month, and I can generate two years worth of revenue from that one app. I thought of it like. Like a Runway. So I'd sell an app, I'd have a Runway extended, and then I could try to release another app that becomes successful before my Runway runs out. And that's what I did for. For two years.",
      "start": 707350,
      "end": 736010
    },
    {
      "speaker": "B",
      "text": "When Covid hit Adam's lawn mowing side hustle got shut down. So he threw himself into app development while supplementing his income with some freelancing on the side. And for a while, this worked. Adam was living the dream, waking up every day to build apps. But he was still deep in debt, and every influx of cash from an app sale only brought him a few more months of Runway. Then one night, something happened that would make Adam rethink everything.",
      "start": 736250,
      "end": 765540
    },
    {
      "speaker": "A",
      "text": "There was one instance where we went to a restaurant. I wanted to get a Pepsi Max, but I couldn't afford a Pepsi Max. I realized in that moment, what am I doing? What am I doing with my life? Am I following a dream or a passion that isn't going to come to fruition? Am I going down a path that's wrong. How can I be in a situation where I've still got debt over my head, I can't go out for dinner, and I can't even afford a Pepsi Max.",
      "start": 765860,
      "end": 793070
    },
    {
      "speaker": "B",
      "text": "Adam realizes that the business model of building apps purely to sell them isn't sustainable. So he comes up with a new strategy. Start building more apps so that even if each one makes only two to five hundred dollars a month, the total revenue is still enough to keep paying off the debt and providing for his family.",
      "start": 793630,
      "end": 813470
    },
    {
      "speaker": "A",
      "text": "And this is the time when ChatGPT came out and there was this joke that ChatGPT makes you a 10x developer. So prior to that, I was building an app every single month. To be a 10x developer, that means I would have to create 10 apps. This month, I worked as hard as I could to try to get 10 apps out, but I failed. It turns out Chat GPT only made me a 9x developer because I only had 9. 9 apps released. That brought me out of the grind of building, selling, building, selling where? The apps themselves. I had enough in my portfolio to generate enough revenue that I no longer had to sell an app to keep a pipeline going. I now had a consistent, consistent revenue that was coming in month after month, which now could pay down all my debts, pay the rent, and take my family out for dinner. I've lost track of how many apps I've built. It's over 50 at this stage. I've sold quite a few and I've built quite a few, so I can't remember exactly how many apps. And in July, I set up my YouTube channel and I thought, I'm going to do some tests with my apps and see what works, what doesn't work, and then give some feedback on the channel. I created a new paywall and I created a new onboarding flow, and that turned my revenue from generating $10,000 a month to $50,000 per month pretty much overnight. So for the last couple of months, it's been consistently going up, and each month the business is making around about 50,000 to $60,000. The reality of that hasn't even set in. That let me pay down all of my debts last month. No longer in hardship payments, no longer have four years of debt payments to go. Now I can provide a really comfortable lifestyle for myself and my family, while also letting me do what I'm passionate about, which is building and creating. I'm often asked all the time, what ideas should I create for an app? How can I do this? And nine times out of ten, the motivator is I want to be build something to make money. But from my experience, if you don't have the passion, you don't have the creativity, and you don't have the drive behind you, then it's going to be just as bad as being in debt, just as bad as having chains on you. You're going to be stuck in something that you don't want to build, stuck in something you don't want to create. So the best way to sort of work out what apps can be created is just to simply live life. Go out there and then try to work out where there's a need for an app or where there are apps that aren't doing a good enough job. And that's where all of my inspiration has come from. And what I've learned is the more you put out into the world that has a positive impact or a positive net positive result, the money and the revenue flow as a byproduct of that passion, as a byproduct of building, as a byproduct of. Of creating. I couldn't get out of bed in the morning. I felt so overburdened by the world that no matter what I did, I'd still have debts and I'd still have people chasing me. I'd still have clients upset with me. All I could do was just put my head under the blankets and just not even get out of bed. But everybody seems to have this ability or this drive in them to create something. And it seems to be, from my own experience, the antidote to depression and the antidote to that feeling of being alone and lost. And that's the advice that I would give, which is follow those motivating passions that are actionable, that make you want to learn and make you want to build.",
      "start": 813790,
      "end": 1030510
    },
    {
      "speaker": "B",
      "text": "Hey, guys, Pat here. I hope Adam's story inspires you and motivates you to start your own thing. Adam is proof that you don't have to have the perfect situation to get started. As long as you show up every day, good things can happen. If you're curious about doing something similar to Adam, but you're still looking for an idea, well, right now you can download our Deep Dive solo dev report for free. It breaks down 50 different solo developer business ideas and apps like Adam built, including their business models, revenue marketing strategies, and tons of other stuff you'd want to know to help you get started on your own thing that can actually start making money. Just click the link to business ideas in the description and we'll send it over for free. Also, I'd love to hear more what you thought about this documentary and what you'd like to see on the channel going forward. Please drop a comment. I make sure to read every single one. All right, guys, much love. I'll see you in the next one. Very soon.",
      "start": 1032430,
      "end": 1087470
    },
    {
      "speaker": "A",
      "text": "Peace.",
      "start": 1087870,
      "end": 1088350
    }
  ]
}