{
  "source": "/home/salouri/Projects/starter_story/transcripts/w8oUlfgvcTI/w8oUlfgvcTI_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "I built two companies doing over $30 million in sales by copying already successful businesses.",
      "start": 160,
      "end": 5360
    },
    {
      "speaker": "B",
      "text": "Meet Will. After the real estate crash in 2008, he lost everything and had to start from scratch.",
      "start": 5840,
      "end": 11280
    },
    {
      "speaker": "A",
      "text": "We didn't see it coming and we just totally got crushed.",
      "start": 11280,
      "end": 13800
    },
    {
      "speaker": "B",
      "text": "Then he came across the opportunity to build a SaaS. But he didn't do it in the conventional way. Instead of reinventing the wheel and building something that didn't exist yet, he developed a framework that led him to make millions of dollars.",
      "start": 13800,
      "end": 25360
    },
    {
      "speaker": "A",
      "text": "This is kind of the cold email framework that we use for uplead and I think anyone can kind of use this and apply this to their business today.",
      "start": 25720,
      "end": 31160
    },
    {
      "speaker": "B",
      "text": "In this video, Will shares his million dollar research framework, how to successfully copy lucrative businesses and the one marketing strategy that's made him millions of dollars.",
      "start": 31240,
      "end": 40680
    },
    {
      "speaker": "A",
      "text": "The playbooks are already out there. Most people just don't study them.",
      "start": 40760,
      "end": 43720
    },
    {
      "speaker": "B",
      "text": "Whether you're a seasoned builder or just getting started, this episode might blow your mind. All right, let's get into it. I'm Pat Walls and this starter story. All right, welcome Will to the channel. Tell me about who you are, what you built, and what's your story.",
      "start": 43800,
      "end": 59120
    },
    {
      "speaker": "A",
      "text": "My name is Will Cannon. I built up leads over $30 million in sales and I built signature leads over 1.6 million users without raising a dime of funding. I did it all without reinventing the wheel. I took business models that already had product market fit and I added my own little twist to them.",
      "start": 59120,
      "end": 74160
    },
    {
      "speaker": "B",
      "text": "Okay, cool. We're going to get all into this framework of how you built these and took these proven markets. But first, I want to understand a little bit more about your background. How do you get here to this place where you have these awes, awesome software businesses.",
      "start": 74240,
      "end": 84740
    },
    {
      "speaker": "A",
      "text": "So at 19, me and my girlfriend, who's now my wife, started our first mortgage company. This was during the subprime mortgage boom. So there was mortgages being handed out left and right and we were kind of new to the industry. We're like, what's going on? We started making so much money, we couldn't even believe it. And we thought we were on top of the world. This was 2005, 2006, 2007. Everything was going great. And then the mortgage crisis hit. We didn't see it coming and we just totally got crushed. So then it was time to rebuild. We were like, hey, what are we going to do next? When we had our mortgage company, we were sending a lot of cold emails to loan officers and real estate agents to recruit them. And we had a couple people in our office that would ask us, like, hey, do you have a list of loan officers or a list of real estate agents? So we were kind of selling lists on the side, but we thought, hey, this could be a business. So we started diving into that further. That's what we did for about 10 years from 2007 ish to 2017. But we kept running into the same problem as data quality. And that was the kind of the aha moment. We're like, hey, there has to be a way or a software that can do this for us. So that was the thought behind Uplead, and that was our transition from 10 years of building an agency into SaaS.",
      "start": 84740,
      "end": 142570
    },
    {
      "speaker": "B",
      "text": "All right, well, before we get into these businesses that you built, how you've grown them, and the framework for finding these ideas for these proven markets, can you break down how you actually found the ideas for your two big software companies that you run now?",
      "start": 142570,
      "end": 154770
    },
    {
      "speaker": "A",
      "text": "For Uplead, we were building our agency so the data quality from the vendors on the market at the time was around 50 to 60% accurate. We'd scrape the Internet for data, and that data was also maybe 40, 50% accurate. Every time we build a list, we'd have to verify the emails. We'd have to send the phone number list to a call center we had in the Philippines to verify the phone numbers. And that was the kind of the aha moment. We're like, hey, why isn't there a tool that can just do this for us? Why isn't there a tool where I can go in, I can punch in my icp, I can say, here's who I want to target. I click download or export and it'll download and verify the emails and verify the phone numbers in real time. We didn't find any software. We decided to build it ourselves for Signaturely, which Now has over 1.6 million users. This is how we found the idea. This was 2020, and we saw everything was moving away from face to face. So we knew documents weren't being signed face to face anymore. They were being signed over the Internet. So we looked this model up and we saw DocuSign was the biggest player in the game. They were public, they had a ton of revenue, but their product was complicated. It wasn't easy to use. We thought, there has to be a better way. Why don't we build a simple, easy to use version of DocuSign that was so easy to use, your grandmother could use it. That's how we knew this business could be successful. There was already proven product market fit. There was a need in the market for Customers that wanted a simple version of a tool that was already on the market. And we used our SEO and cold email and other skill sets to acquire customers profitably.",
      "start": 154770,
      "end": 232560
    },
    {
      "speaker": "B",
      "text": "Okay, so you did this for two very successful businesses. Businesses, you have this framework for finding ideas that are already proven and then just going and building them, doing them somewhat differently. Can you walk me through this framework so that someone watching could potentially do.",
      "start": 232560,
      "end": 246300
    },
    {
      "speaker": "A",
      "text": "The same in step one is I would look for markets that already have product market fit. I mean, I'm not Steve Jobs. I had a 1.5 GPA growing up, so I thought it was a lot easier to go into a market that already has product market fit. Now that you found a market that you want to compete in, the next step is finding your unique angle, putting a unique twist on it. It can't just be pricing, it can't just be, hey, we're like XYZ but a little bit more affordable. There has to be something, some unique twist to it. So go look at the 1 and 2 star reviews and see what people are complaining about. See what they dislike about the best players in the market. That's our twist. Our twist is what people dislike about the biggest companies in the space, because those are the easiest customers to go after and acquire. And that's step three, acquiring customers profitably. Now, this is the hardest part, but if you can get this right, you can build any business. This is the hardest part because you have to have a skill set here, whether it's cold email, whether it's cold calling, whether it's SEO, whether it's ads. So my skill sets are around cold email, cold calling, SEO and a few others. I acquired all of these by reading books, by watching YouTube videos. And step four is execution. Most people talk about building a business, but actually building it is a lot harder. You're going to fail, you're going to have to get back up, you're going to have to keep going. And this playbook, it might not work the first time. I failed at probably over 20 different businesses before having two successful businesses.",
      "start": 246300,
      "end": 315530
    },
    {
      "speaker": "B",
      "text": "I think that framework is awesome. I love that playbook. Clearly, it's worked for you for two very successful businesses. But for anyone who's watching right now, I think they might be wondering, how can I do this right now? What are the opportunities that can work in 2025? I'm sure you've come across a bunch of painful problems that you love to solve, but you have time for. What would you be building right now that the audience can learn from?",
      "start": 315530,
      "end": 334830
    },
    {
      "speaker": "A",
      "text": "One idea is a Super simple CRM. Almost every business needs a CRM. It's a big market, it's fragmented. There's multiple companies doing billions of dollars in revenue. This is an area I would probably look at if I was building something new today. Number two, I would say a payroll software for small businesses. You have a bunch of companies in the space. Again, really fragmented. Multiple winners in this space. If you look at FreshBooks and their SEO strategy around templates and tools, I'd probably copy that playbook right there. Right. They've built the playbook for you. There's an SEO advantage I would have in that market. Number three, I would say a website analytics tool. Every business needs to analyze their metrics, their funnel, how much traffic they're getting to their website. Attribution, roi. Your market is almost infinite. And if you can tie in some new things right now around AI, around maybe mentions on LLMs within the analytics tool, I think that'd be a cool tool to start today.",
      "start": 334830,
      "end": 385170
    },
    {
      "speaker": "B",
      "text": "All right, before we keep going here, I do got to call out something I've been seeing with a lot of founders. Right now you're moving fast. Maybe you're close to product market fit or you're prepping for your next round, but then enterprise prospects start asking about your security compliance and suddenly everything slows down. The reality is that in 2025, especially with AI, security expectations hit earlier and harder than ever. You can either get ahead of it or let it become the thing that kills your momentum. Vanta, today's sponsor, basically solves that entire headache. Instead of spending months figuring out SoC2 compliance, Vanta's automated workflows get you audit ready for fast. And here's what I really like about the platform. It's not just a one time setup. It keeps monitoring and updating as you scale. Fast growing startups like LangChain, Rider and Cursor trusted Vanta to build their security foundation early, which means they can focus on growth instead of getting stuck in compliance hell. Right now Vanta is offering $1,000 off for Starter Story viewers. So check out vanta.com starter story or click the first link in the description. Over 12,000 companies are already using Vanta to scale smarter. Huge thank you to Vanta for partner with us at Starter Story. Let's dive back into the interview. I want to hear a little bit more about your businesses that you built. We haven't really talked about them yet, but can you share the two businesses that you built in software that are crushing it right now? What do they do? How do they Work. And how are they doing?",
      "start": 385410,
      "end": 468300
    },
    {
      "speaker": "A",
      "text": "UpLead is a B2B data provider with real time verified emails, mobile numbers and buyer intent signals. UpLead has over 4,000 customers currently. It's done over $30 million in sales and it gets over a hundred thousand visits to its website every month. And the other business I have is Signaturely. It's an E signature company. It's an easy and simple to use alternative to DocuSign. The Signaturely has over 1.6 million users, it's done over 1.5 million in sales, and it gets over 800,000 visits per month.",
      "start": 468300,
      "end": 497760
    },
    {
      "speaker": "B",
      "text": "Okay, cool. And those are amazing businesses. Beyond the framework for finding these ideas, which we talked a bunch about, I'd also be curious to hear about how you actually grew and scaled these businesses. Can you tell me a little bit more about that?",
      "start": 497920,
      "end": 508800
    },
    {
      "speaker": "A",
      "text": "Uplead got its first 1 million in annual recurring revenue strictly from cold email. So this is kind of the cold email framework that we use for Uplead and I think anyone can kind of use this and apply this to their business today. So here's the cold email that got us our first million dollars in ar. I'll break it down. The subject line is hi, first name. So, hi James. The first line is, I was checking out your LinkedIn profile and thought this could be a value to you. We built a tool called Uplead, which is like zoom info but with real time email verification and we're really affordable. Are you open to trying it out at no cost? So the subject line is, hi James. It looks like it came from a real person. The intro is neutral and direct. I saw your profile. There's no hype there. The value prop is clear and familiar. We framed it against the biggest company in the market, Zoom Info, but better. We told what our twist is and then the ask, are you open to trying it out at no cost? We try to make the ask so easy, it's hard to say no. You don't need long emails, you need short ones that feel human. And I think any business can take this, they can tweak those lines and they can send out the same cold email that we did. So from Signaturely, we got from 0 to 1.6 million users, mainly from SEO. We use the strategy around tools and templates and ranking for them high in search. In order to get our first customers, we built a free online signature tool where you can type or hand draw your signature and you can download it and then we push them to go use that to sign documents. So that was one of the tools we use as part of our funnel. And then we also wrote templates. So we wrote marketing agreements and construction agreements and landlord agreements and we ranked a bunch of templates, templates and contracts. And that was how we got our first thousand plus customers.",
      "start": 509040,
      "end": 599800
    },
    {
      "speaker": "B",
      "text": "Okay, well, thanks for sharing that. I mean, SEO. I love SEO. Big reason Starter Story grew as well. The last question that I have for you that we ask everyone who comes on Starter Story, you built these amazing businesses. What would you say to a younger Will if you could stand on his shoulder and give him advice from when you were just starting out, you had the failed mortgage company. What would be your advice to someone just starting out?",
      "start": 599800,
      "end": 619520
    },
    {
      "speaker": "A",
      "text": "Like, you have these big hairy, audacious goals, these crazy goals, these moonshots. Right? I remember when I was first starting out, I thought if I could just make $5,000 a month, that would be enough. And then you hit that and then you go to the next level. So have big goals. Another one is things are going to come up every day. They get in your way. Don't sweat the small stuff. Think about the big picture. Another piece of advice is you have to just keep going. You're going to fail. You're going to have to get back up. I failed at probably 15, 20 different businesses before I built two that were super successful.",
      "start": 619520,
      "end": 645290
    },
    {
      "speaker": "B",
      "text": "Well, thanks for coming on the channel. I appreciate you sharing your story and these amazing businesses that you built. Hope to have you on again sometime and see your businesses grow even more. So thanks for coming on.",
      "start": 645290,
      "end": 655310
    },
    {
      "speaker": "A",
      "text": "Thanks for having me back.",
      "start": 655780,
      "end": 656660
    },
    {
      "speaker": "B",
      "text": "Thanks again to Will for coming onto the channel and sharing his story. I love his approach to building businesses where it's not about creating a whole new category, but instead just adding a small twist on what's already out there. If you're looking to do something similar, then definitely check out Starter Story Build. It's our program where we teach you how to use in demand AI coding tools and go from an idea to a real working app in just a couple weeks. Having coding experience is not an obstacle to building a real software products anymore. And if you want to build something, just click the link in the description to Starter Story Build and check it out.",
      "start": 656900,
      "end": 688360
    },
    {
      "speaker": "A",
      "text": "All right.",
      "start": 688360,
      "end": 688680
    },
    {
      "speaker": "B",
      "text": "I hope you guys enjoyed the episode and found it valuable. I'll see you in the next one.",
      "start": 688680,
      "end": 691880
    },
    {
      "speaker": "A",
      "text": "Peace.",
      "start": 692040,
      "end": 692520
    }
  ]
}