{
  "source": "/home/salouri/Projects/starter_story/transcripts/9pP4qSrt5GU/9pP4qSrt5GU_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "The Internet has created a new opportunity. If you can write like a fifth grader, you can make millions. And I just found living proof. This is Mason, an average kid who went from earning $10 an hour packing boxes to making $2.3 million by the age of 21. All by learning one skill, copywriting.",
      "start": 160,
      "end": 17960
    },
    {
      "speaker": "B",
      "text": "I think it's something that anyone can do.",
      "start": 17960,
      "end": 19600
    },
    {
      "speaker": "A",
      "text": "I flew out to Miami to meet Mason and ask him exactly how he did it. And what I learned was insane. With a laptop and a lot of hustle, he taught himself copywriting and started a small freelance business. All with a few months later, he was already making a doctor's salary.",
      "start": 19680,
      "end": 35140
    },
    {
      "speaker": "B",
      "text": "Grew it all the way to 48k a month at my peak.",
      "start": 35140,
      "end": 37580
    },
    {
      "speaker": "A",
      "text": "In this video, we're going to dive deep into his business and show you exactly what it takes to become a world class copywriter. And we'll cover what I think is the number one secret to why Masons made millions.",
      "start": 37580,
      "end": 47900
    },
    {
      "speaker": "B",
      "text": "Hundreds of thousands of people are using this model to make money. It's the way better way to go.",
      "start": 48060,
      "end": 52660
    },
    {
      "speaker": "A",
      "text": "I'm Pat Walls and this is Starter Story.",
      "start": 52660,
      "end": 55100
    },
    {
      "speaker": "B",
      "text": "Who are you guys?",
      "start": 60710,
      "end": 61390
    },
    {
      "speaker": "C",
      "text": "We're Starter Story.",
      "start": 61390,
      "end": 62310
    },
    {
      "speaker": "B",
      "text": "Starter Story.",
      "start": 62390,
      "end": 63070
    },
    {
      "speaker": "C",
      "text": "We're here to unveil your scam operation.",
      "start": 63070,
      "end": 65750
    },
    {
      "speaker": "B",
      "text": "Oh, the scam. Oh, yeah, yeah.",
      "start": 66150,
      "end": 68150
    },
    {
      "speaker": "C",
      "text": "Come on in.",
      "start": 68150,
      "end": 68670
    },
    {
      "speaker": "B",
      "text": "I know this is about the legit business. If this is about the scam. Yeah, yeah, yeah. This is the crib. All right, man.",
      "start": 68670,
      "end": 73110
    },
    {
      "speaker": "C",
      "text": "Good to meet you. Give us a breakdown of who Cardinal Mason is and everything that you've built.",
      "start": 73430,
      "end": 78030
    },
    {
      "speaker": "B",
      "text": "I was a 21 year old college dropout that got into freelance copywriting. Fell in love with it basically at first sight. Loved it so much that I grew it all the way to 48k a month at my peak. Wasn't sustainable, but I did it anyway. I rolled that into building an agency, email marketing agency that did multiple six figures a year. I wanted to share more about my journey of being a copywriter because I think it's something that anyone can do. So I turned it into a program education company like we did a million in 96 days. I want to make as many people very wealthy as I possibly can.",
      "start": 78030,
      "end": 108830
    },
    {
      "speaker": "C",
      "text": "What exactly is copywriting?",
      "start": 108830,
      "end": 110430
    },
    {
      "speaker": "B",
      "text": "Why is it so important? Right. So copywriting is on a high level. It's righty marketing materials for companies. So anything that's spoken or posted on Instagram or posted on Facebook or in an email or in a text message you get is written by a copywriter. So like basically all of the communications going from business to the consumer is written by a copywriter. And the better that that that communication is. The more money you're gonna make, the more people are gonna like you, the more people are gonna come back and spend more money. Not just like the first customer or the first touch, but like, every other touch after that. And so a good copywriter is basically like, the messenger from the company to the world. Everyone's like, okay, wait, well, like, which company doesn't have that? You'd be surprised. It blew my mind to learn how many business owners, like, don't have that or know how to do it themselves.",
      "start": 110670,
      "end": 157880
    },
    {
      "speaker": "C",
      "text": "I hear that AI is going to kill copywriting. Can you tell me about the opportunity of copywriting?",
      "start": 158200,
      "end": 163240
    },
    {
      "speaker": "B",
      "text": "The reality is that AI is good and it's. But it's a tool. People need to understand this. Like, AI does not just instantly know what to do, what to write. AI is a tool that copywriters can use to write better, write clear, think better, have more ideas, like just more concepts. But the reason someone's hiring a copywriter is because they don't even know where to start, right? Like, a lot of business owners, like, it's not that they don't have time or that they just need someone to do it. It's usually, like, because they need someone to, like, think on their behalf. AI can't do that yet. And so for now, for AI to actually give you good, solid copy that's going to convert and make people, like, want to hear more from you, it has to be written by a real copywriter first. Like, any prompts that AI gets has to be from someone who fundamentally understands copywriting. Like, the opportunity here is that there are 35 million businesses, small businesses, in the US alone. There's about 45 to 5,000 freelance copywriters in America. So for it to be saturated, every single copywriter would have to have, like, 3,000 clients. And you only need four, five, six clients to make really solid money. Like, six figures. Like, everyone is really lazy. And so if you think that, like, if I get a video talking about copywriting and it has 100,000 views, for any 100,000 views that I get, there's probably another five people that are actually trying it, and four of them are going to give up in, like, in a month. So, like, if you actually genuinely want to work, then there's more than enough to go around.",
      "start": 163240,
      "end": 245100
    },
    {
      "speaker": "C",
      "text": "You're out of college. You're trying to figure out how to make money online. Tell us about how you got your first client. How did that work?",
      "start": 245180,
      "end": 249740
    },
    {
      "speaker": "B",
      "text": "Scroll through constantly. Just, like, looking for any type of company that, like, would hire me. I Got one. A music blog. They made no money. I think they posted. The rate was like 1.5 cents a word, which means for a thousand words, I get $15. So that's like actual, like, minimum wage. I kind of gave myself a pep talk, and I was like, all right, if I'm. If I'm gonna do this, let's do it right. But, like, it can't. Just Google companies that will pay me to write copy for them. Like, you can't. There's no search for that. So I went to Instagram. I would just wait for ads. So I would, like, scroll through every. Like, three or four posts on Instagram would be an ad. And so I eventually found a bunch of companies. Using that, I figure out who the founder is and then figure out what their email is, and then I would just send them a cold email. Today I got a response saying, hey, Mason, thanks for reaching out. Would love to get on a call and talk about what this would look like. So I ended up getting on the call. I took it way too seriously. I probably could have been more chill. And I dressed up like. I asked my mom. I was like, should I wear a tie? And she's like, I don't know. I think it might be a little bit too much. He was like, all right. Emails, ads, blogs, they wanted kind of everything for me. And he was like, what would you charge for that? And I was like, 2,500 bucks a month. And he was like, all right. To me, bro, that was like a year of income for me. I felt like I, like, snuck in somewhere, and I was like, that is imposter syndrome.",
      "start": 249820,
      "end": 318020
    },
    {
      "speaker": "D",
      "text": "Hey, real quick. That business you want to start, Let me show you how you can make your first dollar ten times faster by using case studies. Imagine you could read the exact steps to how someone built a million dollar business and the mistakes they made so you can avoid them when you launch. Well, at Starter Story, we have a Libra library of over 4,000 case studies and business idea breakdowns where you can do this, all backed by real data. For example, Luke joined Starter Story and dove into our case study about a newsletter that makes $25 million a year. Just one month later, he launched his own newsletter that did $5,800 in revenue in the first 30 days. It's simple. He studied what works, implemented it, and avoided the mistakes of people that were just a few steps ahead of him. If you're serious about building something, check out starterstory.com. we're running a special deal this week, and you can Click the link below in the description to get it. Much love and I hope you guys enjoy the rest of piece.",
      "start": 318020,
      "end": 365660
    },
    {
      "speaker": "C",
      "text": "As a copywriter, what are the most useful tools?",
      "start": 365660,
      "end": 368060
    },
    {
      "speaker": "B",
      "text": "Okay, so the cool thing about being a copywriter is, like, you don't really need much. I've always said that, like, the bare minimum that you can do copywriting with is like 40 bucks, right? So if you have 40 bucks to spend, congrats, you can be pretty much copywriter. Like, it's domain and a website. So domain off, Google domains. Website off card. I know people that will do it without a website. I don't recommend it. I use mail track. You can see people's interactions with your email. You send them one on one, like if they open it or forward it or something. Right. Hunter IO is good just to figure out, like, who people like what their email is. So, I mean, yeah, dude, there's not really much you need.",
      "start": 368220,
      "end": 402000
    },
    {
      "speaker": "C",
      "text": "All right, so you're probably one of the best copywriters in the world, whether you like to admit it or not.",
      "start": 402000,
      "end": 405960
    },
    {
      "speaker": "B",
      "text": "I don't know about that one, though.",
      "start": 405960,
      "end": 407000
    },
    {
      "speaker": "D",
      "text": "At least one of the fastest. What would be your advice to people.",
      "start": 407000,
      "end": 410480
    },
    {
      "speaker": "C",
      "text": "That want to get good fast at copywriting?",
      "start": 410480,
      "end": 412120
    },
    {
      "speaker": "B",
      "text": "I mean, to get good fast, like, you just have to write so much. Like, when I was at my best was when I was, like I said, kind of just cracked out, just writing for eight hours a day straight. Again, that's not realistic for a lot of people. Like, some people have jobs. Immerse yourself in the world of whatever you're trying to do. So, like, I was reading a lot of copy. I was writing a lot of copy. I was, like, editing a lot of copy for, like, some of my teammates. I was, you know, listening to podcasts about marketing. I was watching YouTube videos on it. Like, dude, it was all I did. You just have to force yourself to be fast. If you give someone 10 hours to do a task, it's gonna take them 10 hours. But if you give them one hour, it'll take about an hour. And so that's what you realize where it's like, you will just continually keep adding clients. And you think that if you're currently working 40 hours a week with, like, three clients and you add one more, then it's gonna be like 50 hours a week. But it's not. You're just gonna find a way to squish that in. You think your garbage is full. You think your garbage. Can you push it down and realize that it's only like 25% full?",
      "start": 412120,
      "end": 462900
    },
    {
      "speaker": "C",
      "text": "It sounds like the well, the network was a big thing for you, meeting Chase, who is well connected in the copywriting space. Tell me a little bit more about that building your network.",
      "start": 462900,
      "end": 470820
    },
    {
      "speaker": "B",
      "text": "Chase had just had a baby, and so he wasn't actually actively working in the business. He was working, like, on the business. Like, just trying to do lead gen, get clients in. But I knew Chase is, like an influencer. Like, I followed him on Twitter and he was talking, he was famous to me. I got one of the team members to give me his address, and I went and made, like, a custom onesie for his daughter. On the front of the onesie, it said, email marketing is dead. And then crossed out, it said, dad. Email marketing is dad. And he put it on his dot and he was like, dude, who did this? And then someone eventually told him, like, mason did that. And so that started, like, the relationship and the interaction. I told him. I was like, dude, like, listen, like, not trying to pump your tires or anything, but, like, I'm a fan and, like, I think I could help you a lot. So, like, if there's anything you need, you let me know and I'll just write it. Like, blogs, emails, tweets, like, I'll do whatever. Kind of cool, like how. Like, he hired. He gave me one of my first gigs. Like, he gave me a shot.",
      "start": 470820,
      "end": 516350
    },
    {
      "speaker": "C",
      "text": "Now tell me about how your experience freelancing in those first few years has now translated into this bigger business that is, I guess, a derivative of this hard work that you put in those days. Can you tell me about that and then what those businesses look like today?",
      "start": 522010,
      "end": 535609
    },
    {
      "speaker": "B",
      "text": "You're probably not going to be a freelancer for, like, the rest of your life. Like, some people can do that if that's, like, what they want to do. But, like, what I see a lot is people will sort of reach the top of, like, freelancer income, which is around 30 to 40k a month. But, like, if you want to get to like 100, 200, 500k a month, like, know, you. You kind of have to build something else because you have to hire people, you have to learn new skills, you have to learn more about fulfillment. You have to become an operator. It's all kinds of different skills. Instead of just trying to squeeze as much juice as they can out of being a freelancer, they'll usually work with a couple dozen companies over the course of two or three years that they're doing it. But with those people, they'll learn from them what they're doing. So I worked with a lot of agencies. I work with a lot of info guys. I work with a lot of E commerce brands. I kind of had my pick. I was like, I know how all these businesses kind of work. I really like the idea of an agency and so that was why I chose to go from freelancing to agency. And it made it way easier for me to learn how to do that. I still have a couple freelance clients that I still work with just because I need to stay sharp. I still write for Chase. Like I still like do some stuff for him. I have a series called Alex in my inbox with him that actually. Yeah, so everyone kind of knows at this point like I'm Alex.",
      "start": 535690,
      "end": 596250
    },
    {
      "speaker": "D",
      "text": "That's awesome.",
      "start": 596250,
      "end": 596730
    },
    {
      "speaker": "B",
      "text": "I didn't know that. You didn't know that.",
      "start": 596730,
      "end": 597650
    },
    {
      "speaker": "C",
      "text": "I didn't know that was you.",
      "start": 597650,
      "end": 598370
    },
    {
      "speaker": "B",
      "text": "Yeah, that's me.",
      "start": 598370,
      "end": 599050
    },
    {
      "speaker": "C",
      "text": "That's awesome.",
      "start": 599210,
      "end": 599930
    },
    {
      "speaker": "B",
      "text": "My main sole focus, the only thing that I genuinely like want to grow and the only thing I care about is copy mba. I think it's the best opportunity to make an impact on my audience. I think I can make a big impact with the people that choose to be part of my team. And we have an opportunity to hit some stupid numbers.",
      "start": 600170,
      "end": 616710
    },
    {
      "speaker": "C",
      "text": "You were in this space where you're making a few thousand with your freelancing work. Some people watching this might also be working as a freelancer and trying to.",
      "start": 616710,
      "end": 623310
    },
    {
      "speaker": "A",
      "text": "Take it to that next level like you did.",
      "start": 623310,
      "end": 624990
    },
    {
      "speaker": "C",
      "text": "So what would be your advice to people to go from small time freelancer to big time.",
      "start": 624990,
      "end": 629470
    },
    {
      "speaker": "B",
      "text": "Like what you're doing, it's such a silly mistake. Basically what people do is they don't understand that they can get like recurring sort of like agency style retainers, 2, 3, 4 grand a month to work with a client and they just do these one off gigs and they write 100 product descriptions. They get paid 1000 doll to do it and then they're on the chase for the next client. Obviously that's not the right way to go. You don't need to do that. Hundreds, thousands of people are using this model to make money. It's the way better way to go. Like if you're only doing like one email a week and they're paying you 800 bucks a month, like I'd say that's probably kind of fair. Like you should do more stuff, provide value, dude. Like that's all you have to do.",
      "start": 629470,
      "end": 661050
    },
    {
      "speaker": "C",
      "text": "What does a day in the life.",
      "start": 661130,
      "end": 662290
    },
    {
      "speaker": "A",
      "text": "Look like for you?",
      "start": 662290,
      "end": 663010
    },
    {
      "speaker": "B",
      "text": "Dude, my days are very like boring. I wake up late, around like 9. I'll usually stay in bed until like 9:45. I'll walk to the coffee shop, get A coffee, say what's up? Go back upstairs, lock in. Usually I'll start the day writing something just to like get in the groove. I think it's a good habit to like write every morning. Gets the brain flowing a little bit. So yeah, I'll write an email to my list or, you know, a long message in slack to my students or like something to my team or something.",
      "start": 663010,
      "end": 689850
    },
    {
      "speaker": "D",
      "text": "Something.",
      "start": 689850,
      "end": 690170
    },
    {
      "speaker": "B",
      "text": "I usually get on calls in the morning because I have a lot of energy and I can talk about stuff. Most of it is content too, so I'll probably go live once or twice. I'll make a video for TikTok. Usually just like talking to students or being on TikTok, like that's all my job is. I go to the gym. But like I'm super under optimized. I like to walk around like I like to get 8 to 10,000 steps a day solid. Feels good. And at this point my team is big enough where I can kind of just like think of stuff and then be like, Abby, do this, or Ali, do this or Griff, do this or Ben, do this. Whoever is in charge of that thing will just like take it and run with it. And I'm just like, sit with my aquapona.",
      "start": 690170,
      "end": 721470
    },
    {
      "speaker": "C",
      "text": "All right, well, the last question we ask for all entrepreneurs is if you could go back and sit on Mason's shoulder, what would be some things that you would tell him that you've learned along the way?",
      "start": 722350,
      "end": 731790
    },
    {
      "speaker": "B",
      "text": "Don't procrastinate. It was a, a big one. Don't be afraid of what you think is going to happen. Just try it and see. Like nothing's ever that bad. Like you're never going to make a decision that completely just derails everything in the grand scheme of things. It's never that big of a deal. I made a lot of mistakes, obviously, as everyone does in the early days, but I would never change anything. The regret of sending the wrong message to a client or prospect. The regret of, you know, working with someone that I probably shouldn't have worked with. Like every single thing that I've done has led to this exact moment, which I'm. I'm happy that we're here. I like hanging out with you. So I wouldn't change anything. It makes the Ls really easy to handle. When you have the mindset of in 10 years, I'll never regret anything that I'm doing right now. Every. Yeah, every mistake you make is gonna end up being alright. Alright.",
      "start": 731790,
      "end": 771570
    },
    {
      "speaker": "D",
      "text": "Thank you sir.",
      "start": 772450,
      "end": 773330
    },
    {
      "speaker": "B",
      "text": "Thank you, man.",
      "start": 773410,
      "end": 774370
    },
    {
      "speaker": "C",
      "text": "Follow these steps and you'll be a.",
      "start": 774530,
      "end": 776130
    },
    {
      "speaker": "B",
      "text": "Multi millionaire copywriter overnight takes no work. You don't have to do any.",
      "start": 776130,
      "end": 780130
    }
  ]
}