{
  "source": "/home/salouri/Projects/starter_story/transcripts/p3xa6mpxvOY/p3xa6mpxvOY_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "This guy turned $1,000 into a $60 million investment fund through a loophole that nobody's talking about, the syndicate. He invited us out to New York to show us exactly how it works and how anyone can be a venture capitalist without being a member of the ultra rich. Alex has invested in over 270 private startups. And the crazy part is he still hasn't quit his full time job.",
      "start": 240,
      "end": 24640
    },
    {
      "speaker": "B",
      "text": "It's probably a 70, 30% split of 70. Full time job, 30%. Kind of the side hustle VC world.",
      "start": 24880,
      "end": 33180
    },
    {
      "speaker": "A",
      "text": "A syndicate is like a special club for investing and now it's popping up everywhere. Why? Because it allows regular people like Alex to invest in unicorn startups with as little as $1,000. But how does someone raise over $60 million from a bunch of random investors? By using a strategy called deal scouting.",
      "start": 33260,
      "end": 53500
    },
    {
      "speaker": "C",
      "text": "Most VCs that I meet aren't going to give a shit about me, Right. My check is small, I'm insignificant to that. But if you're able to share high quality deals or you actually source they end up doing, you'll see the relationship change quite a bit.",
      "start": 53500,
      "end": 66840
    },
    {
      "speaker": "A",
      "text": "In this video, Alex breaks down everything. How he'd start over from scratch, how he found his first deal, and how to evaluate startups that could return over 20x.",
      "start": 66840,
      "end": 77240
    },
    {
      "speaker": "C",
      "text": "When I say big winner, I mean 50, 100, 250x ROI on your investment.",
      "start": 78680,
      "end": 83960
    },
    {
      "speaker": "A",
      "text": "I'm Pat Walls and this is Starter Story.",
      "start": 84360,
      "end": 86840
    },
    {
      "speaker": "D",
      "text": "All right man, thanks for having me, Appreciate it. Tell me about who you are and what you're doing.",
      "start": 92690,
      "end": 97170
    },
    {
      "speaker": "B",
      "text": "My name is Alex Pattis and I run what's called a syndicate. A syndicate is an alternative approach to venture capital where you would invest in the fund and then the manager would deploy on your behalf. What we do is we provide direct access to a specific deal and allow our limited partners to participate in as little as $1,000. So I was able to invest in 275 companies, deploy about 60 million in total capital, all as a side hustle while I was kind of operating as an early stage employee at a startup.",
      "start": 97170,
      "end": 129110
    },
    {
      "speaker": "D",
      "text": "And as I understand it, you can technically invest in a startup that you wouldn't be able to invest in previously because you're putting just a little bit of money in and then you are working with a network of people to put the rest of the money in.",
      "start": 129110,
      "end": 140350
    },
    {
      "speaker": "B",
      "text": "Yeah, so I'm not high net worth. I don't have a ton of money to deploy. Right. For me, this is an avenue to meet a typical minimum threshold to get directly on that cap table. So if we are to invest 100k in a company and you invest $1,000 into my SPV, you're going to own 1% of this entity that goes on the cap table. And then at some point in the future when the company might IPO or exit, you will then make a return if we have a positive outcome.",
      "start": 140350,
      "end": 169850
    },
    {
      "speaker": "D",
      "text": "Something changed in the last few years where now this opportunity is possible. Can you tell me a little bit more about that?",
      "start": 169850,
      "end": 174490
    },
    {
      "speaker": "B",
      "text": "Yeah. You've now seen a number of companies that help individuals set up these sp. So you've got players like Angellist, like Sidecar, like Carta, enabling individuals like me who have zero aum, nobody's invested in my fund to go out there and identify a great founder or great company to invest in. I can set up this spv, I can reach out to friends, friends of friends, those who are accredited investors to participate in that deal and invest through my vehicle. Backing syndicates is kind of a unique way for these everyday investors to access the this venture capital asset class where you need to actually have a relationship with the founder, the CEO, the company and at the right time of when they're actually raising around. So most of these folks while interested in venture capital, they don't know the founders, they don't know the timing to be talking to the founders. We take care of all of that by securing these allocations, knowing the timing, knowing the right companies and provide them an avenue to participate in these deals. Unlike the public markets where you can simply research, buy and trade as you see fit. So it's a really nice way to bundle these checks, democratize access to a lot of these startups. And I think yeah, over the past five years we've seen significant growth there and a lot of these platforms have played a kind of meaningful role in that as well.",
      "start": 174490,
      "end": 242830
    },
    {
      "speaker": "D",
      "text": "Tell me about your backstory. How do you get here?",
      "start": 242830,
      "end": 245230
    },
    {
      "speaker": "B",
      "text": "Out of college I got a sales job at JJ selling medical devices. That job took me to Sacramento, California, decided I need to make the move to New York. So did that and that was my kind of intro point to the world of operating in early stage startups. So I ended up joining the company called Market Access Transformation. Joined as the first employee pre launch, kind of the stage of it's myself and the founder and kind of a concept that we're looking to bring to life. The company went on to have a really great outcome and exit. But before we got there and I was on the journey, I kind of felt that my net worth was heavily tied up in one single company. So in the process of trying to diversify some of my future net worth. I identified kind of syndicates and special purpose vehicles. I started out by backing Jason Calacanis syndicate and that was like a great opportunity for me to see some of the deals he was doing and get the opportunity to participate. Over, you know, a one year period, I invested in a handful of startups. I started to ramp up deal flow, I started to meet other founders. That was kind of the point and inspiration to launch my own syndicate at this time. I really invested a lot of time networking with other venture capitalists. Right. And I branded myself as kind of this deal flow hustle guy who would essentially get the opportunity to learn from them, right. What deals do they want to see, what deals do they want to participate in? How do they think about investing? So after like grinding this out for a couple years, I ended up co syndicating deals, meaning I would team up with another syndicate lead to kind of put both our deal flow together and our LP or our investor base together to get more deals done. And that was when things really started to take off. So this was probably end of 2020. So the past three and a half years is really where we've been able to lean in. Now back 275 different, deploy about 60 million in total capital and pick up a lot of key learnings, back a lot of awesome founders and companies along the way.",
      "start": 245230,
      "end": 358060
    },
    {
      "speaker": "D",
      "text": "So what's crazy about all this? You've invested in over 270 companies while part time. How the hell did you do this?",
      "start": 358060,
      "end": 365100
    },
    {
      "speaker": "B",
      "text": "It's navigating. What are the times that I can spend talking to the right founders, scheduling the right intro calls with them. For me, I'm a morning person. I get up very early and that's kind of my opportunity to get in a couple hours of work before kind of the day job hits. So a lot of times it's the early morning meetings, it's the late evening meetings. I meet founders for coffee all the time on the weekend. It's probably a 70, 30% split of 70. Full time job, 30% kind of the side hustle VC world. I also believe in kind of the long term vision here. I think there's a bigger opportunity. This is a growing category I want to be known as, you know, the syndicate lead there. A lot of that thinking and attitude I think has enabled me to go the extra mile, whether it's taking an hour out of the evening or the weekend or whatever to meet the founders, build a relationship, make sure that if they are indeed the right company and the right time for us to invest I'm going to be there to get that allocation.",
      "start": 365100,
      "end": 417060
    },
    {
      "speaker": "A",
      "text": "Quick break.",
      "start": 417060,
      "end": 417700
    },
    {
      "speaker": "D",
      "text": "This is me five years ago, desperate to start my own business, but plagued.",
      "start": 417860,
      "end": 421980
    },
    {
      "speaker": "A",
      "text": "With Shiny object syndrome.",
      "start": 421980,
      "end": 423340
    },
    {
      "speaker": "D",
      "text": "I tried building SaaS tools, freelancing, affiliate marketing, but none of these business ideas.",
      "start": 423340,
      "end": 428580
    },
    {
      "speaker": "A",
      "text": "Ever panned out to anything.",
      "start": 428580,
      "end": 429940
    },
    {
      "speaker": "D",
      "text": "But everything changed one day when I.",
      "start": 429940,
      "end": 431500
    },
    {
      "speaker": "A",
      "text": "Looked inside and wondered, what if instead I built a business around what I'm good at and what I'm passionate about? Well, that decision led me to building a business that now makes over a million dollars a year. And that's what Starter Story is all about. It's a community of thousands of founders who change their life by building an online business around their skills and their passions. Our 4000 plus case studies and business idea breakdowns will show you how regular.",
      "start": 431500,
      "end": 456690
    },
    {
      "speaker": "D",
      "text": "People just like you found the right.",
      "start": 456690,
      "end": 458850
    },
    {
      "speaker": "A",
      "text": "Idea and turned it into millions. For example, Luke joined Starter Story and.",
      "start": 458850,
      "end": 463050
    },
    {
      "speaker": "D",
      "text": "Dove into our case study about a.",
      "start": 463050,
      "end": 464490
    },
    {
      "speaker": "A",
      "text": "Newsletter business that makes over $25 million a year.",
      "start": 464490,
      "end": 467650
    },
    {
      "speaker": "D",
      "text": "Just one he launched his own newsletter.",
      "start": 467810,
      "end": 469990
    },
    {
      "speaker": "A",
      "text": "Business that did $5,800 in revenue in 30 days.",
      "start": 469990,
      "end": 473390
    },
    {
      "speaker": "D",
      "text": "So if you're serious about finding that.",
      "start": 473470,
      "end": 474950
    },
    {
      "speaker": "A",
      "text": "Right idea, click the first link in the description.",
      "start": 474950,
      "end": 477630
    },
    {
      "speaker": "D",
      "text": "We're running a special for the YouTube family. All right, enjoy the video. I'll see you around.",
      "start": 477630,
      "end": 481910
    },
    {
      "speaker": "A",
      "text": "Peace.",
      "start": 481910,
      "end": 482310
    },
    {
      "speaker": "D",
      "text": "Let's talk about your first deal. You invested, as I understand, only $1,000 in your first deal. Can you tell me about how that manifested and how it worked?",
      "start": 482310,
      "end": 489790
    },
    {
      "speaker": "C",
      "text": "I ended up finding this particular deal through another very early stage venture capital fund that I had built a relationship with. In this particular company, they were raising 2 million DOL at a $6 million valuation. We had the opportunity to invest 150,000 as the final tranche and that company today has recently raised at a $500 million valuation.",
      "start": 489790,
      "end": 512490
    },
    {
      "speaker": "A",
      "text": "Wow.",
      "start": 512650,
      "end": 513130
    },
    {
      "speaker": "D",
      "text": "So that's like a 2000, 3000% return.",
      "start": 513130,
      "end": 515530
    },
    {
      "speaker": "C",
      "text": "It's a bigger return than you're going to see in the public markets. It looks extremely well for all of those folks who got involved at that $6 million valuation.",
      "start": 516010,
      "end": 522730
    },
    {
      "speaker": "D",
      "text": "You've done a ton of deals. What exactly is the selling point and how are you able to round up so much capital so easily as a part time job?",
      "start": 522890,
      "end": 529850
    },
    {
      "speaker": "C",
      "text": "I think for each deal there's a bunch of but there's really two that stick out. One is who is this tier one institutional fund that's leading the round and.",
      "start": 529850,
      "end": 539390
    },
    {
      "speaker": "B",
      "text": "Has done the diligence?",
      "start": 539390,
      "end": 540350
    },
    {
      "speaker": "C",
      "text": "Most of these investors will lead the round and set the terms and folks would not typically have access. So part of my role is gaining that access, getting the allocation to participate in that Round alongside these tier one, these institutional venture capital funds for as little as $1,000 per deal. And the second piece is the founders. Right. For early stage investors, we don't really know if this product is right or if they're going to pivot later on. We're betting on people to navigate the probably soon to be choppy waters and figure out a great solution to the, to the problem that they're trying to solve. Identifying founders who have a really good background or market fit or have shown success in a previous company as a founder or CEO, those are the people that we're really looking to identify. So yeah, if I had to sum it up, I'd say we really focus on backing the right people and investing alongside the right investors.",
      "start": 540350,
      "end": 590610
    },
    {
      "speaker": "D",
      "text": "270 companies invested in. How do you find all these deals really?",
      "start": 590770,
      "end": 594970
    },
    {
      "speaker": "C",
      "text": "There's five different ways that we typically source deals and access founders. The first is co syndicating with other syndicate leads like myself.",
      "start": 594970,
      "end": 603370
    },
    {
      "speaker": "B",
      "text": "Right.",
      "start": 603370,
      "end": 603730
    },
    {
      "speaker": "C",
      "text": "A lot of times there will be other syndicates that maybe have a larger allocation than they can fill and they'll reach out to us to kind of co syndicate the deal, team up and put the deal together. A second way is relationships with other venture capital funds. Early on in my day, I spent a lot of time building this steel flow hustle guy brand for myself and I shared a bunch of deals with a lot of different VCs. Today I've been able to access some deals alongside them when they might be leading the round or they might be setting the terms. Another way that we access deals is through our portfolio founder. So as we've built relationships with the founders that we've invested in and been helpful or been easy to work with and become friendly or whatever it may be, they're now referring a lot of their founder friends to us, which has been a great way to access founders early on and really in a positive light from an existing portfolio founder. Another way that we access deals is through other angel investors who invest very early stage and you know, they're not going to be competitive with us or a bigger venture capital fund. They always take a small sliver of the round itself. And so when I can build good relationships with these angels and source deals their way, they also will share a lot of the deals that they are participating in or have participated in. And then the last piece is leveraging our investor base. The folks that invest in our deals. A lot of those times they are founders, CEOs, heads of product engineering, head of sales, or run a small business that might sell into these startups. So those are kind of the five different ways that I have built a flywheel, I'd say over the past four or five years and see a lot of the most competitive deals.",
      "start": 603730,
      "end": 704430
    },
    {
      "speaker": "D",
      "text": "And when you get a deal, how do you evaluate? How do you know it's something that you should or should not invest in?",
      "start": 704430,
      "end": 709190
    },
    {
      "speaker": "C",
      "text": "So the founder, CEO and their relevance to the business is always going to be the most important. Are they in this for the long run? Do they understand this market based on their previous role and problems they may have solved? Companies they may have worked at? Are they a multi time founder? Have they shown success in a previous co founder, CEO role? Then we're also looking at things like how big is this market, right? And is it a growing market? Is there an opportunity for this to be a really big company or even have multiple big companies in that market? Are there early signs of product market fit? A lot of times we invest when there's very limited traction. You know, the business is just getting off the ground. We want to see those early signs that they are building a product that customers want and will pay for and have the opportunity to scale. And then some of the other things we'll look at is who is co investing in the round. I am not built like an institutional fund with management fees to work 9 to 5 on this and do the diligence that a traditional institutional fund would do. So piggybacking or leaning on these funds that are set up to lead round, set terms and sign off or underwrite the deal is also quite important when we think about what's the right fit for us or not.",
      "start": 709190,
      "end": 773610
    },
    {
      "speaker": "D",
      "text": "For someone watching who wants to start their own syndicate, how do you get started and how do you start sourcing deals?",
      "start": 773610,
      "end": 778690
    },
    {
      "speaker": "C",
      "text": "I think it's really about leaning into building a network of individuals or funds that have access to deals and figuring out how they can share them with you. And I think in order to build that, you really have to have a pay it forward mentality with some of these relationships. Most VCs that I meet aren't going to give a shit about me, right? Like my check is small, I'm insignificant to that. But if you're able to share high quality deals or you actually source a deal that they end up doing, you'll see the relationship change quite a bit where they actually want to lean into, keeping you happy, keeping you top of mind. You know, I've got examples of VCs that I probably sent 10, 20 deals to and it wasn't until the 20th or so that they actually ended up participating in that round. And now like some of these folks who I spent, you know, couple years sharing deals with, I'm just now getting the unique look of deals that they are leading and now sharing with me.",
      "start": 778690,
      "end": 831220
    },
    {
      "speaker": "D",
      "text": "So once you find the deal, what are all the steps that happen until this deal is finalized and all the investors have put their money in?",
      "start": 831220,
      "end": 838660
    },
    {
      "speaker": "C",
      "text": "The first part is securing our allocation. So typically we'll be talking to the founder. They may have already had a lead vc, lead the round and set terms. In that case, we're ready to secure our allocation and start sharing with our investors. What I would do from there is put together both my deal memo on why we're excited about the opportunity and want to invest and set up the SPV in parallel. This is typically about a two day process of putting the materials together, getting the SPV set up. Once that's complete, I will then send the deal materials to our investor base. Typically give them about one to two weeks to make their decisions in terms of capital to the particular deal in between. That one to two weeks will allow for, you know, any follow up questions. Investors might want to know more about the founder's background or their business model. You know, five years out from now and then from there, once we've got the capital committed, which again may be a one to two week period, we would then close out the SPV and.",
      "start": 838660,
      "end": 899190
    },
    {
      "speaker": "B",
      "text": "Wire capital to the company.",
      "start": 899190,
      "end": 900350
    },
    {
      "speaker": "D",
      "text": "Just explain to me how the business model works here. How does this make money for you?",
      "start": 900430,
      "end": 904310
    },
    {
      "speaker": "C",
      "text": "We make money off of what's called carried interest that we refer to as carry. What this means is if you and as investor invest in an FPV that we run after an outcome, an ipo, an exit, years later, everything that gets returned on top of the principal that you originally invested, we're going to take a 20% carry of those returns. So you would get 80% of the profits. So in short, I only make money if I return capital to my limited partners.",
      "start": 904310,
      "end": 933340
    },
    {
      "speaker": "D",
      "text": "The investment world has some big numbers for what you're investing in. What's the typical ROI for these investments?",
      "start": 933340,
      "end": 938130
    },
    {
      "speaker": "C",
      "text": "The venture capital asset class is high risk, high reward.",
      "start": 938520,
      "end": 941840
    },
    {
      "speaker": "B",
      "text": "Right?",
      "start": 941840,
      "end": 942120
    },
    {
      "speaker": "C",
      "text": "This is quite different from public markets. When you're investing in early stage startups, you're really trying to identify one or maybe a couple big winners. And when I say big winner, I mean, you know, 50, 100, 250x ROI on your investment and that company is going to make up for the other 10, 20, 30, 50 losers that you may have invested in in order to be a good early stage investor. You have to do a lot of deals, you have to diversify. It is really about finding that. That big winner, that Uber story, that Airbnb story.",
      "start": 942120,
      "end": 972350
    },
    {
      "speaker": "D",
      "text": "So, last question we ask to all of our founders or investors. What would be your advice if you go sit on Alex's shoulder five years ago, and what would you say?",
      "start": 972350,
      "end": 981910
    },
    {
      "speaker": "C",
      "text": "First and foremost, start building a network of folks who have unique access to deals.",
      "start": 981910,
      "end": 988790
    },
    {
      "speaker": "B",
      "text": "Right?",
      "start": 988790,
      "end": 989030
    },
    {
      "speaker": "C",
      "text": "An awesome startup in a competitive round alongside these tier 1 VCs. If you're able to access that, there will be investors out there that want to participate in that deal. Right. There's multiple ways to find them. Being able to continue that going forward enables you to build a portfolio, which is kind of a track record and a growing resume, which will enable you for multiple different directions. Right? It could be continuing the syndicate, investing in more of the best companies. It could be raising your own venture capital fund, it could be joining a venture capital fund. There's a lot of different routes that you can take, and the earlier and the faster you can do that and build a network that the quicker you'll show success in this venture capital ecosystem.",
      "start": 989030,
      "end": 1028110
    },
    {
      "speaker": "D",
      "text": "All right, thank you so much, Alex.",
      "start": 1028750,
      "end": 1031310
    },
    {
      "speaker": "C",
      "text": "Appreciate it. This was a blast.",
      "start": 1031390,
      "end": 1032710
    },
    {
      "speaker": "A",
      "text": "Thank you.",
      "start": 1032710,
      "end": 1033230
    },
    {
      "speaker": "D",
      "text": "Follow these steps and you'll invest in 270 companies in two weeks.",
      "start": 1033230,
      "end": 1037870
    }
  ]
}