{
  "source": "/home/salouri/Projects/starter_story/transcripts/Gv2fzC96Z40/Gv2fzC96Z40_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "Hi David, what's your story?",
      "start": 80,
      "end": 1440
    },
    {
      "speaker": "B",
      "text": "I was working from my parents house in the bedroom, day and night. I had no money and it was time to really, it was time to make it or break it.",
      "start": 4400,
      "end": 12880
    },
    {
      "speaker": "A",
      "text": "This is David park, and for years he tried everything to make money.",
      "start": 12960,
      "end": 18080
    },
    {
      "speaker": "B",
      "text": "I started my first company when I was 16. I'm 27 now. That's a decade of failing.",
      "start": 18080,
      "end": 23280
    },
    {
      "speaker": "A",
      "text": "Then one day he came across an idea that would change his life forever. But at the beginning, things weren't looking so bright.",
      "start": 23360,
      "end": 31910
    },
    {
      "speaker": "B",
      "text": "I cold called every single agency for eight hours a day for weeks and weeks and weeks. They hang up on you, reject you, literally probably 99% of the time.",
      "start": 32220,
      "end": 40340
    },
    {
      "speaker": "A",
      "text": "But when everything was at its worst, David experienced a miracle.",
      "start": 40340,
      "end": 44540
    },
    {
      "speaker": "B",
      "text": "Suddenly we get a huge wave of users. We're getting to 50, 60, 80,000 MRR. Then I got a cancer diagnosis and it felt like my dreams and nightmares were happening at the same time.",
      "start": 44620,
      "end": 58140
    },
    {
      "speaker": "A",
      "text": "This is the story of how David park built an AI app to a $25 million valuation in just two years. I'm Pat Walls and this is Starter story. David grew up in a family of entrepreneurs, and even though they never had a lot of money, he still had a dream that he could be one too.",
      "start": 58620,
      "end": 79740
    },
    {
      "speaker": "B",
      "text": "When I was in seventh grade, I thought, you know, man, it'd be so cool if, like, I'm a founder and it'd be so cool if I can build stuff. And so when I was 16, I actually made my first company. It was like a clothing brand. Obviously it failed spectacularly.",
      "start": 79740,
      "end": 92990
    },
    {
      "speaker": "A",
      "text": "David experienced his first failure early on, and like all protective parents, they sacrificed everything they had to send him off to a college in hopes for a better life.",
      "start": 92990,
      "end": 102750
    },
    {
      "speaker": "B",
      "text": "My parents gave me $20,000. They said, you know, you go to college, you're going to have a better life than us. You're going to go be a lawyer, doctor. The sad thing is I kind of felt like I didn't really fit in anywhere. I didn't really feel it fit in in my fraternity. I didn't really feel it fit in with like the people in my major. I was always surrounded by people, but I always felt like a little bit lonely, which is kind of sad.",
      "start": 102910,
      "end": 122950
    },
    {
      "speaker": "A",
      "text": "David was facing a dilemma. He was an entrepreneur at heart, but he was trapped in an environment that didn't make him happy. So he made a huge decision. He decided to drop out and chase his dreams of starting a startup. And luckily I. Along the way, he meets someone just as weird and passionate as him. His eventual business partner and co founder, Henry.",
      "start": 123270,
      "end": 144760
    },
    {
      "speaker": "B",
      "text": "He loved AI, I loved writing. We always try to find some way to make it work. The sum total of failed startups that we did together was probably nine or ten, which is pretty nuts. Eventually we stumbled upon GPT2. We asked it to tell us a story. GPT2 spit out this line that said nothing is darker than a butthole. And obviously as two people enamored with this tech, we were raving. We're like, this is the funniest line ever. Also, it's profound. That butthole sentence convinced us. Two buttholes to create Jenny. Alright, so this is a quick product video for Jenny.",
      "start": 144760,
      "end": 178010
    },
    {
      "speaker": "A",
      "text": "The boys had found their idea and now the business was in motion. Henry would do the coding and David would do the selling. Their goal was simple. Create a product to help agencies write better content with the help of AI. And their next goal was to make their first dollar.",
      "start": 178010,
      "end": 194390
    },
    {
      "speaker": "B",
      "text": "That was like a terrible, painful time of cold calls. Obviously nobody wants to talk with you. They hang up on you, reject you. You have to get used to getting rejected. So I was working from my parents house, just in the bedroom. It was pretty sad. My mom, she would wake up and then she'd hear me just like raving to some poor soul about why they need to invest in us or they need to buy us. And then she'd go, before she'd go to sleep, she'd still hear me kind of speaking to some other poor fellow. So I was like pretty much just working day and night. The worst part was like Korean moms would just get together and just talk about their kids like their trading cards. Like my kid is Now a level 2Amazon engineer, my kid is now doing their masters at Stanford. And then it would get to my mom's turn and she would just say, oh, my son is working on a startup. The most humiliating thing was I had to ask my mom for her card if I wanted to get Chipotle because I just had like no money. I was a real loser. But my parents were so kind to me like they never made me feel like a loser. Like they would always, they would always give me food and they'd never make me feel bad about. They never, they never. So they never make me feel bad about anything. They just always like there's always just food on the table. On days that I didn't believe in myself. I felt like my parents believed in me, my co founder would believe in me, my friends obviously believed in me. So it was painful. But I guess I'm glad that I went through them.",
      "start": 194470,
      "end": 291920
    },
    {
      "speaker": "A",
      "text": "Yeah. In 2020, GPT3 came out. David is getting some traction thanks to a wave of businesses wanting to get their hands on AI. They're getting users, but eventually they hit a plateau. They try everything, but they can't get past $2,000 a month in revenue. Then David learns and implements something that would change his business forever.",
      "start": 291920,
      "end": 317810
    },
    {
      "speaker": "B",
      "text": "It really came down to the boring stuff of just talk to your users, ask them more difficult questions. You know, you shouldn't be asking, why do you like my product? You should be asking, why do you dislike my product? Like what? Like what do you love about other people's products? The focal point of I feel like many founders when they talk to users is like, they make it about themselves and their product when it should really be about the users. Tell me about your current workflow. How does Jenny fit into it? What exactly do you do with Jenny? Or like, can you share your screen and can we write an article together? These insights are really important. We realized that people wanted to have a friendly AI assisted writing journey. And so when we pulled out everything, that was when we really started to grow.",
      "start": 317970,
      "end": 353920
    },
    {
      "speaker": "A",
      "text": "After months of talking to customers and refining the product, they start to find a new audience for Jenny. But at this point, David basically has $0 left in his bank account. He's exhausted all of his options. But he decides to try one more thing. He agrees to go on a random podcast to talk about his startup journey.",
      "start": 354000,
      "end": 375320
    },
    {
      "speaker": "B",
      "text": "It doesn't have that many listeners, but luckily Dave, one scout for Jason Calcanis, happened to listen to the podcast the Craziest Miracle ever because, like, it was not viewed by many people. And so I got a hundred thousand dollar check from Jason. Like I said, I was living off shin ramen and, you know, whatever my parents put out on the dinner table. So $100,000 was so crazy. The first thing we do is, my co founder and I, we book a flight to Malaysia because at the very least, it'll cut down our burn by 1/4. We basically just wanted to extend our Runway because we kind of didn't trust ourselves with the money. It was a crazy moment getting the check, but I didn't feel successful at all because now the real job of getting my hands dirty was actually getting started. I kind of raved earlier about, like, how much I love my family, but I was alone by myself. It was very productive, but it was very lonely. It was tough. It was character building, I would say. I had a 100k check. I was completely by myself. It was. It was time to make it or break it.",
      "start": 375320,
      "end": 431190
    },
    {
      "speaker": "A",
      "text": "Now the real dirty work had begun with a bit of funding and a tiny Runway. David and his co founder spent the next several months iterating and building Jenny into a completely new product, talking to customers, documenting the progress, and trying just about anything to increase revenue. Then one night, something incredible happens.",
      "start": 431270,
      "end": 452470
    },
    {
      "speaker": "B",
      "text": "Suddenly we get a huge wave of users. Every minute I refreshed the page, I think we would get tens of new users every minute that I refresh the page. A guy named Zain Khan posted a Twitter thread that became one of the most viral Twitter threads in history. And we were actually included in that thread. From there, we went from like 2000 to 10,000 mrr in one month. That's when I felt the first semblance of success.",
      "start": 452790,
      "end": 476470
    },
    {
      "speaker": "A",
      "text": "Jenny AI was growing at a rapid pace and David felt like he was on top of the world. But there was still a problem. Virality comes and goes. It's not something David could rely on to build a great business.",
      "start": 476630,
      "end": 488160
    },
    {
      "speaker": "B",
      "text": "So the very next thing I want to do was kind of figure that out for ourselves. I brought on one of my college buddies, actually, to help us with TikTok and Instagram Reels, all that jazz. And then we experienced our second wave of virality. We understood the power of social media. We continued to kind of push on with viral marketing. We were getting to 50, 60, 80,000 MRR. You know, now it was kind of happening where I think at that point we were close to like a million a year from where we started. That was like so crazy to. And I felt like, man, we could push this so much further. We could go so much farther. But then I got a cancer diagnosis and it felt like my dreams and nightmares were happening at the same time. The most worrying thing for me, though, is that it would put me out of commission and there was a chance that my voice would be damaged. I remember the surgery because of the fever, they had to reschedule me, which made my sleep deprivation, food deprivation, all that even worse. It prolonged my pain more. But one thing that helped was my mom told me that there's something I. I'll tell you before your surgery. And don't worry, it's going to give you all the strength you need. You're not even going to be nervous. Everything's going to be fine. And then so for some reason, my mom went to the bathroom or something while I was taking a nap. And like, the nurses run in and they're like, because of your fever complication, we have to do surgery right now. I don't even speak Korean to be signing documents like, can we wait for my mom? And then they're like, we just got to run it now. And I was honestly thinking about, like, man, I got a crazy startup right now. I can just bolt out of here. Thyroid cancer moves kind of slow. Like, it's not, like, the crap. Craziest risk I can take. But I remember on the ceiling, there was a Bible verse. It said, like, leave everything to God. I was like, all right, well, I'll leave it up to the big man upstairs. Like, I. I have to get the surgery, so I'll just stay. I don't know what I just signed. My mom's not here. It's fine. I'll just stay. The surgery went well. I was able to not speak for a little bit, but I was able to get my voice back. A few days after the surgery, I was like, hey, mom, like, what was that thing you want to tell me before the surgery? She told me, oh, it's just. It's dumb. It was just this one Bible verse that I really liked, and it happened to be the same Bible verse that was on the ceiling. It was pretty crazy to me where I take it as is, like, miracle. What an awesome little blessing that I got. I had to read that. Somebody had to tell me that. And my mom was in the bathroom, so I didn't get. She didn't get to read it to me. But thankfully, that painter put it up there for me, so I got to read it. After the surgery, I was obviously very emotional. I was very moved by the love that I received from, like, my family, my girlfriend. And I thought the limited time I have left was, like, my family, my grandparents, all that stuff. But instead, I'm. I'm spending so much time on my startup. Like, so much time. So I actually shopped Jenny to, like, if people would be open to acquiring Jenny at that point.",
      "start": 488560,
      "end": 639970
    },
    {
      "speaker": "A",
      "text": "David was facing a wave of problems after his surgery. He realized that the business was unstable without him leading the pack. After seeing no growth when he was out with cancer, David also realized that Jenny did not have product market fit. So he had a tough choice to make. Either cash out, grab a quick few million bucks, and start fresh, or double down, find ways to fix the business, find product market fit, and take things to a whole nother level.",
      "start": 640050,
      "end": 670560
    },
    {
      "speaker": "B",
      "text": "It just didn't feel right to, like, throw my cards in early. You know, it wasn't like a triumphant, I will not sell this. It's sort of like, I don't know if this is the right decision, but it just feels right in my gut that one hard decision I made. I'm very proud of myself. From then I focused on hiring people on the marketing growth side and we went into more scaling mode, I would say up to the 1 million. We're doing a lot of exploring, trying out a bunch of zany ideas, a bunch of paths, and then from one to three we really started heavily deploying capital in the ones that were successful. Tactically. What I would do is I would basically start a TikTok account, try a bunch of different creative formats and then find one format that works and somehow turn that into a series and then start multiplying their accounts so you could have multiple creators. You're basically paying creators like some baseline monthly salary and you're giving them some incentives where like if your videos get X many views or if you get Y conversions, then you get, you know, even more money per month. You should basically just think about how can you scale the content. I think that's like the big question you should ask. I started my first company when I was 16. I'm 27 now. That's a decade of failing. I really only got any semblance of success in the last 18 months. So it's nine years. Almost a decade of just gut punches, people not taking you seriously. You need that discipline. I think if you really care about your dream and if you really care about making something that is used by millions of people, then you can't give it like a one week shot. You can't get, you can't even give it a year shot. You have to really put your all into it. Sacrifice everything for many, many years and then you have a shot, you have maybe a chance at success. But even if you put your all into it, there's a chance that you will fail. If you still make a startup and if you still try despite knowing that you could have nothing and you could lose everything, then that must mean that you really care about what you're building and you really care about making a better life for yourself, your family, your users. We talked about quitting earlier. Had I sold then, which was earlier this year, it was only like six, seven months ago, you know, it would have been such a terrible decision for me to sell at that point because we went from selling to 3 million. Now we're at 3 million ARR. We're above 3 million ARR. The true worth of our startup now is probably like 10 to 30 million. You know, it's like, it's like way more than what I would have sold for then within six months we more than doubled our business. Yeah, persistence is quite important, I would say.",
      "start": 670720,
      "end": 800600
    },
    {
      "speaker": "A",
      "text": "Hey, Pat from Starter Story here. Thank you guys so much for watching. I really hope David's story inspires and motivates some of you to get started on your own thing. As you saw in the video, if you David changed his life by turning a simple idea into a $3 million per year SaaS product. If you're curious about doing something similar but you're still looking for an idea, well, right now you can download our deep dive SaaS report for free. It breaks down 52 different micro SaaS ideas and tons of other stuff you'd want to know. Just click the first link in the description and if you're serious about building it, then consider joining Starter Story and we'll help you do that. Much love and I'll see you guys in the next one. Thanks. Peace.",
      "start": 801480,
      "end": 841170
    }
  ]
}