{
  "source": "/home/salouri/Projects/starter_story/transcripts/yue9in5oh64/yue9in5oh64_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "I've just built an AI resume builder as a side project that is currently doing, in its second month, about $20,000 a month.",
      "start": 240,
      "end": 8000
    },
    {
      "speaker": "B",
      "text": "How does this guy make $20,000 a month from a simple website? Well, it's because of two letters, AI.",
      "start": 8240,
      "end": 15280
    },
    {
      "speaker": "A",
      "text": "Right now you can get OpenAI credits dirt cheap. And I don't think it'll be like that forever.",
      "start": 15600,
      "end": 21200
    },
    {
      "speaker": "B",
      "text": "But there are plenty of AI apps out there that don't make any money. So I had to give Colin a call to see actually how he grew this thing to $20,000 a month. Turns out there is just one very specific thing that gave him this advantage. In this video, Colin breaks down his unique AI business blueprint, including how to find and validate an idea using AI, the launch strategy that made him $1,000 in his first week, and the hiring strategy he uses to scale this side project on Autopilot.",
      "start": 21280,
      "end": 54140
    },
    {
      "speaker": "A",
      "text": "This is not my full time job. I have built this to scale without me.",
      "start": 54140,
      "end": 58540
    },
    {
      "speaker": "B",
      "text": "Now let's dive in. Hi, I'm Pat Walls and this is Starter Story. Welcome back to Starter Story. Colin, tell us about who you are and what you built.",
      "start": 58860,
      "end": 71250
    },
    {
      "speaker": "A",
      "text": "Yeah, so I'm Colin McIntosh. I am founder and CEO of a company that some people probably have heard of because I've done a starter story before with it called Sheets and Giggles. But funny enough, I'm actually here to talk about sheetsresume.com which is an AI resume builder that I created with a friend. It's $99 for lifetime access, $21 week access. In our second month of business, we did $20,000 of sales. That's nearly 100% margin as well. So it has been extremely rewarding for me already as a side project. And I am really thrilled to be helping as many people out as I am.",
      "start": 71730,
      "end": 109790
    },
    {
      "speaker": "B",
      "text": "Wow, so you built this AI tool to $20,000 a month in just two months as a side project. That's very impressive, man. Tell us now why building an AI business right now is such a massive opportunity.",
      "start": 110510,
      "end": 123790
    },
    {
      "speaker": "A",
      "text": "So the cool thing about AI is I don't have to code to teach the AI, nor do my developers. A resume review probably would take me three hours, I would say to do. But now I can do 20, 30, 100, a thousand resume reviews a day with this AI that I built for a fraction of the price. And infinitely more people will be able to use my service and my advice than were. So the one thing I wish I could do differently about Sheets and Giggles is, is not start the company in 2017 and start it in 2024. It has never been Easier for someone to start a business. But I would recommend that people, like, move very quickly because right now you can get OpenAI credits dirt cheap. And I don't think it'll be like that forever. They're just doing user acquisition right now on their end.",
      "start": 124260,
      "end": 169910
    },
    {
      "speaker": "B",
      "text": "Clearly right now is the best time to be building in AI. And like Colin said, this opportunity will last forever. If you're anything like Colin and you want to take advantage of this opportunity and start making money with AI right now, then to the first link in the description to get this free list of 200 plus AI money making ideas. This is the easiest way to find an idea for an AI business, especially if you don't know where to start or what you should build. It includes a bunch of unexplored ideas, the niches they serve, and even how you can get started on those ideas right away. I personally found the how to get started section really helpful because it gives you something that you can act on right now. Just head to the first link in the description to download it for free. This list was made by HubSpot, which is today's video sponsor. A big shout out to them for this free resource. HubSpot is awesome. That's crazy. I mean, all this AI stuff is just nuts. But what I want to know is a little bit more about how you got into resumes and entrepreneurship. Can you tell me a little bit more about your backstory?",
      "start": 170310,
      "end": 231469
    },
    {
      "speaker": "A",
      "text": "Yeah, yeah, sure. So I started my career at the world's largest hedge fund, a place called Bridgewater Associates in Connecticut. I got fired in five months. Ended up getting hired as a recruiter at the company that hired me at Bridgewater. And I adored recruiting and I just had such a strong affinity and natural talent for it. And around February 2018, I was just on Reddit. Somebody had posted their resume and I gave them a bunch of feedback and I was like, babe, this is wrong, this is wrong. You're not going to get a call back with this. Like, you got to change this up. And I got like 500 upvotes and then I got a bunch of people replying to me being like, you know, hey, can you, can you look at my resume? Like, can you please check this out? That was kind of one of my first moments where I was like, man, no one knows how to make a good resume.",
      "start": 231790,
      "end": 276940
    },
    {
      "speaker": "B",
      "text": "Okay, so you find out that the common knowledge that you have about resumes isn't really common. But what happens after that?",
      "start": 277260,
      "end": 284060
    },
    {
      "speaker": "A",
      "text": "I just sat down and I wrote out a whole long resume guide of do's and don'ts. And that post on Reddit blew up so much that it is now the first result on Google for resume advice. Reddit, it was the top post on the job subreddit for like years. And over the last six years, since 2018, I've given away so much of my time and energy answering questions on this Reddit post that continue to flow in. I'm talking probably 20,000 questions that I've gotten over the last six years from people. But then last year I asked my friend Nate, my old recruiting partner who hired me at my first job, do you have time to do resume reviews for people? Because it's just like the matrix for us. Like we can just see a resume and know what's wrong with it. So we started doing resume reviews for like a couple hundred bucks. The demand was out of control. I didn't have time for all the people that we could help raise our price to 300, then 400 bucks and eventually get to the point where I was not comfortable raising the price anymore because there are so many people that are going through this time in their life and they don't have the cash that one day earlier this year, Nate said, hey, why don't we build like an AI version of this? You know? He's currently a software engineer at eventbrite. Took about 4 months for him to build it. I just gave him kind of my UX notes and what I think it should look like. I trained the AI on like, my rules for a resume and we launched it August 26th of this year. And within one week we had gotten our first $1,000 day.",
      "start": 284460,
      "end": 372250
    },
    {
      "speaker": "B",
      "text": "That's awesome. So basically you just took the skill that you already had and you turn it into a $250,000 per year business with the help of AI. Let's now talk about how our viewers on Starter Story could do something similar. How can anyone get started with an idea for such a business?",
      "start": 372810,
      "end": 388890
    },
    {
      "speaker": "A",
      "text": "So I do think that the question that people should be asking themselves is like, what do I do better than anyone else in the world? And then just help people, like put good things into the world that are helpful for free, for the purpose of being helpful. Prove out that you're solving a person's problem. Especially if you can prove out you're solving a lot of people's problems, then eventually you can monetize solving that problem. If you help people in something that you're good at, you're going to build that incredibly strong, trustworthy reputation that you're going to carry for the rest of Your life.",
      "start": 389710,
      "end": 424020
    },
    {
      "speaker": "B",
      "text": "Gotcha. So get good at something, start helping people with that thing and eventually they'll be willing to pay you for it. Once we've done that though, how do we go from zero to one in terms of actually building a product?",
      "start": 424420,
      "end": 436580
    },
    {
      "speaker": "A",
      "text": "How do you get going from zero to one? Well, first validate the idea by doing it for people in a way that either isn't for sale or doesn't scale. And then you can build a brand identity map to understand what the brand will look like, how it will talk to people, how it will engage with people, what the value propositions are, the demographics that you're going after. That's the document that I recommend everybody do. First is a brand identity map. And techstars actually has a wonderful one for free. Then I would probably build out a business plan. So like a little two pager about what you want to do, why it's different than the products already on the market, maybe five or six or seven points of differentiation, and really flesh out the business idea on a two page piece of paper, then people should not use AI for any of this shit. Any of it should not do that.",
      "start": 437060,
      "end": 479910
    },
    {
      "speaker": "B",
      "text": "All right, so once we have a clear understanding of how the business is going to look like, how do we actually build it? Since you're not a technical person yourself, how did you manage to get a software engineer as a co founder on board?",
      "start": 480310,
      "end": 492150
    },
    {
      "speaker": "A",
      "text": "You're not going to ever convince some random software engineer to work on something with you that is like your idea without paying them a lot of money. Nor should they. I'm 34 years old. I've been working like a dog since I was 22. By the time that it came time to build this, whether it was working with Nate one to one for years and staying in touch over the last decade where we haven't worked together, or it was all the Redditors, I've helped out one to one. And in fact Nate and I found a third partner in the business from Reddit. I split this three ways with these two other guys. I just give them the features and the notes and the things that I want to build and my vision. And I cannot tell you how freeing it has been for me in my time. I probably spend five hours, 10 hours a week maximum on this project. So that that would be my best advice is like, work your ass off, be kind to people, be the business partner that you would want to work with. And then eventually you're going to find someone who wants to build something really, really special with you. If you're not A technical founder.",
      "start": 492630,
      "end": 548680
    },
    {
      "speaker": "B",
      "text": "That's, that's really good advice. After you guys built Sheets Resume, how did you launch it and make that $1,000 in its first week?",
      "start": 548920,
      "end": 557480
    },
    {
      "speaker": "A",
      "text": "So initially we launched it for free. We just wanted to see if people would use it. I edited into my, my post, I said, hey, there's this new builder we built and I'm really proud of it. And we were blown the fuck away by the usage statistics I think we built in the first like week. I don't even know how many thousands of resumes for people for totally for free. And it was like this huge boost of word of mouth where people were just like, immediately, this is amazing. Tell everybody about this. We turned on pricing, I think a week in 99 for lifetime access seems to be the sweet spot for people. And then we have a $29 one week option for people that are just like, hey, I just need this as I'm starting my job search. But we also don't want to do monthly subscriptions because I do find that predatory. And we want to make sure that we're not taking advantage of anyone during a hard time in their life.",
      "start": 557880,
      "end": 611720
    },
    {
      "speaker": "B",
      "text": "Awesome. So you launched Sheets Resume, got a bunch of free users and some paid ones after you turned on the pricing. But how did you end up making $20,000 in the second month of running the business? What user acquisition channels worked best for you?",
      "start": 612040,
      "end": 626470
    },
    {
      "speaker": "A",
      "text": "So the beautiful thing about this is that it's not about the money, it's about like helping people on this journey. And if you get helped on your way by somebody in that really personal one to one way, whether you got a refund or you got it for free from me, or you just really loved it when you bought it and you're like, this is amazing. That word of mouth is huge. It's so invaluable. So to that end I've said, okay, what other things can I do to get word out about this resume builder that are going to scale without my time? First and foremost, we just hired an affiliate marketing agency. I did set up some rudimentary Google Ads, like a training mechanism for Google's algorithm and then the organic traffic. I've got multiple posts on Reddit, how to build a Resume, the top 10 questions I get during a job hunt, how to interview, how to negotiate salary. That's like a big SEO hack is like just piggyback off of Reddit's incredible SEO. And you can link to your products or to your company somewhere in there, but it should not be the front and center call to action because then people will be suspicious of your intentions. Then they may not, you know, react as strongly as they should to like what is valuable content. So you have to want to help people and they have to believe it.",
      "start": 626950,
      "end": 705170
    },
    {
      "speaker": "B",
      "text": "I love this approach. Now let's get a little bit more technical. What's the tech stack you've been using to build this business?",
      "start": 706040,
      "end": 711720
    },
    {
      "speaker": "A",
      "text": "So the stack that we're using is OpenAI Gemini. It's a PHP app built with the Laurel framework, Rest API and that sort of thing. So aws it's not overly complex. And then we just use Gmail, Stripe for payment processing, Mercury bank for banking and I mean, yeah, it's not an overly involved company. This is like my mission to give back and help people. It is so damn fulfilling. Dude gets me out of bed in the morning.",
      "start": 712360,
      "end": 740420
    },
    {
      "speaker": "B",
      "text": "Nice. Awesome. Are there any other tools that you'd recommend for founders?",
      "start": 740660,
      "end": 744180
    },
    {
      "speaker": "A",
      "text": "There are more tools available for solopreneurs and entrepreneurs than there ever have been. Get an AI chatbot for your website that reduces customer care tickets and increases conversion. Plug into AI customer care services. Do AI image and video content generation. Do long form videos like this and then feed them to an AI and chop them up in 10 or 20 second interesting blocks. But go do it now because these tools are the lowest they're ever going to be. And so I hope more people see this and they're like, shit, I'm going to go start my own AI business or my own. My own thing that I can scale.",
      "start": 744420,
      "end": 778150
    },
    {
      "speaker": "B",
      "text": "I love it, man. If you're comfortable sharing it. What are the profit margins for sheetsresume.com?",
      "start": 778790,
      "end": 783830
    },
    {
      "speaker": "A",
      "text": "Dude, it's close to 100% margin product. I'd say we're probably operating around 90% net margins when it comes to the sale. Just enables so much more ability to help people for free.",
      "start": 784630,
      "end": 797670
    },
    {
      "speaker": "B",
      "text": "So cool, man. Now, last question we ask all founders we interview. What would be your advice to any entrepreneur just starting out right now?",
      "start": 798150,
      "end": 806310
    },
    {
      "speaker": "A",
      "text": "Start a business. That's my advice. If you feel like you're at a point in your life where you have an expertise, you understand a problem, you think you can build a solution, you feel disillusioned with working at a large company or another company and you're tired of taking orders, I cannot tell you the value and the learning that you're going to get out of starting your own company versus staying the course. If your worst case scenario is that you're just going to keep doing what you're doing, philosophically, I would just tell you like get started, do it. It's not as scary as you think. And your worst case scenario is the one that you're already living in, which is a pretty awesome thing to say.",
      "start": 806790,
      "end": 842400
    },
    {
      "speaker": "B",
      "text": "Start the business as Collin said, the worst case scenario is that nothing happens and you're still in the same spot as before. You don't need thousands of dollars or an entire dev team, you just need an idea and action. I appreciate all of you for watching these videos and hopefully they continue to inspire you. But watching is not as valuable as doing. Action is the thing that's going to get you to the position that you actually want to be in. A position of freedom. Freedom to work on the things you enjoy and make a living while doing it. But if you're still struggling to take action or you don't know where to start, then I highly recommend that you check out the Starter Story Academy. It's the community I wish I had when I first started and it's got a roadmap to help you find an idea, build it, get those first users and make those first few dollars. Just head to the first link in the description if you want to learn more about it. Much love and I'll see you guys in the next one. Peace Sat.",
      "start": 843200,
      "end": 908609
    }
  ]
}