{
  "source": "/home/salouri/Projects/starter_story/transcripts/mjCa8IFjM2E/mjCa8IFjM2E_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "When I started AI Korea, which is at 8000 Mr. Currently, I was still an employee at IBM.",
      "start": 240,
      "end": 7040
    },
    {
      "speaker": "B",
      "text": "How did this girl build a $100,000 per year AI app while working a full time job? Well, it's because of how she's growing it.",
      "start": 7040,
      "end": 14920
    },
    {
      "speaker": "A",
      "text": "To find customers online, you have to think about where your clients are.",
      "start": 14920,
      "end": 19440
    },
    {
      "speaker": "B",
      "text": "Pauline spent her first few years as a part time indie hacker building side projects but not seeing much success. Then after several failures, she found a winning idea in one of the hottest yet most saturated industries right now, AI apps. But it turns out there's still plenty more opportunity than you might think.",
      "start": 19760,
      "end": 40440
    },
    {
      "speaker": "A",
      "text": "I think the biggest opportunities might be to.",
      "start": 40680,
      "end": 43640
    },
    {
      "speaker": "B",
      "text": "I spent over an hour talking to Pauline about her AI business and what I really tried to figure out was how she was able to succeed in such a crowded market. Good news is she shares everything, how to find good ideas, her framework for marketing and AI tool, and some unique ways to reduce churn for your users. All right, let's get into it. I'm Pat Walls and this is Starter Story. Welcome Pauline, thank you for coming on. It's great to have you. Tell me about who you are and the business you built.",
      "start": 43800,
      "end": 77910
    },
    {
      "speaker": "A",
      "text": "Hi, I'm Pauline and I built AI Kreia. It's a service to renovate home in. Second, thanks to AI, you just upload a picture to the service, you select a style and a few seconds later you see your kitchen in a very modern or Scandinavian way. AI Kria has more than 8,000 users right now. It makes around €8,000 every month on the business model. When someone sign up to the SaaS, they have free trials and then they are required to pay to continue to use the service. Pricing models is a one time payment with a certain number of photos and you also have a monthly payment with some extra features.",
      "start": 78150,
      "end": 118590
    },
    {
      "speaker": "B",
      "text": "So you built this $100,000 per year app while you had a full time job. Tell me more about that.",
      "start": 119070,
      "end": 124030
    },
    {
      "speaker": "A",
      "text": "I learned to code in engineering school. After college I joined IBM and after this I kind of switched and I said okay, data science is not what I want to do all my life. What I want to do all my life is entrepreneurship. But I wasn't ready to make a big jump of becoming an indie hacker because I needed money as well. When I work at IBM I had only the night and weekends. I stopped IBM in June two months ago. I think it's really different when you are working on a day job or you are Hindi hacking full time.",
      "start": 124510,
      "end": 161340
    },
    {
      "speaker": "B",
      "text": "Wow, that's amazing. So your side project allowed you to quit your 9 to 5. You and now you're a full time founder. What I want to know is how do you come up with ideas?",
      "start": 161900,
      "end": 171520
    },
    {
      "speaker": "A",
      "text": "I think I usually find ideas when I encounter some problem, either me or friends. When it's friends, like for a career, I ask questions, a lot of questions. Really, you have this problem, but when, how frequent you have this problem. I really think, am I able to do better? Am I able to build something around it? Am I able to monetize it and to find clients? That's really important creation. And if the answer is yes to everything, I start working on it.",
      "start": 172080,
      "end": 202230
    },
    {
      "speaker": "B",
      "text": "Okay, cool. So we talked about ideas, we talked about problems. My question is, once you find that idea, how do you validate that it's an idea worth building and that it can make money?",
      "start": 202550,
      "end": 212150
    },
    {
      "speaker": "A",
      "text": "I start some marketing or I start to communicate on my product. If I have some client kind of quickly, then I said, okay, maybe there is something that I could do around it. Like for AI career, I build an MVP and then I show it to a few real estate agents that I found online or in personal network for people that said, that's awesome, I want to buy it now. And they actually paid for this. So that was the validation.",
      "start": 212390,
      "end": 239250
    },
    {
      "speaker": "B",
      "text": "Okay, so get your MVP out there, see if people are interested. That is the way to build. But can you tell me a little bit more about what it looks like to actually create that mvp?",
      "start": 239410,
      "end": 248570
    },
    {
      "speaker": "A",
      "text": "My opinion, the sooner you ship, the better. Because sometimes you imagine your clients want this, but what they actually want is this. So it's really hard to imagine what your clients want. If you don't have clients when you start, don't expect everything to be perfect. AI Kreia, for instance. MVP was a simple feature, bad quality. It was done maybe in a month, but then it's a year of work to improve it.",
      "start": 248890,
      "end": 273370
    },
    {
      "speaker": "B",
      "text": "Pauline is the perfect example of how one person can turn a simple idea into thousands of dollars, even while working a full time job. And her blueprint was simple. She found an idea, she built a really simple MVP and then she validated that it could actually make money by getting it in front of her actual customers. That final step is where almost everyone goes wrong. And this is why we built the Starter Story Academy. It's a five week program where you'll come up with an idea, you'll build something simple, and then you'll spend all your time focused on validation and if this thing can actually make money. Inside the academy is a clear and actionable track you can follow with milestones, deadlines, and it's all gamified to get you to take action and work on the things that matter. This is not just another course. This is the turning point in your journey. Imagine what you could accomplish in five weeks if you simply worked on the right things. What's even cooler is that you'll do it inside our community of thousands of successful founders working on similar problems and building online businesses that will change their lives. So if you're serious about actually doing this thing and you're ready to take action, I'm going to leave a link in the description where you can learn more. Okay, so we build the mvp. How do we go and actually find customers?",
      "start": 273740,
      "end": 352100
    },
    {
      "speaker": "A",
      "text": "To find customers online, you have to think about where your clients are. You have many social media like for instance Facebook or LinkedIn or Reddit. Go through them and just type in the search bar like you are looking for real estate agents. Type it in LinkedIn. Let's see if you can find some communities on it. For instance, AI Korea. My best marketing channel is probably Facebook and physical event maybe because real estate agents, it's really an activity of human. But for Next JS Directory, my main marketing channel is Twitter because I have big audience there and my audience is mainly developers or people who want to do handi hacking. So. So this product really is a fit with them.",
      "start": 352500,
      "end": 398990
    },
    {
      "speaker": "B",
      "text": "Okay, so the best places to market our products are where our customers hang out. Right? But what if we want to accelerate that growth at the very beginning? What are specifically some good places to launch apps as a solopreneur?",
      "start": 399150,
      "end": 411870
    },
    {
      "speaker": "A",
      "text": "Now I prefer to launch a product hunt in order to get a backlink for SEO because it's a very good backlink but the visibility is less good than it used to be. So I'm launching on product hunt and also on Twitter because I have a big audience there. Probably I will use my newsletter as well. I didn't launch Next JS Directory on Facebook, but I launched KRE on Facebook.",
      "start": 412030,
      "end": 435930
    },
    {
      "speaker": "B",
      "text": "All right, so now you got people interested in the product. The next thing I go to is how to monetize it. How do you determine plans and overall pricing strategy for an app like yours?",
      "start": 436490,
      "end": 447050
    },
    {
      "speaker": "A",
      "text": "If you sell for low price, you have an image of being low cost. You don't have the same client. By selling low cost to high cost and also by selling higher price, you might have less clients, but it's less support as well. So you have to also think about how you want to be perceived and how much support are you able to deliver as well.",
      "start": 447370,
      "end": 470260
    },
    {
      "speaker": "B",
      "text": "Okay, let's talk about business models. Do you prefer a recurring subscription or one time payment I'd love to hear your thoughts on this.",
      "start": 470420,
      "end": 477700
    },
    {
      "speaker": "A",
      "text": "I like to offer both subscription and one time payment because some people really don't like subscription. I had a few subscriptions in many services and it was a nightmare to cancel. I don't like this kind of retention. My button is very clear. When you subscribe you have it canceled and it's really easy. I think it's really important to earn trust from your customer as well.",
      "start": 478350,
      "end": 500990
    },
    {
      "speaker": "B",
      "text": "Alright, I love it. Besides building trust with customers, are there any other hacks to reduce churn or just increase revenue in general?",
      "start": 501310,
      "end": 508910
    },
    {
      "speaker": "A",
      "text": "Last year I had a high churn and I really reduced it like drastically by adding yearly plan. It sounds stupid but now they are engaged for a year so they will use the service better. The second one is I did a free trial so now people can try before subscribing. They are able to see if the service fits their needs. And the third point is I really improve the service. Like the quality. It's much better than last year. It feels really like a photo.",
      "start": 509630,
      "end": 539950
    },
    {
      "speaker": "B",
      "text": "Okay, and what's the tech stack you use? How do you stay up to date with AI and run your business profitably?",
      "start": 540670,
      "end": 546830
    },
    {
      "speaker": "A",
      "text": "I use Discord every day to talk with my co founder and people working with us. I use Krisp for the support clients so they can chat with us through the chat window. I use Twitter a lot to share my journey to share what's new on AI. Kriya, LinkedIn as well. I'm starting to use it. I use also Buffer to schedule my tweets, Beehive to send my newsletters. But I'm still on the free trial on this one. Brevo for the marketing automation of emails. The database authentication is Supabase but this is more like a technical tool I guess. I mainly use Next JS as a language but for AI models I use Python. I think my business cost around 3 or €4,000 to run each month. But it includes servers, it includes some marketing like we run ads sometimes. Also it could be the cost of a freelancer and going to personal events. I could cut some cost but for the moment I'm not trying to save the most money. I'm trying to invest in order to grow the business.",
      "start": 547230,
      "end": 618230
    },
    {
      "speaker": "B",
      "text": "Okay, tell me about the biggest opportunities in the AI space right now.",
      "start": 618710,
      "end": 624470
    },
    {
      "speaker": "A",
      "text": "I think the biggest opportunities might be to insert AI in existing product. You receive email every day. What if you have an AI that can help you to answer to your email? This is a service plugged in another one and that's something that could do because biggest opportunities I think is service.",
      "start": 624630,
      "end": 647630
    },
    {
      "speaker": "B",
      "text": "Got it. Okay, another question for you. Since the space is heavily dominated by dudes, how does it feel for you to be a successful girl indie hacker?",
      "start": 648270,
      "end": 656840
    },
    {
      "speaker": "A",
      "text": "Yeah, I don't know why, but girls are not visible. They are not doing much indie hacking. So please don't retain yourself if you are a girl to think, oh, but there is only men. It's not for me. No, it's for you as well. If you enjoy coding, if you enjoy sass, please do it. I think it's really important also if you are a girl to be visible because you will inspire other people to do the same. Don't hide yourself or return yourself from building if it's something that you you want to try.",
      "start": 657480,
      "end": 688600
    },
    {
      "speaker": "B",
      "text": "All right, last question that we always ask all founders when we interview them. If you could stand on a younger Pauline's shoulder and give her some advice, maybe when you were just starting out, what would you tell her?",
      "start": 689080,
      "end": 700920
    },
    {
      "speaker": "A",
      "text": "Okay, so if you want to start in the haking, please don't wait for the perfect product challenge. Just start to do something because it's highly likely that your first product will fail. I don't know any entrepreneur who achieved success at the first time. So you will learn a lot during the journey. So please chip very fast launch when you have an MVP and ask for a lot of feedback and be consistent and also I think make connection with people who are doing indie hacking. We exchange best practices, we exchange stuff, tips, we exchanged some things that didn't work in order to improve us. And my biggest lesson was I think it was to invest in yourself. You are the common point of every project that you build and think about how you can reach your customers. Don't think like, oh, okay, could do some Reddit message or discord message or DM people. I mean, think about really how you could build genuine connection to your customers.",
      "start": 701000,
      "end": 765110
    },
    {
      "speaker": "B",
      "text": "Thank you for coming on the starter story channel, sharing everything you know and inspiring millions of people to start their own business. See ya yo guys. I really hope you enjoyed the video and got some good nuggets with Pauline. I think the business that she built is really impressive and I really like the way that she went about building it, talking to customers, and actually building something that people needed. But I want to say something real quick at the end of the day. The purpose of this video is to show you that regular people like Pauline change their lives by building a business. But watching this video is not going to magically give you a business that changes your life. You need to go find an idea. You need to take action and you need to work relentlessly to validate it and see if it's something that can actually work. While learning is important, action is the thing that's actually going to get you your dream outcome. So if you feel like you're still struggling on this, maybe some analysis paralysis, not exactly sure what to work on, then I highly recommend checking out the starter story Academy. Again. It's not for everyone. It's only if you're really serious about actually doing this thing, actually building a business while you have a full time job that could change your life Inside the academy, you'll get an actual blueprint to follow every day. It will give you the right habits but most importantly it will put you on the path on how to find an idea, how to validate it's an idea that can actually make money and how to actually build that idea and bring it to life. Just head to the first link in the description you want to learn more. Much love and I'll see you guys in the next one. Peace.",
      "start": 765430,
      "end": 852830
    }
  ]
}