{
  "source": "/home/salouri/Projects/starter_story/transcripts/lWwZ-fsD8gM/lWwZ-fsD8gM_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "This Guy quit his $250,000 consulting job with one goal. To break free from what he calls the default path, AKA the rat race.",
      "start": 160,
      "end": 8720
    },
    {
      "speaker": "B",
      "text": "I sort of just like quit. It was the first time in my life that I just let life emerge.",
      "start": 8960,
      "end": 15080
    },
    {
      "speaker": "A",
      "text": "At 32 years old, Paul quit corporate America to build a new life. But he had no plan. So he did the only thing he knew how to do. He started writing every day. Then he discovered something that would change his life forever. He writes a. A book.",
      "start": 15080,
      "end": 31180
    },
    {
      "speaker": "B",
      "text": "The Pathless Path is really my way of making sense of my life. After leaving the Default Path, I flew.",
      "start": 31340,
      "end": 38860
    },
    {
      "speaker": "A",
      "text": "Out to Austin, Texas to meet Paul and learn more about the Pathless Path. In this video we talk about how he found his passion for writing, why he chose to self publish his book, and exactly how much money he's made as a self published author.",
      "start": 38860,
      "end": 51340
    },
    {
      "speaker": "B",
      "text": "Last year I went from grand in revenue, thousand and so far in the first six months of this year, I'm on track to sort of beat that.",
      "start": 51660,
      "end": 60580
    },
    {
      "speaker": "A",
      "text": "But more importantly, we talk about why everyone should consider exploring the pathless path.",
      "start": 60580,
      "end": 65720
    },
    {
      "speaker": "B",
      "text": "You can't actually escape work. You ultimately need to find work that can sustain your soul. And the pathless path is basically committing to that.",
      "start": 65720,
      "end": 74320
    },
    {
      "speaker": "A",
      "text": "I'm Pat Walls and this is Starter Story. Paul, I've been reading all about your story and it's amazing. You went from a job that you absolutely hated or wasn't for you, and now you've turned that into a very successful self published author. Tell me more about you.",
      "start": 74320,
      "end": 90280
    },
    {
      "speaker": "B",
      "text": "Yeah, so if you look at my income, it really flows up and down. But really this year is the first year that book income has been half, if not more of my income. In the first year I made about $50,000 from my book. I sold about 10,000 copies, about $5 a book. Second year, so far, the first five months I've sold about 15,000 copies of my book and that's been about $75,000 in royalty, which is pretty wild. Last year I went from 100 grand in revenue, that's top line, that doesn't include costs or taxes, to 249,000. And so far in the first six months of this year, I track to sort of beat that, though I probably won't because I'm mostly choosing to just spend more time with my daughter than work or try to make money. Yeah, but I started writing while I was still employed. One morning, I don't know why, about a year before I quit my job, I just decided to come into work and I said, I'm going to write On Quora every day before I start doing my work. And I did that for like a hundred days. And something in that clicked. I think I was a writer from that moment on. But I was dealing with some health issues. I was dealing with Lyme disease and a bunch of other stuff. And I just started up blog called Limesucks and I just started sending it to people. As I quit my job, I started writing about my path. And it went from publishing every three months to every two months to every month to every week. And now I'm just writing all the time.",
      "start": 90760,
      "end": 170060
    },
    {
      "speaker": "A",
      "text": "When you quit your job, when was that?",
      "start": 170060,
      "end": 171860
    },
    {
      "speaker": "B",
      "text": "That was 2017.",
      "start": 171860,
      "end": 173100
    },
    {
      "speaker": "A",
      "text": "Okay, so tell me about that time. You were working a high salary job in New York City. Tell me about that.",
      "start": 173180,
      "end": 177820
    },
    {
      "speaker": "B",
      "text": "Yeah, so I desperately wanted to break into fancy and prestigious companies early in my career. I wanted to feel special, but that never quite fulfills. And so before I quit my job, I was applying for other jobs. One company offered me much less than my current salary and the other ones rejected me. And I sort of just like quit. It was like the first time in my life that I just let life emerge. But the next few months were just really hard. I started taking action on setting up my freelance firm and my company informed me that I had not saved three years and would have to pay them back the $24,000 signing bonus and relocation expenses. It was like I had to buy my freedom. Yeah, but I had about, I think 50, 60 grand in savings. And for me that was like permission to just wander and do nothing. And even if I go to broke, I'll figure something out.",
      "start": 177900,
      "end": 231070
    },
    {
      "speaker": "A",
      "text": "What I love about your story is that you turned down a very big deal with Penguin Random House. If you don't know, they are one of the biggest book publishers in the world. So you could go and self publish. Tell me why you did that.",
      "start": 231070,
      "end": 242910
    },
    {
      "speaker": "B",
      "text": "Yeah, they reached out and it was interesting because they do have relationships that can help scale a book to a wider audience. But I think for me it's too high of a price to pay. One, creative control. I'm not willing to pay that price. I don't want to give up any creative control, even if it means less book sales for me. And two, they give you 10% of list price for hardcovers, which would be about $2 for me. Paperbacks, I make about $7 a book. Hardcovers, I make about $8 a book. So it's highly profitable.",
      "start": 242910,
      "end": 273720
    },
    {
      "speaker": "A",
      "text": "When you got the idea for the book, tell me about the process of writing it from a and then also getting it into print and publication.",
      "start": 273720,
      "end": 280780
    },
    {
      "speaker": "B",
      "text": "Early on, I realized the personal story felt like a powerful edge to explore. So I just did that for a few months. And it felt so good to really just say, here's what I believe, here's what it matters, and here's what it's all about, and here's my way of seeing the world. Then the whole process was basically write intensely for a month or two, take a step back, try to get the structure, and just go back and forth in between those two modes. Then you just output a PDF, upload to Amazon, and you can start printing and sending out books and three days.",
      "start": 280780,
      "end": 310720
    },
    {
      "speaker": "A",
      "text": "Quick Break this is me five years ago, desperate to start my own business, but plagued with shiny object syndrome. I tried building SaaS tools, freelancing, affiliate marketing, but none of these business ideas ever panned out to anything. But everything changed one day when I looked inside and wondered, what if instead I built a business around what I'm good at and what I'm passionate about? Well, that decision led me to building a business that now makes over a million dollars a year. And that's what Starter Story is all about. It's a community of thousands of founders who changed their by building an online business around their skills and their passions. Our 4000 plus case studies and business idea breakdowns will show you how regular people just like you found the right idea and turned it into millions. For example, Luke joined Starter Story and dove into our case study about a newsletter business that makes over $25 million a year. Just one month later, he launched his own newsletter business that did $5,800 in revenue in 30 days. So if you're serious about finding that right idea, click the first link in the description. We're running a special for the YouTube family. All right, enjoy the video. I'll see you around. Peace. Tell me about why you decided to write a book about this. And what's the. What's the theme behind the book?",
      "start": 310720,
      "end": 380860
    },
    {
      "speaker": "B",
      "text": "The path to this path is really my way of making sense of my life after leaving the default path. The thing about leaving the default path is you realize how powerful of a story it is for everyone. People still ask, what's your plan? How are you going to make money? After I left my job, it felt weird. I didn't have a plan and I realized you can't actually escape work. You ultimately need to find work that can sustain your soul. I call this in my book, the real work of your life. And the pathless path is basically committing to that without knowing when that will arrive. If you can monetize it, and if you can, explain it to your parents or others.",
      "start": 380860,
      "end": 420550
    },
    {
      "speaker": "A",
      "text": "How do you search for the work and find the work that can be your life's work?",
      "start": 420630,
      "end": 424470
    },
    {
      "speaker": "B",
      "text": "If you're searching for the work that matters, you should remove money from it as long as possible. Like fight for that. The key though is mostly just quitting things. If it's not the thing lighting you up, you need to get that out of your life. You need to minimize it, you need to automate it, you need to delegate it, you need to quit. What I recommend to most people is to try to find a one to three month block in adulthood to take a sabbatical, disconnect from worker mode, reconnect with forgotten hobbies. Because the only thing that will let deeper things you can commit to emerge is creating space in your life. I think too many people are uninspired, doing work that doesn't matter to them and they've made a deal to keep doing it because, well, for the paycheck, for the health care benefits, I'm willing to light it all on fire, go broke, decrease my earnings, pay a status tax to keep doing work that matters to me. Once you find that work, you're willing to pay so much to have it central in your life.",
      "start": 424470,
      "end": 478700
    },
    {
      "speaker": "A",
      "text": "Let's talk about self publishing. If I wanted to self publish my own book, what do I need to do?",
      "start": 478700,
      "end": 482460
    },
    {
      "speaker": "B",
      "text": "If you really want to basically do what I did, which is I want to create something that feels good, feels like a book, matches what somebody might expect from a traditional publisher. You want to invest in a good editor, somebody that can help you bring the pieces together, stick the landing on how everything flows together, and that's typically called a developmental editor. That's probably going to be one of your biggest spends, designing a book cover. I use 99 designs. I picked a designer I really liked, his other designs. Formatting. You can either use Amazon's tools to format the ebook or you can use another tool called Readsy. That's what I used. I use the default options. And then at the end you might want to hire somebody to proofread. Here's the craziest thing though. It asks, who's your publisher? Turns out you can just write your name. That's what I did.",
      "start": 482460,
      "end": 527870
    },
    {
      "speaker": "A",
      "text": "And tell me a little bit more about the process of marketing a self published book.",
      "start": 527870,
      "end": 531269
    },
    {
      "speaker": "B",
      "text": "My approach is like, what do I actually like doing? And I'll lean into that. I like talking on podcasts, I like talking about the ideas in the book. Gifting books has been my other fun channel as well. And it's super easy with self publishing too. I can in the US send them anywhere for 450 including shipping.",
      "start": 531269,
      "end": 548730
    },
    {
      "speaker": "A",
      "text": "What did the royalties look like? What are some of the numbers?",
      "start": 548730,
      "end": 550810
    },
    {
      "speaker": "B",
      "text": "When I was looking at my royalty numbers, I was looking at $8.24 for hardcover through Amazon, $7.45 for paperback through Amazon, $3.98 per audiobook, $4.28 per Kindle. And then if I look at my breakdown of sales, it's about 50% ebook, 29% print and 21% audio.",
      "start": 550810,
      "end": 574330
    },
    {
      "speaker": "A",
      "text": "Can you break down the costs to create this book?",
      "start": 574560,
      "end": 577120
    },
    {
      "speaker": "B",
      "text": "So editing and coaching is about $3,900. Book cover cost me $742. Publishing was 250, a fee to IngramSpark. I now think that's free. The audiobook was $1,280 to produce. And as of today, my royalties, it's basically profit, is anywhere from between 125,000 to $130,000 so far.",
      "start": 577200,
      "end": 600560
    },
    {
      "speaker": "A",
      "text": "All right Paul, so as as a writer and a self published author, what are some other ways to monetize other than just book sales?",
      "start": 600560,
      "end": 607380
    },
    {
      "speaker": "B",
      "text": "For me it was always make enough money to have the space and time to continue to write. Early on it was freelancing. Then it was taking some of the experiences from freelancing and turning that into a course. I have a whole nother sort of side thing I run called StrategyU. But on top of that I slowly and deliberately built a workshop business which was like I'll do exactly this training for this price, teaching these things. I've always had this weird balance of like Strategy U and doing some coaching and freelancing as needed. But I keep that minimal and writing and creating and doing my podcast. Until recently the writing and podcasts and all those things were not making any money. It started to even out. Do I have goals of becoming a full time creator? I don't know. I kind of like the weird mix.",
      "start": 607380,
      "end": 653470
    },
    {
      "speaker": "A",
      "text": "All right Paul, let's talk about writing. How to become a great writer, how to become a confident writer.",
      "start": 653940,
      "end": 658100
    },
    {
      "speaker": "B",
      "text": "Like you basically just brute force. You need to get in the reps such that you can deal with the fear. The fear of what will people say. And then you'll quickly realize, especially when you're starting is nobody says anything because you don't have any readers. And then I think over the long term you really just need to develop an individual relationship with writing. Some people wake up and write four hours every day. That's never been my style. For me it's I need to create space in my life. And a big thing I do is like, I spend a lot of days wandering because it's that wandering mental time where I'm not really doing anything. I let ideas percolate. I'm usually reading a lot too. I'm listening to podcasts. That's when the creativity happens and the writing is only when I'm channeling that later.",
      "start": 658100,
      "end": 703740
    },
    {
      "speaker": "A",
      "text": "You've chosen this pathless path. Tell me about what the typical day in the life is for you nowadays.",
      "start": 703820,
      "end": 708520
    },
    {
      "speaker": "B",
      "text": "Typical day in the life for me is waking up and spending time with my daughter. She's a newborn now, so she requires a lot of attention and I'm really just leaning into that. The whole point of my path has been to essentially take time off whenever I want it. Does that mean I'm not working most days? No. I've typically worked a few hours most days for the past several years. But I've always had the ability to just stop again, clear my calendar. That's what I've done for the past few months. There's no morning routine. I typically never schedule any sort of meeting before 11am I really just let whatever flows flow.",
      "start": 708520,
      "end": 742530
    },
    {
      "speaker": "A",
      "text": "If you could go back in time to when you were just starting out on your pathless path and sit on Paul's shoulder and tell him one thing, what would it be?",
      "start": 742530,
      "end": 749770
    },
    {
      "speaker": "B",
      "text": "I don't know if I'd mess with the timeline, but I might say something like, just trust me, trust yourself. I might say something about writing too. I might just say, like, writing is important, something silly like that, because you don't want to give away the fun of the journey. The journey has been so fun for me because it's been so uncertain. And that is adventure for me. I don't know what's gonna come next. Even now, I have no idea what comes next. I'm excited to see what emerges. That's the whole point of this journey in this book and this path.",
      "start": 749770,
      "end": 781580
    },
    {
      "speaker": "A",
      "text": "Alright, you heard it here, folks. Follow the pathless path and you'll be one of the most successful authors in the world. Like Paul.",
      "start": 781580,
      "end": 788050
    }
  ]
}