{
  "source": "/home/salouri/Projects/starter_story/transcripts/ty9ZcimL6VE/ty9ZcimL6VE_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "Learned how to build an extension and launched my first extension within like two or three days. And today it's at about like 20 to 30 thousand dollars. Mrr.",
      "start": 480,
      "end": 11680
    },
    {
      "speaker": "B",
      "text": "How does one guy make over 20,000 dollars a month with a simple browser extension? Well, it's because he's building in the hottest niche in business right now. AI Saeed Ezadi started his journey as an employee working for almost a decade in corporate America in different startups. But now he's a solopreneur, making a pretty good living while working on a side project he's passionate about. So I spent over an hour talking to him and getting the complete Scoop on his $20,000 a month AI business. Turns out it's actually pretty simple, and it's not as saturated as you might think. There's still plenty of opportunity. You just need to know where to look. In this video, Saeed shares a masterclass on building in AI. Where to find good ideas, where to build those ideas, and some unique ways to monetize those ideas, even if you're a beginner. All right, let's get into it. I'm Pat Walls and this is Starter Story. Welcome, Saeed. It's great to have you. Tell me about who you are in this business that you built.",
      "start": 12160,
      "end": 78480
    },
    {
      "speaker": "A",
      "text": "My name is Saeed. I'm a software engineer. ChatGPT extension that I built. It's called Superpower ChatGPT. It's a browser extension, basically, that adds a bunch of extra feature to ChatGPT. I started this about a year and a half ago, and today it's at about like 20 to 30 thousand dollars. Mrr. I'm the only person who's been working on the extension. It has been downloaded close to like, I think 260, 70,000 times. Weekly active users for the extension is around like 150,000.",
      "start": 78800,
      "end": 114650
    },
    {
      "speaker": "B",
      "text": "Okay, so you built a Chrome extension to over $20,000 a month. What do you think is the best strategy for someone to do something similar?",
      "start": 115130,
      "end": 123170
    },
    {
      "speaker": "A",
      "text": "Two ways I'm thinking about this. Either building for an existing really big platform, like Gmail, for example, or like Roblox, Facebook, YouTube, Twitter, they already have all these users. All you need to do is to just build the extension and those users will find you. Twitter had like hundreds of millions of users, and if only like 2000 people wanted features, that's like a good amount of like, revenue for you to just live off of. The other thing I recommend is going after platforms that have like, an existing marketplace, but a smaller user base. Zoom or Salesforce. It's a lot easier to Compete in a marketplace like that, they have less number of users, but at the same time they have less number of people building for those platforms. So they that's another good place to build some products.",
      "start": 123410,
      "end": 175900
    },
    {
      "speaker": "B",
      "text": "Let's talk about the opportunity of building plugins in marketplaces. What makes this better than launching a traditional SaaS that has its own website?",
      "start": 176460,
      "end": 185980
    },
    {
      "speaker": "A",
      "text": "Most people when they want to start a project, they're just thinking about formstrip like a standalone platform, like a website that has all of its own backend and front end and everything. But competing with everyone on the Internet is a lot harder than competing with a limited number of players in a small, smaller like marketplace. And it also helps a lot with validating the product. Like it's a lot easier to build like a simple extension that runs on a user browser. That way you can at least know if the idea is going to work out or not and if it's worth like spending more time on it.",
      "start": 186540,
      "end": 220490
    },
    {
      "speaker": "B",
      "text": "Got it. So building for an existing marketplace is a lot faster, it's less crowded and it's a lot easier to validate your idea. Can you tell us how to actually come up with an idea for a Marketplace platform?",
      "start": 220730,
      "end": 232510
    },
    {
      "speaker": "A",
      "text": "When ChatGPT was launched I already had some ideas what feature is missing. And initially when I was building these features I was mainly building the extension for myself. And later I tried to go find the places that my users will hang out. Subreddits are one of them. Discord channels are other one. Site groups is another one, Facebook group is another one. I just like join all these groups and I started listening to people and trying to figure out what features other people want to see in ChatGPT. I think this is probably one of the best way to like come up with idea. Just go over your potential customers hanging out and see what they are asking for and just try to build that. And this was actually one of my probably biggest like growth hack that I applied to this extension. Just listening to people what they want, trying to implement the feature and then going back and telling them that okay, I added this feature, you can use this extension and have that feature as part of the ChatGPT interface.",
      "start": 233150,
      "end": 295610
    },
    {
      "speaker": "B",
      "text": "Saeed is the perfect example of a crafty Internet builder. He finds his ideas by spending time researching, researching in communities, researching through his own problems and frustrations, and most importantly researching other businesses to see if he could build something better. Now what if there was an easier way to shortcut all of this research? Well, that's why we made this solo developer deep dive. It breaks down 50 different solo developer, business Ideas including their business models, their customer profiles, the platform they built on, and a whole bunch of other cool stuff you'd want to know. So if you're actually serious about building a profitable side project like Saeed, head to the first link in the description and I'm going to give you the deep dive of 50 developer ideas for for free. And hopefully it helps you find your own idea. Now let's get back to Saeed. Okay, so we know where to build and what to build, but what about how to build it? What kind of experiences or coding languages do you need to learn?",
      "start": 295850,
      "end": 357970
    },
    {
      "speaker": "A",
      "text": "If you know how to build a simple website, you'll know how to build like an extension. JavaScript, HTML, CSS. That's how I built the very first version. It was very, very simple. Only had like two features basically. But actually I have never built any browser extension before. I learned how to build an extension and launched my first extension within like two or three days, basically after ChatGPT was launched. So I'm not saying like every like simple project could work. Timing is really important here. I was really, really early.",
      "start": 358210,
      "end": 393080
    },
    {
      "speaker": "B",
      "text": "Okay, so you can find, build and launch a product pretty quickly, but how do you actually get users or eyeballs on your product?",
      "start": 393400,
      "end": 401000
    },
    {
      "speaker": "A",
      "text": "I have not done any ads or anything for the extension. And all of it happened organically by word of mouth or by me like posting on like different platform. Like I think the very first place that I posted it was on Reddit. I think it went like to the top of that subreddit that I posted for that day. But at the same time, like just people who like are on social media started writing reviews about like top like 10 chatgpt extension, for example. And my extension had those features basically. So I didn't write them, I didn't pay for them to be written. I've never like actually paid anyone to write any article. And it was all organic. People started finding it, started using it, they liked the idea, they liked the features and started sharing those ideas with their audience. And that helped a lot with growing the user base.",
      "start": 401560,
      "end": 452630
    },
    {
      "speaker": "B",
      "text": "Wow, so you didn't spend any money on marketing? Yeah, clearly being early helped a lot. But I think what stands out is that people basically started marketing your plugin for you because you built a really great product. Are there any other early opportunities that someone watching this could take advantage of right now? And how can you build standout products in those niches?",
      "start": 453030,
      "end": 473280
    },
    {
      "speaker": "A",
      "text": "AI is really powerful, but it's still very early. And doctors maybe are not thinking about like bringing AI into their job, but if you do There are a lot of like, opportunities there. One of my favorite things is to talk to my users. And every time I talk to any users, I try to learn as much as I can about them, what they do, what's their background and how they use ChatGPT. Learning about how a lawyer is using ChatGPT to make their job easier, or a doctor is using ChatGPT to make their job easier. It's one of the best way to come up with new ideas and build new product for people who don't directly use AI.",
      "start": 473600,
      "end": 514200
    },
    {
      "speaker": "B",
      "text": "Okay, let's talk about monetization. We know how to build it and how to get users, but how did you actually make your first dollar first?",
      "start": 514520,
      "end": 522600
    },
    {
      "speaker": "A",
      "text": "For the first nine months or so, the extension was completely free. Like every feature of the extension was 100% free. If you ask me today, I think I should have like monetized the extension earlier. But at the same time I do feel like it helped a lot with like growing my user base. So I wanted to capture that audience and I started writing a newsletter basically for like the user base that I had. And this is like three or four months after I started the extension. I also posted my newsletter on some of the website that like, you can get a sponsors for like within a, like week or two. I had like my first sponsors paying me like a few hundred dollars to just post their ad on the newsletter. But basically when I first started writing the newsletter, it would take me like maybe six or seven hours every day. Now it takes like maybe two hours or so to write a newsletter.",
      "start": 522760,
      "end": 575810
    },
    {
      "speaker": "B",
      "text": "Wow. So you took a pretty unconventional route and started making money from the newsletter first. But how did you monetize the actual Chrome extension?",
      "start": 575890,
      "end": 584530
    },
    {
      "speaker": "A",
      "text": "After like that, like first nine or 10 months, I started to think about new features that I can add to the extension and ask people to pay for those extra features basically. So I didn't ask anyone to pay for any existing features that the extension had. And all of those features stayed free. And I tried like different pricing. Like I experimented, like higher price, lower price. And I like kind of found like a middle ground there that I think was the best way to price the extension.",
      "start": 585090,
      "end": 614240
    },
    {
      "speaker": "B",
      "text": "So what are the coding languages, tools and software you use to build?",
      "start": 614640,
      "end": 618800
    },
    {
      "speaker": "A",
      "text": "As a solopreneur, I spend most of my time inside VS Code. It's a code editor. That's where I write all of my code for all of my projects. When I was building the extension, I went back to like pure JavaScript with no frameworks. I used AWS for all of my backends. All of my project basically live on like aws. For like the newsletter I use Beehive. One of the nice thing about Beehive is like their monetization feature. They actually they have this thing called Boost. You can just like include some links in your newsletter and make money from it. I use Passion Fruit. That's where people find me and reach out to me to sponsor the newsletter.",
      "start": 618800,
      "end": 663050
    },
    {
      "speaker": "B",
      "text": "All right, before we wrap things up, I want to talk a bit about a controversial topic in the AI space. You know you built this product to over $20,000 a month, but it's a ChatGPT wrapper, right? Is there any downside to this and do you worry about this at all?",
      "start": 663450,
      "end": 678150
    },
    {
      "speaker": "A",
      "text": "OpenAI can kill this product any day. I was scared of that for a very long time and at this point I kind of feel numb to it. I don't want to like worry about it today. Literally if my extension stop working at some point I probably gonna try and build other extension for one of these other major platform. They're just going to make my my life a lot harder.",
      "start": 678470,
      "end": 700980
    },
    {
      "speaker": "B",
      "text": "All right, Saeed, final question. What advice would you have to someone just starting out who wants to build their own software business or plugin inside of a marketplace?",
      "start": 701380,
      "end": 710260
    },
    {
      "speaker": "A",
      "text": "Try to validate the project as fast as you can. Just build the very first version and launch it and see if you get some users from it. Try to do that. And the other thing, I mentioned this earlier. Focus on your strengths. In my case it was building a product, sharing it with people for free, and like getting my first few users from that. So those two things are the most important thing in my opinion.",
      "start": 710820,
      "end": 737690
    },
    {
      "speaker": "B",
      "text": "Yo guys, I really hope you enjoyed the video and got some hopefully good tips and golden nuggets from Saeed. But I want to say something real quick at the end of the day. The point of these videos is to show you ideas and show you its purpose possible. But hopefully you take these ideas and go start your own profitable thing in your own successful business. While learning this stuff is important, taking action is the thing that's actually going to change your life. So spend time researching, learning, finding ideas, but then go build that thing as fast as you can. If you're still feeling a little lost on this right now, well click the first link in the description and you're going to get our free report of solo developer ideas that are actually making money right now so you can get going on your thing. Much love and I'll see you guys in the next one. Peace.",
      "start": 737850,
      "end": 785520
    }
  ]
}