{
  "source": "/home/salouri/Projects/starter_story/transcripts/b5JhfGHafZA/b5JhfGHafZA_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "These guys went from zero to $120,000 a month with an AI app. And the crazy part is they did it in less than a year. I drove out to Miami, Florida to ask them exactly how it works and how one platform got them 10,000 paying users in a matter of days.",
      "start": 320,
      "end": 18560
    },
    {
      "speaker": "B",
      "text": "So was sort of like a great springboard for us in order to establish a solid brand.",
      "start": 18960,
      "end": 26080
    },
    {
      "speaker": "A",
      "text": "The boys started their journeys working at VC backed startups. But they grew sick and tired of the system. So they got together to build something for themselves and along the way discovered something that would change their lives.",
      "start": 26160,
      "end": 39970
    },
    {
      "speaker": "B",
      "text": "The main reason I think CastMagic won.",
      "start": 40850,
      "end": 43010
    },
    {
      "speaker": "A",
      "text": "Is in this video, Blaine, Ramone and Justin share their exact blueprints on how to come up with a million dollar idea, how they built it in two weeks, and how they scaled it to six figures in MRR in just 10 months.",
      "start": 43010,
      "end": 56450
    },
    {
      "speaker": "B",
      "text": "I think one of the key things here is.",
      "start": 56930,
      "end": 58370
    },
    {
      "speaker": "A",
      "text": "I'm Pat Walls and this is Starter Story.",
      "start": 60370,
      "end": 63330
    },
    {
      "speaker": "C",
      "text": "Hi Ramon.",
      "start": 65090,
      "end": 65930
    },
    {
      "speaker": "D",
      "text": "Thank you for having me. We are here in this beautiful Miami apartment with your two co founders, Blaine and Justin, and we are here to talk about this amazing app that you built. Tell me about what you built.",
      "start": 65930,
      "end": 77090
    },
    {
      "speaker": "B",
      "text": "Yeah, so we built castmagic IO which leverages AI to create content with the context of your videos or audio files, conversations, any media really. You can repurpose it. And we started Castmagic about 10 months ago and today we're north of 120,000 in MRR.",
      "start": 77170,
      "end": 95570
    },
    {
      "speaker": "D",
      "text": "Let's talk about the opportunity of AI apps. What's going on here?",
      "start": 95730,
      "end": 99010
    },
    {
      "speaker": "B",
      "text": "I think if you can embed yourself into an existing workflow and radically remove the friction of like the barrier to entry to doing something, such as creating a podcast, those are the tools that are really taking off. And you know, I think these are real needs and not just a sort of vitamin. It's more the painkiller analysis thing.",
      "start": 99410,
      "end": 118150
    },
    {
      "speaker": "C",
      "text": "Yeah.",
      "start": 118150,
      "end": 118590
    },
    {
      "speaker": "D",
      "text": "All right, so we got Blaine here, he's the co founder and he runs product. Tell me about how you found the idea for this app.",
      "start": 118670,
      "end": 125390
    },
    {
      "speaker": "C",
      "text": "Yeah, so essentially I host DTC Pod with Ramon and I noticed this problem, which in my mind at the time was just about how do you write show notes from your podcast? I can't just like assign it to a random VA who isn't going to understand the context of like the person I talk to and all of that. So that was kind of the inspiration. When we saw AI coming up, we're like, wait a minute, like, I think AI might be able to do this. The real lesson there for any foul founder is just by Doing something and putting yourself in a situation where you're constantly doing, you're gonna unearth problems that are worth solving. And maybe those problems have bigger implications than you thought they would in the first place. Yeah, yeah.",
      "start": 125710,
      "end": 162450
    },
    {
      "speaker": "D",
      "text": "You figured out this problem that you have and then you decide to make it a product. What happens after that?",
      "start": 162450,
      "end": 167130
    },
    {
      "speaker": "C",
      "text": "I think distribution for an early stage startup is something that's like super, super critical. Starting with yourself at the core of it, build something for yourself and then very quickly get as close to the customer as you can. Either create content that attracts people to you and so they can kind of come inbound. So that's why I think personal brand putting out content is such an important thing, or find a distribution partner that can like really help you scale. So we're talking with the team at AppSumo and they said, hey, we've got this opportunity. Would you guys be down to like launch two weeks from now? And we're like, oh shit, two weeks. But that's a really good opportunity to get distribution and start growing. Basically, yeah.",
      "start": 167290,
      "end": 203510
    },
    {
      "speaker": "D",
      "text": "Let's talk about marketing and growth. You guys grew 0 to 120k MRR in nine months. How did you do that?",
      "start": 203510,
      "end": 211330
    },
    {
      "speaker": "B",
      "text": "So AppSumo was sort of like a great springboard for us in order to establish a solid brand. We launched with them and I think it's been one of the most successful launches ever on AppSumo. So, you know, around 350,000 in revenue generated gave us probably around 10,000 users or so. We offered a lifetime deal, which means that our customers have access to us and our services forever. For people that self subscription say, well, why in this world would I ever do that when I can get recurring subscription? But we needed to build a brand, we needed to build a foundation, we needed the feedback. The other thing that worked really well for us was creators. We started incentivizing people to create content on socials. You know, some people we were paying, some people we were reaching out to be an affiliate. And one of the best ways to do this is like scrape Instagram, scrape the platforms, find companies that might be adjacent industries, look up those hashtags and then build volume. Once you build volume and responses now you have leverage to negotiate with the rates and then just go from there and start paying out based on CPMs and then decide who's worth sponsoring and get enough volume to test if it's a viable channel for you or not.",
      "start": 211650,
      "end": 282590
    },
    {
      "speaker": "D",
      "text": "Yeah, you have a one man marketing team. You don't have some big marketing team. You've grown this business. To 100,000, 120,000 MRR. How do you operate a marketing team with one person?",
      "start": 282590,
      "end": 291910
    },
    {
      "speaker": "B",
      "text": "I have contractors that help me on a specific vertical, but something people don't do enough is like research. You can actually go and like map out how did this company that is similar to us, that serves our same exact customer base, how did they get distribution? And so in our case, I went back and try to find businesses that really grew through affiliates. So like, how do I set a system here? And a tangible example here is I noticed myself going back and forth with a bunch of the creators on like ideating content concepts. And then I was like, this isn't going to scale. So I created a whole notion document of a bunch of concepts. Now I don't have to get on a call with them and strategize on the content. So it really just all comes out onto systems.",
      "start": 292230,
      "end": 332910
    },
    {
      "speaker": "A",
      "text": "Ramon and the boys are proof that you don't need funding to start and build a million dollar business in less than a year. All you really need is a simple idea and the right strategies to bring it to life. And the best way to do that, like Ramon said, is by studying other businesses. So if you're serious about building your own product like the boys at Castmagic, but don't know where to start, well, right now you can download our deep dive SaaS report for free. It'll break down over 52 different micro SaaS business ideas making millions, along with trending ideas, growth strategies and ton of other stuff you'd want to know. Just head to the first link in the description to get it. Now let's get back to how these guys actually built this thing.",
      "start": 333070,
      "end": 370490
    },
    {
      "speaker": "D",
      "text": "All right, let's talk about tools. What coding languages and what tools did you use to build this app?",
      "start": 370490,
      "end": 375770
    },
    {
      "speaker": "E",
      "text": "In the first two weeks, I can't emphasize enough how much you have to accept building an imperfect product. A bit of a unconventional choice to a lot of people. I built this with Elixir. It's very stable. It's a language that scales really well. And because Elixir has a tool called Phoenix and liveview, you're able actually to build the entire front end and back end in the same language. For the landing page. We built it in webflow. We could make it look good using templates and therefore we could spend all of our time as a development team working on the part that mattered most to our users, which was the product.",
      "start": 375770,
      "end": 408190
    },
    {
      "speaker": "D",
      "text": "All right, let's talk about pricing. How is castmagic priced and how did you come to that strategy?",
      "start": 408590,
      "end": 413550
    },
    {
      "speaker": "E",
      "text": "We offer a Subscription build monthly with a cap on usage. It's funny, we really just kind of threw out numbers that we wanted to test and found that it worked. And we are always analyzing what we're spending on LMS and transcription, making sure that we have enough margin to justify the outputs that we're giving our customers. And so far we've been able to keep those in balance so that both our customer and us can win from the relationship.",
      "start": 413550,
      "end": 438880
    },
    {
      "speaker": "D",
      "text": "Okay, we are back with Ramon to Talk now about AI. It's changing like crazy. Differentiation. Tell me, why was CastMagic successful when there are thousands of other apps that weren't?",
      "start": 439040,
      "end": 449760
    },
    {
      "speaker": "B",
      "text": "So the main reason I think CastMagic won is for three reasons. Number one, we solved our own problem. Number two, we build a brand by partnering with the right creators. And number three, we built and continue to invest in the product to increase the quality of the outputs. That's really what it boils down to in an AI product. It's not just how does a platform work, but what is the quality of the output that I'm getting here and are they taking any shortcuts in the back end? And clearly we weren't. So then the customers are now invested into us. You have to ask yourself, how do I position myself and how do I build the brand for the long term here?",
      "start": 450000,
      "end": 486780
    },
    {
      "speaker": "D",
      "text": "All right, so what do you do when ChatGPT comes out with a new model and then they essentially replace your product? How do you think about that?",
      "start": 487020,
      "end": 493980
    },
    {
      "speaker": "B",
      "text": "We are solving a workflow problem and there's always ways in which you can continue to optimize that process more and more. That is in chargebots business. ChatGPT is there to provide the infrastructure. They have a future, not a product. They solve one small pain point. They don't solve like an entire solution that only a platform that covers a workflow from A to Z can solve.",
      "start": 494140,
      "end": 518890
    },
    {
      "speaker": "D",
      "text": "Yeah, tell me some of the numbers. Some of the financials behind this business churn single digits.",
      "start": 518890,
      "end": 523930
    },
    {
      "speaker": "B",
      "text": "Like Net Churn is single digits. That goes back to the value of like, you know, solving like existing problem, not creating a novelty. We have over 120,000 in MRR. We're growing over 20% month over month. I think one of the key things here is we don't spend over 20% of our revenue on marketing. Marketing always has to be less than 20% and that is because we want to make money, we want to be profitable. So far it's working. And you know, those are principles I think, that we'll continue to use to grow the business.",
      "start": 523930,
      "end": 552030
    },
    {
      "speaker": "C",
      "text": "Yeah.",
      "start": 552110,
      "end": 552590
    },
    {
      "speaker": "D",
      "text": "So you Guys built this. Three friends. Tell me about why your team works and why you guys work so well together.",
      "start": 552590,
      "end": 557870
    },
    {
      "speaker": "B",
      "text": "I think the reason we work so well together is because we've all been through the journey and we know it's a long one and initially in the beginning we're not getting stuck in the small details and we also know when to have fun. Yesterday we were meeting, we did our whole roadmap thing and we took out some time to go and play nine holes of golf. It's not that serious. So I'm curious on Blaine's take here though, and Justin's.",
      "start": 558510,
      "end": 581130
    },
    {
      "speaker": "C",
      "text": "Yeah, I mean I think the biggest thing is just like alignment, right? I think so many co founders especially maybe first time around they partner with people out of personal convenience or because out of necessity almost rather than like true, true alignment. The second thing that I think is so, so important is that you have skills that complement each other so everyone can stay in their lane. Having a team that doesn't like overly overlap and step on each other toes I think is massive. So I think finding not only alignment but also people that you can build with that you like, vibe with, but also compliment each other's skillset is like the best thing that you can do.",
      "start": 581210,
      "end": 615520
    },
    {
      "speaker": "E",
      "text": "I think a big part of that is the trust that we have in each other too. And we're very honest about what we're building. Like we're not afraid to say, like, hey, this isn't as good as it could be. And I think that shows in where we are today and what we've built.",
      "start": 615600,
      "end": 628640
    },
    {
      "speaker": "D",
      "text": "Let's talk about vc. You guys have all gone through the vc.",
      "start": 628800,
      "end": 632480
    },
    {
      "speaker": "C",
      "text": "I'm gonna be the anti VC poster bro.",
      "start": 633280,
      "end": 635520
    },
    {
      "speaker": "D",
      "text": "Tell me a little bit about your past with VC and how you're thinking about these days.",
      "start": 636160,
      "end": 640970
    },
    {
      "speaker": "C",
      "text": "Yeah, so I've had two venture backed companies in the past. The first was seeded their Series C. They've raised over $80 million to date. The second one was called Omni Panel. We were backed by CRV. We raised a two and a half million dollar seed. And this time around it just feels very different. It feels like we spent all the time we would have spent like talking to VCs explaining like the broad vision for our product and we just spent it talking to customers and building crap for ourselves that we ended up using. So I think that's something that's really valuable for anyone who's getting don't seek validation elsewhere. Build something that customers want, they're willing to pay for and that you yourself, that solves a problem for you and you'll be in good shape. And then if you want to take VC to accelerate that growth, that's up to you. And you can figure out if that's the right decision for your business.",
      "start": 640970,
      "end": 683350
    },
    {
      "speaker": "B",
      "text": "Yeah, I think in my experience, I built a business called Trend that I. Oh, I tried racing for that business for almost four years. The effort that it took to actually get good at fundraising, it's a skill set in itself. If you're not great at building a business and generating revenue and you choose to get great at fundraising, you're just going to have the whole thing backwards.",
      "start": 683510,
      "end": 703290
    },
    {
      "speaker": "D",
      "text": "How do you guys all work together? How do you stay aligned? How do you meet as a team?",
      "start": 703690,
      "end": 707610
    },
    {
      "speaker": "C",
      "text": "I think from a team perspective, what's really cool about how we operate is, you know, Ramon's in Fort Lauderdale, I'm here in Miami, Justin's in Austin. A lot of the work is Async during the work week. But what we're really mindful and the reason we're all here today in Miami is because every quarter we get together for at least a week to like meet on all the important things. So I just think it's like a really great model for startups or founders who are like looking to get the business started. It's not like where you are, where your office is, etc. It's like find a great group of people wherever they are in the world and do your own thing. But make sure that you also get together to get really aligned on the things that need to happen in your business. The other thing that we do just in terms of operationally is we do a Monday 30 minute standup call and a Friday 30 minute standup call just to align on product, what everyone's doing. But we really try to block out the calendar and not be stuck on calls all day and more focus on like just shipping.",
      "start": 707770,
      "end": 761820
    },
    {
      "speaker": "E",
      "text": "Yeah.",
      "start": 761900,
      "end": 762380
    },
    {
      "speaker": "D",
      "text": "All right, thank you guys for having me in this amazing apartment, this amazing business that you guys built. Do what they did, follow this advice and you have a $120,000 MRR AI app. Good luck, guys.",
      "start": 762780,
      "end": 774620
    },
    {
      "speaker": "A",
      "text": "Hey guys, I hope you took away some golden nuggets from that video that'll help you along your business journey. And for anyone that still feels a bit lost, maybe you don't know where to start or you need some inspiration on some good marketing strategies. Well, I got something for right now. If you head to the first link in the description, you can download our deep dive SaaS report for free. It has over 50 different micro SaaS, businesses making millions along with the tools they use the business models they run, and tons of other stuff that will help you on your journey. Just click the first link in the description to grab it. And if you're serious about building something, consider joining Starter Story and we'll help you do it. Much love and see you guys in the next one. Peace.",
      "start": 774620,
      "end": 812600
    },
    {
      "speaker": "B",
      "text": "It.",
      "start": 812880,
      "end": 813120
    }
  ]
}