{
  "source": "/home/salouri/Projects/starter_story/transcripts/7pCgbhUWW54/7pCgbhUWW54_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "This guy makes over $1 million a year with one website. And the crazy part is he built it while he was working at his 9 to 5 job until he got fired.",
      "start": 240,
      "end": 10880
    },
    {
      "speaker": "B",
      "text": "My boss found out about that and fired me. I was like, oh, okay, I'm going to put everything I have into making this work. And then from there, it just kept going up.",
      "start": 11120,
      "end": 19160
    },
    {
      "speaker": "C",
      "text": "Yeah.",
      "start": 19160,
      "end": 19520
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 19520,
      "end": 19920
    },
    {
      "speaker": "A",
      "text": "He invited us into his house in Colorado to show us exactly how we got started, how he made his first dollar, and the timeless marketing strategy he uses to make over 100,000 doll.",
      "start": 19920,
      "end": 31200
    },
    {
      "speaker": "B",
      "text": "It's the same exact thing I've been doing since day one. It's just.",
      "start": 31980,
      "end": 35260
    },
    {
      "speaker": "A",
      "text": "For the first few years of running his business, Matt barely made any money. Then he cracked the code and created one product that would change his business forever.",
      "start": 35820,
      "end": 45900
    },
    {
      "speaker": "B",
      "text": "The majority of like how we make money is through.",
      "start": 46060,
      "end": 48540
    },
    {
      "speaker": "A",
      "text": "In this video, Matt will share his niche finding, distribution and monetization blueprints he used to build a million dollar business with just one skill. I'm Pat Walls, and this.",
      "start": 48860,
      "end": 61500
    },
    {
      "speaker": "C",
      "text": "Thank you for having me, man.",
      "start": 64440,
      "end": 65360
    },
    {
      "speaker": "B",
      "text": "Oh, thanks for coming. Yeah, I appreciate it.",
      "start": 65360,
      "end": 67200
    },
    {
      "speaker": "C",
      "text": "Tell me about who you are and.",
      "start": 67200,
      "end": 68240
    },
    {
      "speaker": "A",
      "text": "The business that you built.",
      "start": 68240,
      "end": 69240
    },
    {
      "speaker": "B",
      "text": "My name is Matt. I run a site called swimuniversity.com we teach people how to take care of their pools and hot tubs via online education. So we hit a million last year in the business. And then going forward we may do some changes. So it may be fluctuating, but my wife and I teamed up and then my brother is our editor, is our video editor. So it's my family business. Yeah. Nice. And it's just the three of us now. Yep.",
      "start": 69320,
      "end": 91250
    },
    {
      "speaker": "C",
      "text": "Let's break down your business a little bit more. Can you explain it to me in.",
      "start": 91250,
      "end": 94450
    },
    {
      "speaker": "A",
      "text": "Simple terms, how it works?",
      "start": 94450,
      "end": 95770
    },
    {
      "speaker": "B",
      "text": "Simple terms. We're a media company focused on education in pool care. That's what we do. We teach homeowners how to take care of their pool. We do that through content. So we have blog posts. A lot of it's through SEO, a YouTube channel with about 225,000 subscribers, a newsletter with 100,000 pool owners that we send out two to three times a week, depending on the season, to make money from that. We have advertising from YouTube through AdSense or whatever. Then we have the blog, which makes money through affiliate marketing. So we have affiliate links, products that we recommend, you know, mostly Amazon. Then we have courses where we make a bulk of our money. So we sell three different courses for pools, one course for hot tub. And last year we came out with a physical book, and that's about it.",
      "start": 96170,
      "end": 139250
    },
    {
      "speaker": "C",
      "text": "Yeah. Can you tell me about your backstory and how do you become an entrepreneur?",
      "start": 139250,
      "end": 142810
    },
    {
      "speaker": "B",
      "text": "So I just had a job like every other kid had a summer job. I stayed at that company for a while. I went to another pool company. I went to another pool company. I moved up in marketing. And then in that moment, I'm like, okay, so they're coming in, I'm testing their water, they're asking me for advice. I'm handing them chemicals. I'm like, you need to buy this. You need to buy this. You need to buy this. And here's the steps in which you need to add those things. I thought I could do this at scale if I just wrote this as a blog post or made a video about this and then say, hey, if you want to get rid of algae, you want to clear up your pool or whatever. Here are the four products we recommend to do what I just told you to do. But I know I'm not good at English. I knew. I was like, my grammar was terrible. So I worked so hard to get good at it. I was working. Working at this company as a marketing director is a pool company. I would go home, I would work on the site at home. My boss found out about that and fired me. And so I was like, oh, okay, I'm gonna put everything I have into making this work. And I made $20,000 that year on the site. And I used the rest of that time to do website design to kind of supplement it. The next year I made $40,000. And then I was like, I have a real business. And then from there it just kept going up.",
      "start": 142810,
      "end": 207560
    },
    {
      "speaker": "A",
      "text": "Yeah, yeah, just like Matt. I also started a million dollar business while I was working a 9 to 5 job. I was fed up building things for other people. And if I'm being honest, I really wanted the freedom. So I created a plan, found an idea, and executed on that idea every day for two hours. That business that I started changed my life. And if you're interested in doing something similar, should check out my workshop. It's 100% free. And I'll share with you exactly how to find a million dollar business idea and how to build it on just two hours a day without quitting your full time job. And the secret that took me years to learn that nobody's talking about, Just head to the first link in the description to save your seat. Spots are limited. All right, guys, I hope you enjoy the rest of the video with Matt.",
      "start": 207560,
      "end": 253130
    },
    {
      "speaker": "C",
      "text": "All right, so you're a terrible writer, but you have the self proclaimed. But you have the Confidence that you can put this blog out into the world and build a business out of it. Where does this come from?",
      "start": 253130,
      "end": 264170
    },
    {
      "speaker": "B",
      "text": "I was confident in website building and design so, like, I could open up Notepad and build a website in pure HTML. And I, you know, I did graphic design. I was, you know, as a kid, I drew a lot. So, like, I had that I could make something look like a legit website. If you read it, it was really bad. Like, really, really bad. There was no periods, nothing, no commas. Like, it was just poorly written from someone who, like, knows how to talk. Right. But doesn't know how to stop. It's kind of like written by a third grader, but visually, yeah, I can make it look great. And I knew how to get it online.",
      "start": 264400,
      "end": 294960
    },
    {
      "speaker": "C",
      "text": "Yeah, you know, let' about monetization. You've built this blog, now you need to monetize it. How do you make your first dollar?",
      "start": 294960,
      "end": 301260
    },
    {
      "speaker": "B",
      "text": "Made my first dollar with AdSense. My goal was to get traffic to get eyeballs on the site so that I could make money from AdSense. It was the easiest thing I could do going forward. I moved away from AdSense because I didn't like the way ads looked. They were irrelevant to my content. And I took that off and focused 100% on affiliate marketing for many, many years. In fact, that was the only way I made money, probably up until I started to develop. The first product I created was a PDF that I sold at first for 50 bucks. No one bought it. Then I dropped it to 40 bucks. No one bought that. 30 bucks. Some people bought it, 29. More people bought it, 24. A lot of people bought it. And I was like, okay, I found the price point. It took me years. The next product I created was the Pool Care Handbook, which did a lot better. I'd learned everything from the first one. It was much bigger. And I added courses to them. So then they became like a video course and ebook combination. And then I actually printed our book. And that's been the majority of, like, how we make money is through the course material and the. And the books.",
      "start": 301420,
      "end": 366950
    },
    {
      "speaker": "C",
      "text": "Yeah, yeah. So you're building this thing, you're making money. How do you grow it? How do you grow into a business that's making a million a year?",
      "start": 366950,
      "end": 373550
    },
    {
      "speaker": "B",
      "text": "It's the same exact thing I've been doing since day one. It's just content. Put out as much content as I possibly can create. We start with the video, the long form video, the script. We take that. We rerecord little bits for short form. So I do one long form video a week, three short form videos a week on YouTube, Instagram, TikTok, Pinterest, Twitter, LinkedIn. Anybody that will take a short form video, basically, and then we take those scripts and format them and turn them into blog posts that rank on Google. Anybody that comes to us from there, hopefully signs up for our email list. And then we have an entire email newsletter where we send two to three emails a week to those people. And we run ads as well, which helps supplement all of that. But the same video that dominates every single year. It's a PowerPoint point. There was no script. I just, you know, developed this, like, here's what I. How I think about pool care from start to finish. We can't beat it. What that tells me is doesn't matter how good your video is, it just matters that the content is good.",
      "start": 373550,
      "end": 429870
    },
    {
      "speaker": "C",
      "text": "Yeah.",
      "start": 429870,
      "end": 430270
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 430270,
      "end": 430670
    },
    {
      "speaker": "C",
      "text": "So you built a business around pools.",
      "start": 430830,
      "end": 433710
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 433950,
      "end": 434430
    },
    {
      "speaker": "C",
      "text": "No offense, it's a bit of a boring thing. You wouldn't think there'd be a business there. Tell me about, tell me about building a business in a boring niche and why you did it.",
      "start": 434430,
      "end": 440870
    },
    {
      "speaker": "B",
      "text": "Because no one wants to get good at taking care of their pool or skimming a pool. It's like, oh, I'm the absolute expert at skimming a pool. Like, no, they just want to swim in the pool. So I just want to get them from. All right, your pool is disgusting. To your pools. Clear and safe in no time. That's my entire goal. Because again, like, it's just not a hobby business. I can't do an hour long podcast where we're just riffing and bullshitting about pool care because it's fun to listen to. Like, no one's going to listen.",
      "start": 440870,
      "end": 468870
    },
    {
      "speaker": "A",
      "text": "Yeah.",
      "start": 468870,
      "end": 469150
    },
    {
      "speaker": "B",
      "text": "So I have to be short, I have to be punchy. I have to be entertaining because I got to keep your attention. That's the thing I've had to do this whole time in order for it to work.",
      "start": 469150,
      "end": 476590
    },
    {
      "speaker": "A",
      "text": "Yeah.",
      "start": 476590,
      "end": 476950
    },
    {
      "speaker": "C",
      "text": "What are your thoughts for maybe someone who's watching this video on picking the right niche, picking the right business to work on.",
      "start": 476950,
      "end": 482700
    },
    {
      "speaker": "B",
      "text": "It's always been based on what I am interested in. So I have this, like, practice that someone gave me where it was like, walk around your house and just start writing down things in your room and then you can find a niche that way. It's like, if you just walk around this room, there's so many things that I could write down and just be like, oh, wow. Yeah, I guess I am interested in that. I wonder if people are talking about that because I like that thing and I Would say, pick something that you know and that you're least interested in. Because when the going gets tough, when it's hard to like create content, at least you like the topic a little bit. Like just even just a little bit. Because otherwise you're like, why am I doing this? What's the point of this?",
      "start": 482780,
      "end": 520480
    },
    {
      "speaker": "C",
      "text": "All right, let's talk about tools and software. What runs your business?",
      "start": 521200,
      "end": 524640
    },
    {
      "speaker": "B",
      "text": "Asana. It's my favorite. Everything's in it, Everything. When I have to take out the trash, when I have to pay my credit cards, everything for swim university. It's all in Asana. All of it. The other one is, is Google Drive. All of our files are all in the cloud so that everyone has access to them, obviously. WordPress, huge tool for us. SEMrush for SEO, we use rank Math as a plugin. We use Lasso for our affiliate links. We use Chat GPT as a business partner. I talk to it like a human and ask it questions to help make decisions on things that I don't think about. It's really good at that. Yeah, it's really good to just talk to. Yeah, I'm not lonely. And for email list, we are on Klaviyo or Klaviyo.",
      "start": 524800,
      "end": 563340
    },
    {
      "speaker": "C",
      "text": "Yeah, the best.",
      "start": 563740,
      "end": 565500
    },
    {
      "speaker": "B",
      "text": "It is the best.",
      "start": 565740,
      "end": 566540
    },
    {
      "speaker": "C",
      "text": "You run this business as a family business.",
      "start": 566540,
      "end": 568460
    },
    {
      "speaker": "B",
      "text": "Can you tell me a little bit more about that? Yeah, there was a moment where I was working with staff. My wife thinking about hiring more and more people. But I was like, let me see if my brother wants to do it. He was like, yeah, I want to do that. I was like, oh, okay, cool, you're hired. And so I thought, let me use this business that I have this asset to take care of everybody. So my wife, she writes long form scripts for YouTube. She also writes all of the short form content. She also edits and publishes the long form content on YouTube. My brother does short form edits and he does all of our customer service and then I do literally everything else. So I read the scripts and into, into camera, do email marketing, podcasts, I do articles. So all the stuff with the website, any technical things that need to be taken care of, any admin things that need to be taken care of. Pretty much fill in all the gaps of like running a business. I do all of it and we all get paid the same so that nobody feels superior over. I don't feel like a boss. No one feels like a boss. I don't, you know, need to make more than everybody else just because I own the company. I want everyone to be taken care of that's the point. It's kind of a rising tide lifts all boats scenario.",
      "start": 568460,
      "end": 640730
    },
    {
      "speaker": "C",
      "text": "Yeah. All right, well, let's talk about shiny object syndrome. You start a lot of things and you have a lot of cool side projects. Tell me a little bit more about that.",
      "start": 640730,
      "end": 647450
    },
    {
      "speaker": "B",
      "text": "Yeah, I started side business, the first one. Oh, my God. I try to build a social network for dogs. That was bad. That was in 2008. And it was like to learn code. Also, I started a business called Roasty Coffee, which was a basically taking the swimming diversity playbook and thinking to myself, okay, it took me all these years to get where I am because it was all trial and error. Now that I know everything, can I do it in like half the time or faster? It got pretty big. I was getting like a hundred thousand uniques a month by the end of it. Took two years to get there and ended up selling that business, which then took off. And then I have Money Lab, which is a. Where I get to talk about this kind of stuff, which is still kind of going. It's mainly just a podcast now, more for documentation. And then I have Brew Cabin, which it's something I'm so interested in and so passionate about that I don't want to turn it into a business and ruin my love of it, if that makes sense. So I need to have something. For me, the thing that I'm really actually passionate about should just be kind of my thing for me. As soon as you turn it into a business, as soon as the financials bleed in, starts to become a little bit. That sullies it a little bit.",
      "start": 647450,
      "end": 714780
    },
    {
      "speaker": "A",
      "text": "Yeah.",
      "start": 714780,
      "end": 715140
    },
    {
      "speaker": "C",
      "text": "All right, let's talk about day in the life. We are out here in the beautiful summer of Denver, Colorado.",
      "start": 715140,
      "end": 719460
    },
    {
      "speaker": "B",
      "text": "That's right.",
      "start": 719460,
      "end": 719820
    },
    {
      "speaker": "C",
      "text": "What does the day in the life look like for you?",
      "start": 719820,
      "end": 721260
    },
    {
      "speaker": "B",
      "text": "I get up at like 7 to 8 and stay in bed until 9, watching TikToks. If I'm being super honest. Then I get up and make breakfast every morning. I'm a breakfast head, Coffee, coffee head as well. And then I get to work around 10, 11, and I'm usually done by like 5 or 6, depending on if I have anything to watch at night or do anything at night. Sometimes I'll come out here into the brewery, which is behind you, do some work there. Any sort of like soft work that doesn't require me being on a computer. Yeah, I don't work weekends, so I try not to, at least unless I'm super pumped about an idea. But otherwise, yeah, that's it. Yeah, kind of nine to five, a little bit.",
      "start": 721260,
      "end": 757150
    },
    {
      "speaker": "C",
      "text": "What have been any challenges or struggles you've had while building this business?",
      "start": 757150,
      "end": 761710
    },
    {
      "speaker": "B",
      "text": "Oh, just the slowness I think of it. It doesn't want to skyrocket. It's just like a huge boulder that I've been slowly pushing up a Mountain for 20 years or almost 20 years. And I feel like I always want to push really hard on it. I always want to, like, get really aggressive with it. And every time I do, I end up, like, burning myself out and then having to, like, basically go, okay, this business just needs what it needs and it does what it does. And I've struggled with, like, making the right decisions, you know? And Again, talk to ChatGPT sometimes. Come out here. Talk to myself sometimes.",
      "start": 762110,
      "end": 793110
    },
    {
      "speaker": "C",
      "text": "All right, final question that we ask to all of our founders is if you could sit on the shoulder of Matt when you're just getting started out.",
      "start": 793270,
      "end": 800190
    },
    {
      "speaker": "B",
      "text": "Oh, yeah.",
      "start": 800190,
      "end": 800670
    },
    {
      "speaker": "C",
      "text": "What advice would you give to him? What advice would you give to founders just getting started out?",
      "start": 800670,
      "end": 804350
    },
    {
      "speaker": "B",
      "text": "I definitely know what I would say to myself. Keep making content. Just keep making content. Get better at writing. Keep making videos. Because I keep stopping, I keep shifting, and I keep thinking, oh, this will solve the problem or this will be better. But no, every time I make content, whether that's a blog post or a video or a short form or an email, business moves. Business is good. When I don't, that's when it suffers because that is the entire business model. It is a content business. And there's just a lot of times I don't want to write about pools or I don't want to talk about pools, but that is the business. That is what I have to do. That is my job.",
      "start": 804350,
      "end": 838320
    },
    {
      "speaker": "C",
      "text": "Yeah.",
      "start": 838320,
      "end": 838760
    },
    {
      "speaker": "B",
      "text": "So as far as what I would tell other people to do, think about lifestyle over business. I don't think about money as the outcome because, like, there's a million things I could have done to make way more money than I'm making now. And that would have been like, oh, I would have had a team of people and it would have been a nightmare to manage, and I would have hated my life. So I constantly think about whether or not the decision I'm about to make will have a negative effect on just my. The life that I want, which is essentially super freaking easy.",
      "start": 839080,
      "end": 866620
    },
    {
      "speaker": "A",
      "text": "Yeah.",
      "start": 866620,
      "end": 866980
    },
    {
      "speaker": "B",
      "text": "I love it. Yeah.",
      "start": 866980,
      "end": 868020
    },
    {
      "speaker": "C",
      "text": "Thanks for having me.",
      "start": 868420,
      "end": 869300
    },
    {
      "speaker": "B",
      "text": "No, thank you for coming.",
      "start": 869300,
      "end": 870020
    },
    {
      "speaker": "C",
      "text": "Yeah.",
      "start": 870020,
      "end": 870420
    },
    {
      "speaker": "B",
      "text": "Awesome.",
      "start": 870420,
      "end": 870980
    },
    {
      "speaker": "C",
      "text": "Follow this advice and you will have a multimillion dollar pool cleaning content company. Good luck.",
      "start": 870980,
      "end": 875820
    },
    {
      "speaker": "A",
      "text": "Hey, guys. I really hope Matt's story inspires you and maybe motivates you to start your own thing. But if you're feeling a bit lost and not sure where to start, go click that first link in the description. We're hosting a free workshop for all of our subscribers where I will share how I built a million dollar business on just two hours of deep work every day. We'll cover exactly how I found the idea, how I executed on it, and how I was able to quit my job just a few months after starting it. Just head to the first link in the description to save your seat. Hope to see you guys in there. Much love and I'll see you in the next video. Peace.",
      "start": 875980,
      "end": 910670
    }
  ]
}