{
  "source": "/home/salouri/Projects/starter_story/transcripts/OKl0C3zg0LU/OKl0C3zg0LU_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "This guy made over 2 1/2 million dollars selling digital products. And the crazy part is he creates them using a free platform notion. I flew out to Denver, Colorado to ask him more about these products, why they sell like hotcakes, and the simple launch strategy that created a million dollar business essentially overnight.",
      "start": 160,
      "end": 21200
    },
    {
      "speaker": "B",
      "text": "I had made a template for myself, launched it and I think we did $90,000 within 30 days just from an email launch to 3,000 people on a wait.",
      "start": 21200,
      "end": 31200
    },
    {
      "speaker": "A",
      "text": "A few years ago, Thomas was running a YouTube channel with almost 3 million subscribers. He was getting millions of views, but he was starting to burn out. So he decides to start a brand new channel from scratch and along the way finds a strategy that makes him over $100,000 a month without having millions of subscribers.",
      "start": 31980,
      "end": 52060
    },
    {
      "speaker": "B",
      "text": "Marketing strategy around niche is what I sort of model my own after and what I look towards as the gold standard for it.",
      "start": 52860,
      "end": 59460
    },
    {
      "speaker": "A",
      "text": "In this video, Thomas will share his blueprints on how to how to find million dollar niches on YouTube, how to build a million dollar creator funnel, and how he would start a million dollar business from scratch on a budget.",
      "start": 59460,
      "end": 72130
    },
    {
      "speaker": "B",
      "text": "Distribute for free on distribute for free on whatever you want.",
      "start": 72450,
      "end": 76490
    },
    {
      "speaker": "A",
      "text": "I'm Pat Walls and this is Starter Story.",
      "start": 76490,
      "end": 79730
    },
    {
      "speaker": "B",
      "text": "How's it going?",
      "start": 80850,
      "end": 81530
    },
    {
      "speaker": "C",
      "text": "Thank you for having me, Thomas.",
      "start": 81530,
      "end": 82770
    },
    {
      "speaker": "B",
      "text": "Thank you for letting me be on your show. Yeah, man.",
      "start": 82850,
      "end": 85330
    },
    {
      "speaker": "C",
      "text": "Tell me about this amazing business you built.",
      "start": 85570,
      "end": 87650
    },
    {
      "speaker": "B",
      "text": "Yeah, so for the most part I make videos teaching people how to be more organized, get more done. The main chann called Thomas Frank is coming close to 3 million subscribers. I think it's around 180 million views lifetime. And then I have a side channel called Thomas Frick Explains that does nothing but teach notion. I think we're up to 230,000 subscribers, about 60 or 70,000 on our core notion email list and 200,000 on our full email list. We've sold about two and a half million dollars worth of templates at this point for about 30,000 customers.",
      "start": 87730,
      "end": 119230
    },
    {
      "speaker": "C",
      "text": "All right, break down your business a little bit more for me.",
      "start": 119230,
      "end": 121630
    },
    {
      "speaker": "B",
      "text": "Okay, so we have two premium Notion templates that we sell. One is called Ultimate Brain, which is a personal productivity template. So it combines task management, note taking, project management. It's got useful dashboards for daily planning, GTD stuff like that. And then we have Creator's Companion, which is just our exact social media and YouTube and blog management template. Basically productized creators obviously use creators companion. We have creators who have actual teams using it, all the way down to solo creators just getting started on YouTube and then all kinds of people use Ultimate Brain. Professional students, just People from all walks of life use that template now with Thomas Frank explains. We do a few hundred thousand views a month. Those funnel into a lot of times free templates to our email list and in many cases just direct purchases of our premium templates as well.",
      "start": 121920,
      "end": 164470
    },
    {
      "speaker": "C",
      "text": "In our previous interview, our written interview on Starter Story, you talked about the power of studying successful founders and studying how they built their business. Can you tell me more about that?",
      "start": 164470,
      "end": 172670
    },
    {
      "speaker": "B",
      "text": "Yeah. This is something that I've been doing ever since I started the blog all the way back in 2010. I've never been a course learner. When I want to learn something, I just go and deeply observe somebody who I admire. And usually that's not like a strategic decision on my part. It's what seems like the most fun decision on my part. And when you do that, over time, you just kind of observe what people are actually doing at a world class level instead of going through course material. I think in many cases you can learn the exact same things.",
      "start": 172670,
      "end": 200990
    },
    {
      "speaker": "C",
      "text": "Yeah.",
      "start": 201070,
      "end": 201550
    },
    {
      "speaker": "A",
      "text": "As you just heard from Thomas, he grew his business by studying world class founders and seeing what they're actually doing, the products they sell, their launch strategies and the growth channels they use. Now imagine there was a place that gave you access to all of this place where you can see exactly how simple ideas turn into million dollar online businesses. That is the power of starter story. Over 4,000 case studies and business idea breakdowns, all backed by real revenue data from real entrepreneurs. So if you're serious about building a million dollar business like Thomas, head to the first link in the description and you're going to get our free database of 102 digital product ideas that are making millions right now, just like Thomas'. And if you're serious about million dollar online business, consider joining us at Starter Story. Much love and I hope you guys enjoy the rest of the video with Thomas Peace.",
      "start": 201550,
      "end": 255510
    },
    {
      "speaker": "C",
      "text": "So tell me about your backstory. How do you get to this place where you built this business?",
      "start": 255910,
      "end": 260790
    },
    {
      "speaker": "B",
      "text": "Going into college, my thought was I have to be as competitive as possible just to get a job. What this led me to do was start reading blogs like Lifehacker. And crucially there was another one called Hack College, which was Lifehacker for college students. I thought it might be fun to write for them when they put out a call for new writers. So I spent a whole writing a guest blog post I thought would knock their socks off and they rejected me. I'm glad they did though, because I took that blog post I wrote for them and I started up my own website, collegeimbogeek.com I just started writing throughout a lot of my college years. It was purely for fun. Just I was like building up stuff I wanted to share. All the little life hacks I was kind of implementing myself. And then we started YouTube in 2014. Again, a lot of just like I'm imitating the people I admire. I was posting videos every single week. The channel eventually grew up to a million subscribers. Every video was sponsored. I felt pressure to get 100,000, 200,000 views on every single video. It became the job and it sort of had sucked a little bit of the creative freedom out of it. For that reason, in 2020, I had made a couple of Notion videos for the main channel that did well. And I was getting so into the software that I wanted to make more niche videos. But I'm like, it just doesn't fit on the main channel. Super niche tutorials. It just isn't a good branding play. So I decided to start a brand new channel and I started having fun again.",
      "start": 260950,
      "end": 335470
    },
    {
      "speaker": "C",
      "text": "You got this bigger channel, but now you're getting excited about Notion and something else. Tell me about that transition for you.",
      "start": 335870,
      "end": 341550
    },
    {
      "speaker": "B",
      "text": "Yeah. So we launched Creators Companion within the first couple of months. I think it was about $3,000 per month. Eventually scaled up to $15,000 a month within the first six months of launch. Then when we launched Ultimate Brain, I think that was 90 grand from a wait list of 3200 people. And then we made a video on Thomas Frank explains. Just going through the template, it was a 45 minute video. Like the whole video is an ad. But I'm showing so much of it that I feel like it's still educational because people will be able to replicate parts of it if they want to without buying it. The video did so well that it goes up to 100 grand a month. Another thing that I had set up from the very be with Creators Companion was active support. If anyone comes in, number one, if it's just not for them, they can get a refund. But if they're stuck or they want to customize or whatever it is, they should be able to get support. So I was doing that support for eight hours a day for at least a full month. I actually think this is something that founders should do because you just get really in tune with how people perceive your product and how easy it is for them, what their pain points and sticking points are. But at that point, it's like, now we're making between 100 and 120 grand a month and now there are all these new opportunities. That just sort of put the main channel on the back burner every month for almost two years.",
      "start": 341630,
      "end": 408680
    },
    {
      "speaker": "C",
      "text": "Yeah. Let's talk about how notion templates work. What's your process for creating a great notion template that you can sell online?",
      "start": 408680,
      "end": 415120
    },
    {
      "speaker": "B",
      "text": "Yeah, Notion template is a page in Notion that you make public and you take the little box that says able to be duplicated and that's it. So to create a notion template, you just make something useful either for yourself or for a client or for an audience. Put the link out there, sell access to the link. Creators Companion was just an evolution from 2018 all the way to 2021 of everything we needed to make our YouTube videos. And then we just went to the process of polishing it up, adding a few more features like a content repurposing dashboard and stuff like that, packaging it up and selling it for Ultimate Brain. It was a similar thing where I had made a task management template for myself and I'm just like, let's build on top of that. So note taking, getting things done, workflows, project management, goal tracking, all kinds of stuff like that. Packaging it up.",
      "start": 415840,
      "end": 457820
    },
    {
      "speaker": "C",
      "text": "Can you break down what the customer journey or the funnel looks like for a million dollar notion templates business?",
      "start": 457820,
      "end": 462940
    },
    {
      "speaker": "B",
      "text": "Yeah. So Thomas Frank explains is the main way that people find us right now, especially for notion templates, because we just have all these videos teaching people how to use notion for free. So we have build guides. This is literally, I'm going to teach you how to build a habit tracker or task manager. Those build guides always include a free template as well. We also have notion new feature releases because people are searching for content about new features, fundamentals, content. So we have like a whole like sort of free beginners course on how to learn notion from scratch. And then we have listicle, kind of like fun popcorn content, like 10 ways that you're using notion wrong, things like that. Our videos will do one of three things. They will pitch a paid template, they'll pitch a free template that's for the build guides. Or they'll just say like, hey, we've got a resource page here with all of our notion fundamentals content cheat sheets. We have all kinds of like cool resources you're going to want. So get in our email list and then from there, first thing I do is send them an autoresponder saying like, hey, enjoy your free templates. Here's a link to all my other free templates. But if you want to upgrade to full productivity and notion, you can get Ultimate Brain. Here's a discount code for Being a subscriber?",
      "start": 463630,
      "end": 523570
    },
    {
      "speaker": "A",
      "text": "Yeah.",
      "start": 523719,
      "end": 523999
    },
    {
      "speaker": "C",
      "text": "How about pricing? How did you decide on the pricing for your products?",
      "start": 523999,
      "end": 526519
    },
    {
      "speaker": "B",
      "text": "My thought was if you could run your entire creator business, from idea capture to publishing, have like a full archive of all your scripts, everything in one tool. People will probably pay tens, hundreds of dollars a month for that. So let's at least charge over $100 initially price creators companion at $99 and $149 for the higher edition at launch. Right now we're at, I think it's 129 for Ultimate Brain alone, 229 for the full bundle edition. And that's what most people buy if they are getting Creators Companion. Sales do pretty well. We did last year and we saw volume dip a little bit, but overall revenue went up.",
      "start": 526679,
      "end": 560180
    },
    {
      "speaker": "C",
      "text": "All right, so let's talk about tools. What kind of software and tools do you use to run this business?",
      "start": 560340,
      "end": 565060
    },
    {
      "speaker": "B",
      "text": "Well, notion for one. Definitely dog food. Our own software and we use our own templates. Notion templates can be easily pirated since they're just a link. So what I am concerned about is maintaining paid access to our support. So we use Circle, so we have actual customer logins for that. For point of sale, we use Lemon Squeezy. I like them because they actually act as merchant of record, so they completely handle product taxes for you. We use ConvertKit for email marketing. We've got a lot of actual funnels and automations and autoresponders as well as our newsletter. We use a lot of pipedream actually. So Pipe Dream is automation software, kind of like Zapier, but sort of built for developers. That's all JavaScript and Node JS.",
      "start": 565380,
      "end": 603350
    },
    {
      "speaker": "C",
      "text": "All right, let's talk about what does it cost to run a business like this?",
      "start": 603350,
      "end": 606390
    },
    {
      "speaker": "B",
      "text": "So if you were building this, it would really just come down to some camera gear, some video gear, and then you could build a framer website for 15 to 30 bucks a month, depending on how content heavy it needs to be. Distribute for free on YouTube, distribute for free on Twitter, LinkedIn, whatever you want. And that would be kind of it for the actual SaaS cost to run a business like this, you could get it under a few hundred bucks a month.",
      "start": 606630,
      "end": 626750
    },
    {
      "speaker": "C",
      "text": "Let's talk about YouTube.",
      "start": 626830,
      "end": 628110
    },
    {
      "speaker": "A",
      "text": "You're an experienced YouTuber.",
      "start": 628110,
      "end": 629350
    },
    {
      "speaker": "C",
      "text": "You've used YouTube to grow this business. What kind of advice would you have for other people looking to start on YouTube?",
      "start": 629350,
      "end": 635870
    },
    {
      "speaker": "B",
      "text": "Essentially, when you're starting out, you need to get reps. You need to go through a feedback cycle where you learn, you try stuff out and then you publish. So you get feedback what you basically gain when you do this, when you go through this process of publishing on a schedule and trying to improve something small every time, is you get a body of work that just slowly compounds your skills over time. And you wake up three years later and you're like, whoa, I know color grading, I know audio editing, I know how to build a set. I know animation. I can speak to the camera a lot better. And I got to learn all that while I published content that got to grow my business and build an audience and all that kind of stuff. So do whatever you have to do to make sure you publish on the schedule and try to get just a little bit better at something interesting every single time you publish.",
      "start": 635870,
      "end": 676400
    },
    {
      "speaker": "C",
      "text": "Okay, let's talk about the power of a niche channel. This new channel that you created is a lot smaller than your bigger channel, but it makes more money. You can tell me more about that.",
      "start": 676640,
      "end": 684480
    },
    {
      "speaker": "B",
      "text": "So the power of a niche channel is you're not necessarily trying to interest people in you. You're building content about something that they're probably already interested in. Notion already has a ton of people who are trying to do things. They're looking for answers. So I'm fulfilling demand that's already there. Zapier's marketing strategy around niche is what I sort of model my own, my own after, and what I look towards as the gold standard for it. So Zapier is automation software. That's a very small niche, really small. But there's a wider group of people who are interested in the top calendar apps, the top productivity software. So when you look at Zapier's marketing, they cast this a little bit wider net that's still very focused on workflow and productivity software. And there's going to be a smaller purchase proportion of people in that group who are like, oh, I wanted to connect up these two apps and, oh, your tool can do that for me. You need to figure out what are people looking for. So you bring them in and then you show them. We can do this thing that some of you want. Yeah.",
      "start": 684720,
      "end": 740300
    },
    {
      "speaker": "C",
      "text": "All right, let's talk about how this business can be replicated across potentially other software or other channels. What would be your advice for someone trying to start something similar?",
      "start": 740300,
      "end": 748940
    },
    {
      "speaker": "B",
      "text": "So don't assume that niche software plus templates is the only way you can kind of monetize this. It could be any kind of niche where there is groundswell. And if it's a smaller niche, is that niche or businesses, is IT Enterprise? Would 110 of the views bring in the same amount of revenue? And then the Business model could be consulting, could be courses, could be templates, could be any kind of. It could be SaaS. You build on top of all kinds of stuff that helps people who are already using that software.",
      "start": 749580,
      "end": 774690
    },
    {
      "speaker": "C",
      "text": "Let's talk about day in the life. What is the day in the life for notion entrepreneur?",
      "start": 774770,
      "end": 779410
    },
    {
      "speaker": "B",
      "text": "Typically up at 6:30, make coffee, do a bit of deep work in the morning. Kind of like you go to the gym, usually at the gym for an hour or two, come back here and then from there. My days are very variable because some days I'm doing CEO kind of stuff, some days I'm filming videos, some days I'm working on templates. Just depends on what my schedule demands.",
      "start": 779730,
      "end": 799440
    },
    {
      "speaker": "C",
      "text": "In your journey, is there anything that you've personally struggled with or is anything that's been a challenge in your journey building a business?",
      "start": 799440,
      "end": 806240
    },
    {
      "speaker": "B",
      "text": "I would say that the biggest challenge that comes to mind right now is self doubt and how that combines with wanting things to be perfect before I put them out into the world. When I got started with videos, I had this feeling that I could make the perfect video and put it out. So I spent like weeks working on it and then never ended up publishing it. I have like this perfectionist tendency and it's just at odds with the truth that you have to actually publish and get feedback and go through that cycle and make it as tight as possible. So I guess my biggest piece of advice for people who feel the same is it doesn't matter if you get harsh feedback because you're gonna learn from it and it's gonna make the thing you publish next better.",
      "start": 806559,
      "end": 841250
    },
    {
      "speaker": "C",
      "text": "What advice would you have if you could sit on young Thomas's shoulder or advice for someone who's just getting started out and who wants to build a business that changes their life, the main.",
      "start": 841890,
      "end": 850690
    },
    {
      "speaker": "B",
      "text": "Thing I would say is start building friendships with other people who are ambitious and who also want to build businesses. I have this, this term that I use a long time ago called fan first, where it's just like, become a fan of people that you're interested in, share their stuff, be commenting. Because eventually you paying attention to them often leads to conversations, leads to meetings, at conferences, leads to friendships. And then you have this network of people who inspire you. You can help each other out. That's how you succeed in business. I think even if you are building your own business solo, it's not done alone. Because anyone who's successful, I think, is surrounded by other people in their network, in their friend group who are constantly giving them advice, giving them feedback, giving them everything they need to succeed.",
      "start": 850690,
      "end": 890720
    },
    {
      "speaker": "C",
      "text": "All right, thanks for having me, Thomas.",
      "start": 890880,
      "end": 892800
    },
    {
      "speaker": "B",
      "text": "Absolutely.",
      "start": 892800,
      "end": 893320
    },
    {
      "speaker": "A",
      "text": "Follow this advice and you will be.",
      "start": 893320,
      "end": 895040
    },
    {
      "speaker": "C",
      "text": "A millionaire with notion.",
      "start": 895040,
      "end": 896400
    },
    {
      "speaker": "A",
      "text": "All right, guys, that's it. I hope you liked the video. Personally, what I love about Thomas's business is that he's selling a digital product. And for the most part, these products cost nearly $0 to create. If you're also curious about this, head to the first link in the description and you're going to get our free database of 102 digital product ideas that are making millions right now, just like Thomas's. All right, guys, I'll see you in the next one. Peace.",
      "start": 896480,
      "end": 922190
    }
  ]
}