{
  "source": "/home/salouri/Projects/starter_story/transcripts/TNZmNIYv050/TNZmNIYv050_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "What's your story?",
      "start": 240,
      "end": 800
    },
    {
      "speaker": "B",
      "text": "I'm an anonymous designer on X and I make $1.2 million a year. Being anonymous gives me some peace.",
      "start": 3040,
      "end": 10000
    },
    {
      "speaker": "A",
      "text": "This is Nick Buzz, an immigrant turned millionaire who started his journey in India. But in the beginning, nobody believed in him.",
      "start": 10480,
      "end": 20480
    },
    {
      "speaker": "B",
      "text": "I went back to my dad and I said, okay, I'm not doing engineering. I'll do animation. And instant reaction was these scribbles or paintings will not make you any money. Don't come back to me. CR things don't work out.",
      "start": 20720,
      "end": 33020
    },
    {
      "speaker": "A",
      "text": "With all the odds stacked against him, Nick left India to chase his dreams. At just 17 years old, I didn't.",
      "start": 33260,
      "end": 40460
    },
    {
      "speaker": "B",
      "text": "Have any plans around, like what I'll be doing in Canada. What's the future like? I never took a plane anywhere. It was just escape. I have to prove him and myself that I can make a living out of design.",
      "start": 40460,
      "end": 53100
    },
    {
      "speaker": "A",
      "text": "After months of struggle, Nick's dreams started to come to life.",
      "start": 53500,
      "end": 57740
    },
    {
      "speaker": "B",
      "text": "So I was making around like 80 or $90,000 a year just doing freelancing. I was like happy. I was burnt out. Like I was working 16 to 18 hours at some point, 20 hours a day, just working, working, working. No friends, no personal life, never going out to do anything. I didn't like the direction that I was going in.",
      "start": 57820,
      "end": 80350
    },
    {
      "speaker": "A",
      "text": "When he thought he finally had it figured out, it all came crashing down.",
      "start": 80590,
      "end": 85550
    },
    {
      "speaker": "B",
      "text": "I couldn't even spend money because I didn't have any money. If I had to do something, it has to be now. I had like, I think two months of savings. That's when I was like, okay, I'm leaving.",
      "start": 85710,
      "end": 94510
    },
    {
      "speaker": "A",
      "text": "With everything on the line, Nick takes the leap and decides to finally build a business that changes his life. But this time he'll do it differently.",
      "start": 95390,
      "end": 105470
    },
    {
      "speaker": "B",
      "text": "I didn't want any attention on who I am and where I'm coming from. I don't want anyone in my family to know that I was doing something. Being anonymous, I don't have to think about all of that.",
      "start": 105630,
      "end": 116830
    },
    {
      "speaker": "A",
      "text": "And that's when everything changed.",
      "start": 117070,
      "end": 120110
    },
    {
      "speaker": "B",
      "text": "In August, we took it to $24,000. Next month we made 48,000 recurring revenue. 94,000 dol. 110. 120. 160.",
      "start": 120190,
      "end": 130170
    },
    {
      "speaker": "A",
      "text": "This is the story of how Nick Buzz went from immigrant to making $1 million a year without ever having to show his face online. Welcome to Starter Story.",
      "start": 130810,
      "end": 141930
    },
    {
      "speaker": "B",
      "text": "I come from a lower middle class family. My dad is a police. He always wanted me to do engineering or doctor or anything that has to do with computers or. Because that's the usual direction every kid takes. But I was into arts a lot I used to draw arts was one way I could just go deep and be me. So I went back to my dad when he was sleeping around I think 1 or 2am I woke him up and I said okay, I'm not doing engineering. This is not going to happen. I'll do animation. And instant reaction was these scribbles or paintings will not make you any money. Don't come back to me crying if things don't work out. When that happened I was like, okay, I have to prove him and myself that I can make a living out of design. To do that. I used to always be in my room just working, working, working. No friends, no personal life, never going out to do anything. I have to like do this, make this happen, make money, pay things, see how far I can go.",
      "start": 148490,
      "end": 206400
    },
    {
      "speaker": "A",
      "text": "Nick decides that he doesn't want to take the traditional path. Instead, while still in India, he he chooses to learn design and to sharpen his skills and make his first dollar. Nick starts to compete in logo design contests.",
      "start": 209120,
      "end": 224910
    },
    {
      "speaker": "B",
      "text": "I think I participated in around 200 odd competitions. Just work, work, work. The friend who suggested that I should get into logo designing around 6 month mark he asked me what's happening? I said no, I'm not making any money. He said give up, it's not going to happen. It's too long. I think you should know when to back out. I didn't say anything to him, I just said let me try. What's there to lose?",
      "start": 225230,
      "end": 245730
    },
    {
      "speaker": "A",
      "text": "Six months into his design journey, despite all the efforts, Nick saw no results. Then one day it all changed.",
      "start": 246210,
      "end": 255730
    },
    {
      "speaker": "B",
      "text": "My parents were out and they asked me how do you want to come to us this party? I said no, I think I'll stay here, try to see if I can win this contest. And I won the contest. I was jumping on the bed. It was too much for me for a 17 year old to earn like I think 10,000 rupees or $200. Back then parents came home, I told them like I want $200. They're like skipped. No way. No one is paying you on Internet.",
      "start": 256050,
      "end": 278330
    },
    {
      "speaker": "A",
      "text": "Nick knows that design can make him a living. So he decides to enroll in a local college. But there's still a problem. His friends and family in India are doubtful that this is anything more than a fun passion project. So he starts looking for an escape.",
      "start": 278410,
      "end": 296160
    },
    {
      "speaker": "B",
      "text": "They had a college affiliated in Canada in Toronto. I didn't have any plans around like what I'd be doing in Canada. What's the future like? I never took a plane to anywhere. It was just escape my parents, people around them, my friends and people around them, a lot of them doubted that you could actually make money or design is a thing. Canada was an escape in Nick's head.",
      "start": 296640,
      "end": 322010
    },
    {
      "speaker": "A",
      "text": "Canada is the ticket to living his dream. People are way more open minded. There's lots of design jobs and it's going to be easier to land a position with his skill set. So he scrapes together all the money he made so far with freelancing and moves to another side of the planet by himself. At 17 years old, I thought, like.",
      "start": 322010,
      "end": 343650
    },
    {
      "speaker": "B",
      "text": "I could come into Canada, I would have more opportunities. But the problem was I was still 17. I used to send resumes, I used to contact people like no one cared. No one replied back because there's no experience and I'm still a teenager. I was not actively designing, so I didn't make any money. Didn't even have $100. Like, I went to this hair salon in Vancouver after the haircut. She said it cost $150. I didn't have $150. So I called my dad. He was sleeping again. Midnight in India. Asked him to transfer money so I could pay for the haircut. It was bad. I said, yeah, I'm going to make my own living. I don't need anyone's money. And then having to go back to him just to pay for a haircut, yeah, it was not good.",
      "start": 343650,
      "end": 387120
    },
    {
      "speaker": "A",
      "text": "Nick is proof that entrepreneurship can be a lonely journey at the beginning, especially when you aren't making any money yet. And that's because when you're starting a new business, you don't really know a whole lot. You don't know if your product is good, you don't know how to validate it, you don't know how to market it, and you don't know how to monetize or sell. But these are all things you can learn. And the best way to learn is by studying people that have already done it. And that's what Starter Story is all about. It's a library of inspiration, practical advice, and actual case studies that you can learn from and use to grow your business. So if you want to check out Starter Story and learn how thousands of founders just like you turned a simple side project into a business that, that completely changed their lives, then head to the first link in the description. Now back to Nick's story. Nick starts doubting his decision to become a designer for the first time in his life. But he still has the desire to prove everyone wrong. So to have a better chance of making his design dreams work, he decides.",
      "start": 387600,
      "end": 450440
    },
    {
      "speaker": "B",
      "text": "To get a degree When I joined the university, I was taught in English, but it's not my first language. I'm not fluent. It's hard to start a conversation, it's hard to form a sentence because every time you have to translate it in your brain and then speak out. I also was not making money and spending three times the amount that the local student would spend on education.",
      "start": 450600,
      "end": 475480
    },
    {
      "speaker": "A",
      "text": "With an empty bank account, Nick makes a bold move and enrolls into college. But now he's facing a sixteen thousand dollar tuition fee. Then on the first day of his studies, he experiences a miracle.",
      "start": 475800,
      "end": 491040
    },
    {
      "speaker": "B",
      "text": "Around 2016, some dev found me on dribble and the dev recommended me to the client. I just worked with them for like two days and they gave me $3200. I was like happy. I'm like first day of university and I made $3200. I think I can pay half of my tuition fee for the next semester. Little did I know that the client stayed with me for the next three and a half years. So I was making around like 80 or $90,000 a year just doing freelancing.",
      "start": 494000,
      "end": 522030
    },
    {
      "speaker": "A",
      "text": "Even though Nick had a high paying client, the out of state tuition still kept him in the red every month.",
      "start": 522430,
      "end": 528910
    },
    {
      "speaker": "B",
      "text": "I had a girlfriend and she's my wife now. I couldn't buy her stuff. I couldn't even spend money because I didn't have any money. Anytime people used like, oh, let's go out, have fun or just hang out, I didn't do that. I don't even have any friends at the university because I always work, work, work. That's it. Just making sure that I pay my bills and stay here longer.",
      "start": 529390,
      "end": 551770
    },
    {
      "speaker": "A",
      "text": "Nick poured everything into his freelancing clients, but it still wasn't enough. His luck had run out and the income was wasn't what it used to be. But he still wants to make a career out of his passion for design. So he turns to the only option left, a 9 to 5 job.",
      "start": 552570,
      "end": 573620
    },
    {
      "speaker": "B",
      "text": "Facebook came to the university and they had internship session. I did the interview and I got the offer on the same day for an internship. Facebook was out of the world for me. Like I was getting paid 8,000 USD, the brand name. When people know that I work for a certain company, they have a different way of talking to you and they respect you more than normal.",
      "start": 576180,
      "end": 598330
    },
    {
      "speaker": "A",
      "text": "Nick successfully climbs the corporate ladder, proving everyone wrong. But he quickly realizes that his job at Meta is the exact opposite of the dreams that fueled him to leave India in the first place.",
      "start": 598570,
      "end": 611530
    },
    {
      "speaker": "B",
      "text": "End of 2022 is when I was like, I'm not liking the job, I had to restrict myself. There was no creative freedom. You get tired doing the same thing for too long, so I shouldn't move out. But I didn't know what I should be doing. And I asked my wife, and she was like, you should do business. Try to see if you can make money. If you don't make, you can always go back and do nine to five. I was never a believer in that. Like, I was like, I'm scared. If I don't make money, I can't pay the mortgage bills, the car loans and all of that. So I didn't want that on my head. But we were pregnant. Baby's on the way. If I had to do something, it has to be now. I had, like, I think two months of savings. That's when I was like, okay, I'm leaving.",
      "start": 615050,
      "end": 657730
    },
    {
      "speaker": "A",
      "text": "With his back against the wall, Nick decides he has to make this entrepreneurship thing work. So he goes to the one place online where entrepreneurs thrive. Twitter. But he doesn't want to be in the spotlight. He doesn't want to share his identity. He wonders if there's another way.",
      "start": 658610,
      "end": 679190
    },
    {
      "speaker": "B",
      "text": "Being anonymous gives me some peace. I didn't want any attention on who I am and where I'm coming from, so I just wanted to, like, post whatever I want. I get really bad migraines where that's too much, and I don't want anyone in my family to know that I was doing something again. The same people will come back saying, why did you leave meta? Like, that's a good job being anonymous. I don't have to think about all of that. I'm still me. My personal life is not affected. Also, the main reason was being an introvert. People used to post their landing pages saying, oh, I just designed this landing page and this is my new website. So I just took someone's post code, tweeted it, said roasted, and then added few things that I thought I improved. And it worked. People started like, seeing it. A lot of co tweets and no one reached out to me saying they were going to give me money, but people can see that I can do something.",
      "start": 679430,
      "end": 737480
    },
    {
      "speaker": "A",
      "text": "At this point, Nick has an audience and he's getting his name out there, but still isn't making money from his online business yet. He's having fun again, reigniting his passion for design that he's had since he was a kid. He's waking up every day excited, ready to crack the code to finally making money with his own business.",
      "start": 738040,
      "end": 758690
    },
    {
      "speaker": "B",
      "text": "I said, okay, I'll launch this design kit which will have around like 50 landing pages and I'll charge you $9. People bought it. That actually gave me some assurance that, okay, I can make money from this venture. And then moved into the entire Get Bait, where we started charging $50 at one point for a landing page, and then 100, 150, 200, 250, $300. We made around six or $7,000 in one month at peak.",
      "start": 758930,
      "end": 789620
    },
    {
      "speaker": "A",
      "text": "Nick gets his first taste of entrepreneurial success. This is what he was looking for all along. Anonymity, creative freedom, stable income, all while doing what he loves. He was launching projects one after another, following his curiosity and diversifying his income even further. But as they say, what comes up.",
      "start": 789780,
      "end": 812720
    },
    {
      "speaker": "B",
      "text": "Must come down at some point. I was doing 18 to 10 different projects, max, I think 12 projects. I was burnt out. Like, I was working 16 to 18 hours at some point, 20 hours a day. It was good to have so many income, income streams coming in. But your focus is also all over the place. You don't know what to do. I was doing too many things. I. I didn't like the direction that I was going in.",
      "start": 813200,
      "end": 836920
    },
    {
      "speaker": "A",
      "text": "Nick realized that he had way too many projects. If he wanted to become successful, he'd have to focus on just one of them. But he couldn't decide which one had the most potential. Luckily, one day he got a recommendation from a fellow designer named Alex.",
      "start": 837160,
      "end": 854640
    },
    {
      "speaker": "B",
      "text": "When she said, we should start baked, I said, no, I don't believe that. The market needs one more design subscription agency. She said, oh, yeah, okay. But after one or two weeks, she came back saying, oh, yeah, I have the website. People liked it and all of that, but no one paid for it. No one wants to pay 5,000 or 6,000 or even $2,000. So we went back to roasting Nick.",
      "start": 855200,
      "end": 877400
    },
    {
      "speaker": "A",
      "text": "And Alex launch a design service where the clients pay monthly. But because of the premium price tag, it didn't take off right away. But then Nick would post something that would change everything.",
      "start": 877400,
      "end": 889770
    },
    {
      "speaker": "B",
      "text": "One client, just like one lead. The server booked a call. Next day, I got on the call and I asked him, like, how did you see our work and why did you come to us? He said, I saw your tiny UI post. I was like, oh, my God. Like, that's the worst product launched. And you had to come through that. But I'm glad he did. And he was our first client who I think we charged $4,317 per month for the. On 317, You constantly have to market yourself. You have to be out there. You have to be aggressive. You have to have a tone that Brings people in. It's okay if you're controversial. It works. End of July is when we made our first money from baked. And then in August we took it to $24,000 monthly recurring revenue. Next month we made 48,000 recurring revenue. 94,110, 120, 160. And then flatlined to like 120, 100. And with Alex, we both worked together, just us, only two of us till December when the baby was born. I had to take time off and Alex took over. And after I came back, yeah, we started hiring. We always have like one person who's full time and then few part time freelancers. Life made me really nice. It's much better in terms of quality of life. I can just throw money at the problems instead of thinking about them. Oh, nanny, she wants 4,000, $5,000 per month. No issues. I can pay for that. My dad was here, my mom was here and he was sorry. It's like I shouldn't have said that. I should have at least believed in you or given you some time to see what you can do instead of just saying don't come back home. He has no idea what to do. Mom has no idea what. They just know that I make money and they're happy about it. That's it coming from me. I think you should never doubt yourself. I know it's hard to like not see results instantly. Just trust the process. Believe in what you're doing. Don't just waver into like 100 other things just because you can. It's okay to start anonymous or just faceless account while you do that. Be as authentic as possible. Don't be a guy who's just pushing out marketing or money related stuff. Talk to people, interact with them. Tell your story in a way that people are inclined to talking to you. Build a community and be with them. And once you feel like you can come out of it, the anonymity, feel free to do it. You have to take the leap. No one's going to do it for you.",
      "start": 890490,
      "end": 1056320
    },
    {
      "speaker": "A",
      "text": "The best part about Nick's story is that he didn't to want wait for permission to chase his dreams. He just went for it. He took the leap. But sometimes it's scary to take the leap. Especially when you're new to entrepreneurship because you don't know much. Well, the best way to learn what you don't know is to study people who know what you don't. That's why I created Starter Story. It's a library of over 4000 case studies ideas and stories that you can learn from and apply to your own business. So if you're still feeling a bit lost, I'm going to be giving you a free list of 160 Solopreneur business ideas to help you get inspired and start building your own thing. It'll include a bunch of winning ideas, strategies, and other cool information about how regular people built businesses to millions of dollars. Just click the link in the description. Also, if you want to actually get serious about building your idea, then consider joining Starter Story and we will help you do that. I really hope you guys enjoyed this new format, this Faceless Millionaire style of video. We're cooking up some more new stuff, so stay tuned. All right, I'll see you guys in the next one. Peace.",
      "start": 1056800,
      "end": 1123170
    }
  ]
}