{
  "source": "/home/salouri/Projects/starter_story/transcripts/uBGbvKScavk/uBGbvKScavk_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "Ready when I graduated. After that, I really had no clue what I wanted to do. And so I tried a ton of different hobbies. 2013ish or so. I started gardening with my brother just to like break the pattern, get off the computer, get outside. And I wasn't thinking it would be anything but a hobby. I think curiosity as an entrepreneur is what propels you. And if you innately have it, then you're sort of good to go. My name is Kevin Espiritu and I am the founder of Epic Gardening, which is the world's most followed gardening brand. Bootstrapped it to $7.3 million and now do tens of millions a year in revenue. So we're here at my homestead, I call it, in suburban San Diego. It's about a third of an acre. The house is 1,000 square feet. So pretty small house. Live here with my girlfriend and some random cats that come by. We have nine hens and probably like 300 plus plants, thousands of plants. I'm not even really sure, 25 fruit trees. But this is Epic Gardening headquarters. This is where we film our content. This is where we test our products. This is where we grow out our new varieties of our seeds that we sell and just kind of hang out. I grew up here in Southern California, San Diego, in a suburban area. Was really into science, really into math. Was being sent to science camps as a kid, was collecting rocks, collecting coins. And then something that threw my life for a loop was When I was 13, my dad passed away in an accident. He was in a pool swimming. He loved to swim. And he passed out underwater. Something caused him to go unconscious. No one was there watching. They should have been. And they could not resuscitate him. And so, you know, you wake up one day, you don't have your dad. So. So after that I was very independent. Even before that. I was exceptionally independent after that. And it was that sort of way of thinking that led me to all these weird hobbies and following that path because I really didn't care anymore what anyone thought I should do. So what I did is I left college, graduated. The problem is, after that I really had no clue what I wanted to do. And so I tried a ton of different hobbies. I spent a whole month doing night photography and I spent a whole month drumming. So I would drum for like six to eight hours a day on like an electric kit with headphones on. But yeah, there was just this whole period of time where I was trying a bunch of random things. I meanwhile probably playing some video Games and stuff at the time and just like exploring all these different hobbies. 2013ish or so I started gardening with my brother just to like break the pattern, get off the computer, get outside. I fell in love with it just that one summer. I wasn't that good at it, but I fell in love with kind of the way that you could shape a plant, the way that you could grow it. So I registered a blog and I wasn't thinking it would be anything but a ho. To me. Like having curiosity is what kind of what gives you your edge, at least for me. I'm trying to figure out how everything works. I mean, how to grow plants, how an e commerce business works, how do you learn how to find a product, how do you lead a team, how do you hire all that kind of stuff. I'm just innately curious in that even if I wasn't going to use it. And so sometimes you get really curious. You go down a rabbit hole on something that you don't think has that much purpose, you don't think it has that much use or application. And then lo and behold, a year later, two years later, there it is. I think the blog made like $400 a month. And so I ended up moving in for half the summer with my mom's ex and then after that with a friend of mine. And basically all I did for like 12 hours a day was just write blog articles, like research gardening topics. I was trying everything. I was like in forums, like commenting on stuff and dropping links here and there and just trying to get some traffic. And so yeah, in about two or three, I think the blog was making maybe two or three grand a month. Two, three months after that, as you get towards later that year in 2016, it was making four or five grand a month. So when you start to get to that level on your own project, you're like, okay, like this is maybe an accountant's salary. It's that accountant salary I was gonna make. So maybe there's something here that is the birth of when I decided epic gardening was like a real thing.",
      "start": 1040,
      "end": 275290
    },
    {
      "speaker": "B",
      "text": "After years of trying different hobbies and side projects, Kevin finally landed on the right idea. If you're anything like Kevin and you also dream of finding that one idea that changes everything, then imagine how helpful it would be to save yourself months of spinning your wheels by seeing examples of million dollar businesses started by people just like you. Well, at starter Story, we have a library of over 4,000 case studies and business idea breakdowns where you can see exactly how regular People turn side projects into million dollar businesses. If you're serious about this stuff, head to the first link in the description and you can download a database of $99 million problems we're solving that might give you some ideas. Now back to Kevin and how he actually built this business.",
      "start": 275770,
      "end": 321550
    },
    {
      "speaker": "A",
      "text": "That first year, that first six months full time was about $70,400 in revenue. That's revenue. That's just basically I didn't make any money. The next year, 2017 was 75,000, and after that it was 225. So that would be 2018. 2019 was 540 and 2020 was 2.8 million and 2021 was 7.3. And so we've roughly tripled or more every year up until that point. And there's obviously different reasons why that happened as the business kind of evolved. You know, when you're a creator, you have media brands or product brands that want to send you stuff and they want you to review it or they want to do a brand deal. And that's how we made some money at Epic Gardening back in the day. And so what I started to put together is why would I not just be the brand who would sponsor my own content? It doesn't, it doesn't make sense. Nothing is preventing me from offering my own product line. And what I noticed is there was a particular product that everyone kept asking about in the content. This weird metal corrugated, raised bed that you put soil in and you put plants in that, and voila, you have a garden. So I had racked my brain trying to think, how do I build a product that people will really like that I think is a really good gardening product? And all of a sudden I was just like, they want this product. You have it in your garden. So why wouldn't I just offer it directly to my audience? The problem is I didn't have a product development background. So the way I started was distributing a product that already existed. It just didn't exist in America. So that was the really clicking moment. I slapped up a really crappy Shopify store because I had never done E Commerce before, went on Instagram, put an Instagram story up, and then in two weeks we sold all of them. You know, 250 was media sort of revenue and another 250 was product revenue in 2019. And that's when I went, oh, actually, I've been building the start of a business, but the actual business is beneath the educational material that I was putting out. And that, that was kind of the light bulb Moment. So these days the days are pretty varied. It really depends on the day. I mean, some days it's, it's making a lot of content and making a lot of videos for the people that love what we do and want to learn how to grow plants. So some days it's in meetings, Might be a product development meeting, might be an executive meeting, might be a company that you might want to work with in some fashion. So call it like the CEO type of things. Some days I literally have to block my schedule off so that I can just actually be in the garden doing the thing that I was trying to do all those years ago to get off the computer and to get into nature. And as you've built a business around it, it's obviously hard to find that time sometimes like just true gardening time. Cuz even, even if I'm out in the garden, I'll be like, oh man, I could like, that'd be a cool video. That'd be a cool concept. Oh that, that product. So you can't turn the brain off sometimes. So I've scheduled time to just garden. No agenda. I'm, I can think, but I, I can't really whip the phone out and start making a, a video or something like that. So it's, it's pretty varied these days. I think a lot of beginners will start and they'll say, look, I need to know stuff before I do stuff. And that's of course true to a degree, but you don't need to know as much as you think you need to know. You certainly don't have to have like a fully baked business plan with, you know, perfectly formatted and you get your business cards, you have your registration on your website and all this, it's all in place before you even figure out if anyone wants what you're selling. So I think consume some knowledge. Like try to figure out specifically, I wanna start a YouTube channel. Okay. There are some channels that I could go watch and learn how to do that. But I would really try to immediately put it into action after you consume. Cause I spent so many times just spending my cycles on, I'm gonna learn about this, I'm gonna learn about this. Well, what about this business? But I could do this one and you just get stuck there and you're really just treading water, doing pretty much nothing in the real world.",
      "start": 327070,
      "end": 582160
    },
    {
      "speaker": "B",
      "text": "Hey guys, Pat here. If you're trying to build something but struggling a bit on where to get started or how to stay motivated, then I have something for you. I host a free workshop on how I built a million dollar business on just two hours a day and I go over the exact blueprint of how I found the idea and how I built it while maintaining a full time job. You can reserve your seat in the workshop by clicking the second link in the description, but there are limited spots. I'll see you there.",
      "start": 582890,
      "end": 608090
    },
    {
      "speaker": "A",
      "text": "It.",
      "start": 608370,
      "end": 608610
    }
  ]
}