{
  "source": "/home/salouri/Projects/starter_story/transcripts/gU9FtZIfb_M/gU9FtZIfb_M_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "This guy quit his job and built a $10 million business by accident. And the crazy part is he did it using a marketing method that cost $0.",
      "start": 160,
      "end": 9200
    },
    {
      "speaker": "B",
      "text": "I, from the beginning, knew that we're going to be the secret to our growth.",
      "start": 9520,
      "end": 14560
    },
    {
      "speaker": "A",
      "text": "I invited Ian to my house to deep dive with him. Ask him exactly how his business works, how he got his first customer, and how he grew it to over $10 million a year in just three years. Before all this success, Ian was chasing empty dreams with working for others in finance and vc. But eventually he had enough.",
      "start": 14800,
      "end": 34130
    },
    {
      "speaker": "B",
      "text": "And so I got on that path and I got on that treadmill. But very quickly I was like, no, this is not for me.",
      "start": 34290,
      "end": 41010
    },
    {
      "speaker": "A",
      "text": "Shortly after he quit, he raised money to start his own app company, but then quickly realized that was just another rat race. So he quit that and then decided to go out on his own, but this time with no expectations that he'd strike it big. Then he stumbled into an opportunity that would change his life forever.",
      "start": 41090,
      "end": 59390
    },
    {
      "speaker": "B",
      "text": "I realized, and I think a lot of other people are realizing, I just want a good place in my life where I can live and do the things I want to do with the people I want to do them with. You don't have to be a billionaire to do that. And that's what led me to.",
      "start": 59470,
      "end": 71070
    },
    {
      "speaker": "A",
      "text": "In this video, Ian shares his exact strategy on how to build a business that gives you freedom, including the best niches, to build an offshoring business, how to scale a team and hire a talent in, and the marketing strategy he uses that costs zero dollars and he still uses today. I'm Pat Walls and this is Starter Story.",
      "start": 73070,
      "end": 93740
    },
    {
      "speaker": "C",
      "text": "All right, man, thanks for coming. Thanks for coming to my house.",
      "start": 94700,
      "end": 98700
    },
    {
      "speaker": "B",
      "text": "My pleasure. It's a beautiful place.",
      "start": 98700,
      "end": 99900
    },
    {
      "speaker": "C",
      "text": "Tell me about who you are and what you built.",
      "start": 100300,
      "end": 102060
    },
    {
      "speaker": "B",
      "text": "I'm Ian Myers, founder and CEO of Oceanz. It's a services business that offers high skill operational outsourcing to hundreds of clients, entrepreneurs, e comm brands, services businesses all across the world. The idea came in late 2021. Signed our first contract in February of 2022. We did 650k in revenue that year, which is a lot for year one of any business. Last year we closed at about 15 million in revenue. So it's just been up, up, up and it's very profitable. Millions of dollars in profit since we started.",
      "start": 102060,
      "end": 134320
    },
    {
      "speaker": "C",
      "text": "So give me a further breakdown of the business. How does this business work? What kind of clients do you serve? How much do you charge?",
      "start": 134640,
      "end": 140560
    },
    {
      "speaker": "B",
      "text": "So for us, we hire people all over the world, mostly in Sri Lanka, a few in South Africa and Other places, we match them out full time, 40 hours a week, long term to our clients. They're part of their team, they're at the all hands, they're on the calendar, on the slack, everything. They're doing real work. We charge around 3 to $4,000 a month per headcount. You know, if you're getting an ea, it's going to be a little less. If you're getting a financial controller, it's going to be a little more. Then we pay our, you know, we pay our people all their wages and everything like that, all their benefits and we pocket the profit between.",
      "start": 141410,
      "end": 172720
    },
    {
      "speaker": "C",
      "text": "Yeah. Before the success, I understand you had a bunch of different roles and you did a bunch of different things. Can you tell me a little bit more about that and how that led to building this huge business?",
      "start": 172960,
      "end": 183120
    },
    {
      "speaker": "B",
      "text": "Yeah, well, first I thought I wanted to be an academic. So I was like getting my PhD in international policy, security policy. That was like really intellectually fascinating. But I didn't want to live in my car, which a lot of my colleagues were doing after they graduated. So I was like, oh, let's change course here. Went into finance, was working like at fund investing. So we're investing in venture funds, private equity funds, stuff like that. And so I was working with all these entrepreneurs. I was talking to them all, they were all psyched. They were getting up out of bed every day, like really excited about their idea. They just wanted to build something, do something. And at some point you're like, you know what? I want to do that. So decided to start my own company. The first one, we took investment, it was venture backed, it was an app. I'm not really app guy, but I was somehow like, had started an app company, found myself there, and we eventually sold it. But I realized if you go that route, you're not really working for yourself. You're like, okay, I want to build something, I want to own something, I want to do something. But the second you raise money, your board's telling you what metrics you got to hit. You're sort of like on this treadmill of raising the next round. And so I got on that path and I got on that treadmill. But very quickly I was like, no, this is not for me. And so after that experience, I was sort of like, okay, now this time I actually want to do something where I'm, it's mine. I'm in charge. I make the decisions. I can go fast or slow. And that's what led me to profitable services businesses. Because I have a. I want to like, live my life and enjoy my life. And I approach this business from what do I want my life to be? Like, yeah, not how do I make the most money? Or how do I get the most venture financing? I realized, and I think a lot of other people are realizing, I just want a good place in my life where I can live and do the things I want to do with the people I want to do them with. You don't have to be a billionaire to do that. So where you live, how you want to live, these are all decisions that should actually go into what kind of business do I want to create?",
      "start": 183440,
      "end": 290470
    },
    {
      "speaker": "C",
      "text": "Okay, so you kind of. You leave this crazy VC world, you're looking to start something that makes your life better, maybe makes $200,000 a year, but then you stumble onto a massive opportunity. So tell me a little bit more about that, the opportunity of offshore talent as a whole. Why is this such a big opportunity?",
      "start": 290790,
      "end": 305750
    },
    {
      "speaker": "B",
      "text": "It's been a big opportunity for a long time, but for only people that had a lot of money to invest in huge teams. So instance, Google has like 180,000 FTEs around the world. They have 120,000 people offshore. Microsoft, same ratio. This has been the secret sauce of the biggest companies in the world for decades. The business opportunity for me was because Covid changed everything, right? Suddenly everyone had to go online. If you can work with someone who's just moved to Montana because it's Covid and they want to move back in with their parents, you can work with someone in Sri Lanka. This opened the door to to companies who hadn't considered offshoring before to start doctor's offices, accounting practices, law firms, creative agencies, people who are like, whoa, my whole team's remote. Why don't I just throw global talent into the mix when it's better priced, oftentimes higher quality, and more eager to get the work done. So I saw that the offshoring industry was sort of taking off, and I thought to myself, well, what if I just have a better product? Like, this industry exists. I know people want this. And that was the light bulb moment. Go find something that people already want and do it differently or better. And there's your equation for a successful business.",
      "start": 306150,
      "end": 384660
    },
    {
      "speaker": "C",
      "text": "For our audience who's watching right now, they're looking to potentially build something in this space, in the offshore talent. What kind of ideas have you come across? What's an idea that comes to mind that you don't have the time to build, that you'd recommend our viewers could build?",
      "start": 384740,
      "end": 397220
    },
    {
      "speaker": "B",
      "text": "Creating a small vertical in which you can succeed is really key. I'm the founder and CEO of an offshore business. I get 10 emails a day from other offshoring businesses trying to sell me offshore talent. It's a commoditized space, so you have to stand out. And one of the best ways to stand out is to be the best in your category. So I've seen a lot of companies be the best at video editing, be the best at certain very specific types of design, like illustration, be the best at, like CAD design for architecture firms and things like that. Specializing in a vertical where you're going to be talked about. It's easy to get to 1 to 2 million dollars in revenue doing that.",
      "start": 397860,
      "end": 434500
    },
    {
      "speaker": "A",
      "text": "Like Ian said, the tides are shifting and right now is the best time in history to be building a business that makes your life better. And the best part is you don't need thousands of dollars or hundreds of employees to do it. With all the tools and resources out there today, it's 10 times easier and cheaper to build a business than it was back then, especially if you want to do it as a solopreneur. But you need to know the right information and the right steps to take. So if you're anything like Ian and you want to take advantage of this opportunity and build a business like his right now, then head to the first link in the description to get this free Solopreneur business guide. This is one of the best ways I'd recommend if you want to learn the information necessary to become a Solopreneur. It includes a bunch of tools, templates, and even an EXTRA list of 70 Solopreneur business ideas to help you get started right away. I personally found the Systems for Solopreneur section to be really helpful because it gives you action steps on how to scale hard things like onboarding and project management. Just head to the first link in the description to download it for free. This guide was made by HubSpot, which is today's video sponsor. A big shout out to them for putting together this free resource.",
      "start": 434740,
      "end": 504730
    },
    {
      "speaker": "C",
      "text": "All right, let's talk about the early days. How did you set up this business? How did you get your first customer? How did you get your first 10 customers? What did that look like?",
      "start": 504890,
      "end": 511690
    },
    {
      "speaker": "B",
      "text": "So at this point, we hadn't raised any money. It was totally me. I own 100% of the business. I knew nothing about this space. Nothing at all. And I thought, okay, if we're going to be doing VAs, we probably should train them to be great VAs. So there was a lot of training built into our model. I hired someone, someone who has been an EA for 10 years to make me a training course. And then we just hired three people that I had sort of gotten connected to through my time in Sri Lanka to do our first cohort. Just three people. And I was like, we're just gonna test with some friends. So I gave the pitch to some friends and I gave much reduced pricing. So we didn't make any money on our first three customers. But I just wanted to put this in someone's hands and see what happens. So for me, it was all about, if I make this business, can I call someone tomorrow and they'll buy it from me? And I think that's really important. Don't go into a business being like, oh, I'm going to buy Facebook ads and sell it to some stranger in Arkansas, or it's gotta be something that you can not just give people to test. But will someone give you money for this thing within, you know, however many days of launching it? But it's gotta be someone you know.",
      "start": 512160,
      "end": 585510
    },
    {
      "speaker": "C",
      "text": "Yeah.",
      "start": 585510,
      "end": 586030
    },
    {
      "speaker": "B",
      "text": "So that for me was how we got our first couple customers. But there was a lot of anxiety when I tapped out my network. I was like, what if this is just a business where people I call and they like me or they know me will buy it and then it stops? And luckily we started getting referrals from our existing customers. I didn't know these people. And the business sort of grew from there. But there was a moment of real anxiety about like, do I have a real business or am I just selling my friends something that they can probably maybe use enough to pay me?",
      "start": 586190,
      "end": 618520
    },
    {
      "speaker": "C",
      "text": "Alright, let's talk about marketing. This business makes millions of dollars a year, but you haven't really done a whole lot of marketing around it. I think that's cool. Tell me more about that.",
      "start": 618600,
      "end": 626760
    },
    {
      "speaker": "B",
      "text": "So I, from the beginning knew that referrals were going to be the secret to our growth. If you have a great service business, they usually grow through word of mouth. Everybody needs lawn care, everyone needs house cleaners. Like those types of businesses, if you pick the right ones, grow through word of mouth because people have excellent service. So the first step is make sure you have a great service. Nobody's going to recommend a service or a product that sucks. And then if you're building referral business before you get to the here's our funnel, here's our engine, here's how it works. Click here to join. Put your customers in the position to be a hero to their friends by recommending your service and you'll succeed. So If I look tired and haggard and you know, whatever, I want someone to see that who's our customer and be like, man, you look like shit, I should hook you up with Ocean's because they're going to change your life. A lot of our customer base or business owners are always thinking about hiring. I think that's also true for great like lead generation business or something like that. How do I get business? Constant topic. How are you growing, dude? How are you marketing? Where are you spending? If you're in those categories, you've got a built in word of mouth. That's really important.",
      "start": 627390,
      "end": 695550
    },
    {
      "speaker": "C",
      "text": "Yeah, double click on the quality of service thing. How did you make sure that the service was so good? Specifically, what did you do to ensure that this was the best service possible.",
      "start": 695550,
      "end": 705510
    },
    {
      "speaker": "A",
      "text": "So that it could scale in terms.",
      "start": 705510,
      "end": 707030
    },
    {
      "speaker": "B",
      "text": "Of how to deliver an incredible experience? Just think about what happens in your daily life. If you send an email to someone and they get back to you in five minutes, that feels amazing. If you have a problem and you get on the phone with somebody and they're like, you know what, I totally understand, that's our bad. Let me comp you a month of service because this is not the experience I want you to have. Just keep going with this, going in day by day with these EAs, helping them touch up their emails, helping them do their canva work. There's so many pieces of low hanging fruit out there in terms of delivering exceptional customer experience that people can do if they're just willing to be on for a pretty long period of time. In that initial stretch, even though I wanted a great easy lifestyle, I knew the first 20, the first 50, you got to really lean in, you got to be there, you got to pick up the phone, you got to call people and you just got to go beyond the bounds of what you might do when the company's large.",
      "start": 707030,
      "end": 760420
    },
    {
      "speaker": "C",
      "text": "So tell me what kind of tools and software run this business?",
      "start": 761220,
      "end": 764420
    },
    {
      "speaker": "B",
      "text": "I'm a big fan of not spending on tools. So we don't have a lot of. We use mostly G suite for everything. I think that what you can get done in Google Sheets is incredible and people should go on YouTube and realize you can run an entire company's dashboard in Google Sheets. And we use stripe for payments. We use notion for a lot of like organization and you know, sort of material, reference guides and things like that. And we use a company called tldv which is video recording and meeting recording. And then of course we use HubSpot for our CRM. So we try to keep our tools pretty Slim. You would be surprised how much you can get done in Google Sheets, Google Classroom, G Suite. And then for the stuff that you can't get done, we use pretty popular providers like Notion and Stripe and things like that.",
      "start": 765140,
      "end": 810820
    },
    {
      "speaker": "C",
      "text": "So let's talk about scale. You built this to a million dollars a year and then now it's doing over $10 million a year. Talk about that timeline. How did you scale this business?",
      "start": 810820,
      "end": 818500
    },
    {
      "speaker": "B",
      "text": "This was the most interesting thing for me that I learned and fucked up is there's a real gap when you go from the first five to eight people doing everything where one person has all the knowledge. They don't have to share that knowledge because the person who made the process is doing the process and everything works well to now we're an organization now. We have a team now. Someone who comes in, needs to be able to learn about how to do this. Everything breaks. Getting the knowledge out of people's heads and into processes was one of the biggest challenges for us as we grew up. And it was painful. So that for me was the hardest thing. Hiring. You know, we hire 30, 30 to 40 people a month. My biggest thing is I like to hire from non traditional places. I think there is a wealth of incredible talent that exists outside of New York City, Silicon Valley. I mean, that's the foundation of my business, obviously. But even for our hires that were in the US our first outside hire in the US she was the head of children's summer camps at Mass Audubon. And I wanted her to take sales calls. And I was like, man, if you can deal with like coordinating a bunch of screaming kids at summer camp and then like 20 to 30 angry parents every week coming and yelling at you, you can do this job and it's going to seem like a vacation. Yeah. So now she's my chief of staff. So looking not totally at like, have you done this before? But is what you've done before gonna set you up for success in this job? Really, really important. And that's how we approach also hiring our EAs. We don't hire people that have been EAs before. We hire people that have had really unique operational backgrounds that are really smart and really intelligent. Are they gonna be able to keep up with a business owner, with a founder? Yes. Then we'll train you to be a great EA and you're going to be successful.",
      "start": 818900,
      "end": 936080
    },
    {
      "speaker": "C",
      "text": "Yeah. All right, well, let's talk about what you do outside of business. Tell me about some of your passions or what this business has enabled you to do.",
      "start": 936080,
      "end": 942800
    },
    {
      "speaker": "B",
      "text": "I'm an easy guy to Shop for. Because I have like five categories of things. I like like space, like buying anything space related. Love books. I like video games and board games, any kind of game, which takes up a lot of time. And I like being in a rural place. I lived in New York for 10 years because I had to be there. I recently moved to New Hampshire. I grew up in Vermont. I feel so much more at home and at peace. And this is, this is like what I wanted when I started this company was I just want the freedom to be in an environment I want to be in and do the things I want to do. So every morning I read with my coffee for an hour. I read a nonfiction book, biography, history, whatever it is I like. I play video games every Saturday morning from 6am to 11am it's five hours. It's kind of insane. And sometimes, sometimes I actually play them on weeknights. But don't tell people that. I think there's a stigma around entrepreneurs doing things that aren't related to their company. And I'm like, if that's true, you have a shitty business. If you can't do the things you want to do. If you can't step away and be like, man, I'm able to read the books I want to read, I'm able to like go visit friends, I'm able to travel, I'm able to do all these things. What are you doing it for? So that's sort of my mantra is like, it's okay that I play video games. It's okay that I'm not spending 247 thinking about this business. Because that means I've built a business that can run on 10 hours of my work or whatever. And I've got a great team that's taking care of things while I'm traveling. So that's the life I set out to accomplish. And it's a little bit different than what I thought it was, but I feel kind of like I'm there is this.",
      "start": 943200,
      "end": 1045160
    },
    {
      "speaker": "C",
      "text": "So tell me what a typical day.",
      "start": 1045230,
      "end": 1046310
    },
    {
      "speaker": "A",
      "text": "In the life is. What does a Tuesday look like for.",
      "start": 1046310,
      "end": 1048590
    },
    {
      "speaker": "C",
      "text": "You while building this business?",
      "start": 1048590,
      "end": 1049790
    },
    {
      "speaker": "B",
      "text": "Well, there's no furniture in my house that I just moved into. So I usually get up off my air mattress and I go downstairs, make some coffee. I sit and read. I start work around 7:30. I get up at like 5:36. I start work around like 7:30. I usually have most of my meetings in the morning. I'll have lunch, you know, make my own lunch, whatever, and have it at my desk. I usually work till 6 or 7 so, you know, like 10, 11 hour days, but it's punctuated. I'll go outside and I'll walk around, I'll go get groceries, I'll call my parents or I'll call somebody and talk to them. And like, breaking up my day in a way that makes sense is something that is afforded to me because of the business I have. Whereas, like, if I was going into an office, I wouldn't be able to do that. And also the people that work for me, I'm always like, look, if you want to go out and like, take your kid to go get some toys or something at 2 o', clock, that's fine, go do that. Come back, we'll finish up. So maybe I do put in the hours, but I do it in a way that doesn't feel like it. And I think that's a real crucial difference.",
      "start": 1050830,
      "end": 1115400
    },
    {
      "speaker": "C",
      "text": "Last question that we ask all the founders on the Starter Story channel is if you could sit on Ian's shoulder and give him advice when you were starting out, what would that advice be?",
      "start": 1115720,
      "end": 1124440
    },
    {
      "speaker": "B",
      "text": "So many people in our generation get freaked out by like, I'm going to make the wrong decision. Should I take this job? Should I start my own company? Should I do this thing? And I'm not going to do it because I'm afraid that it's not the path. There's like LinkedIn stalking that happens today where, like, I see like kids in their, like mid-20s going out and they're being like, well, but this person's. We went to college together and they're working at this company and they have this title and that's farther ahead than me and I'm really freaked out and like, what should I do about it? And I'm like, I went through so many miserable experiences in my life and it ended up here.",
      "start": 1124920,
      "end": 1157800
    },
    {
      "speaker": "C",
      "text": "Yeah.",
      "start": 1157880,
      "end": 1158360
    },
    {
      "speaker": "B",
      "text": "And if I hadn't made all those mistakes and done all those things, this door wouldn't have been open. I would have been in a different house, different neighborhood, and this might not have ever happened. So don't approach decision making in a way that is from fear of choosing the wrong thing. Just take on new opportunities because you always are able to maneuver into what you want to do. And even if you're like, oh, I think I want to do this, but I don't, eventually the thing you think you want to do is the thing that you're going to want to do and then you'll end up happy.",
      "start": 1158930,
      "end": 1189500
    },
    {
      "speaker": "C",
      "text": "That's great advice. Thank you for coming on the show, man.",
      "start": 1190700,
      "end": 1193900
    },
    {
      "speaker": "B",
      "text": "My pleasure.",
      "start": 1193980,
      "end": 1194660
    },
    {
      "speaker": "C",
      "text": "You're awesome. The businesses you built is awesome. Follow this advice and you will have a multimillion dollar Sri Lankan outsourcing business. Good luck, guys.",
      "start": 1194660,
      "end": 1203900
    },
    {
      "speaker": "A",
      "text": "What's up, guys? I hope you got inspired by Ian's story. It was great to have him in my house, and I hope you got some good takeaways from him. I think what he said rings true for me and probably for a lot of you as well. That building a business that makes you enough money to give you the lifestyle that you want is really the goal. Something that allows you to be able to work on what you want, live wherever you want, and do whatever you want to do throughout the day. But for that to be possible, you first need to be working on a good problem and a good solution. Now, if you're still looking for something like that, a good problem to build a business around, then head to the link in the description and I'll send you over a list of $99 million problems worth solving right now. It has a bunch of cool stuff around ideas and industries that are worth building in. And if you're really serious about building something, then please come join thousands of other builders doing it inside. Starter story. All right, guys, I'll see you in the next one. Peace.",
      "start": 1204460,
      "end": 1260000
    }
  ]
}