{
  "source": "/home/salouri/Projects/starter_story/transcripts/akM6P97_0B8/akM6P97_0B8_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "This guy makes over $10 million a year with six different businesses. And the best part, he started them all with $0. I drove out to Miami, Florida to ask him exactly how he built these businesses and the blueprint he uses to make over $5 million a year in profit.",
      "start": 320,
      "end": 18400
    },
    {
      "speaker": "B",
      "text": "Instead of charging $1,500 a month, we charge on average $1.5 million a year.",
      "start": 18720,
      "end": 24320
    },
    {
      "speaker": "A",
      "text": "You see, Greg started his journey working at a VC funded, multi billion dollar company. Then one day it went bankrupt. It was unprofitable. And what he learned from that helped him come up with a formula to start his own business that would be profitable from day one.",
      "start": 24560,
      "end": 41690
    },
    {
      "speaker": "B",
      "text": "The ACP funnel is the secret sauce that I've used for the last 15 years that I'm only now sharing with the world.",
      "start": 41930,
      "end": 48490
    },
    {
      "speaker": "A",
      "text": "In this video, Greg shares his exact blueprints on how to make a million dollars from one client, exactly how he's found several million dollar business ideas and and why everyone should aim to become a multipreneur. I'm Pat Walls and this is Starter Story.",
      "start": 48890,
      "end": 66050
    },
    {
      "speaker": "C",
      "text": "Thank you, Greg. Thanks for having me. Tell me about who you are and.",
      "start": 69170,
      "end": 72810
    },
    {
      "speaker": "B",
      "text": "What businesses you built. My name is Greg Eisenberg and today I run a holding company called Late Checkout. We do eight figures in revenue, mid seven figures of profit. And I've been a part of companies that have raised billions of dollars and I make more money as the CEO of Late Checkout and work a lot less.",
      "start": 72810,
      "end": 91550
    },
    {
      "speaker": "C",
      "text": "Can you break down the businesses that are within your holding company currently and what you plan to build?",
      "start": 91950,
      "end": 96830
    },
    {
      "speaker": "B",
      "text": "Totally. So we've got six companies that we've started, LCA, which is an innovation agency. You probably need a robot.com, which is one of the biggest AI communities on the Internet. We have designscientist.com which is a design agency. We've got Boring holdings, which is literally another holding company which owns boring market marketing.com, an AI assisted SEO business, and boring ads.com, an AI assisted ads agency. And we've got multipreneurship.com which is a community for multipreneurs.",
      "start": 97150,
      "end": 131770
    },
    {
      "speaker": "C",
      "text": "Tell me a little bit more about what multipreneurship is and why you're so bullish on it.",
      "start": 132170,
      "end": 137050
    },
    {
      "speaker": "B",
      "text": "Multipreneurship just basically means that you're building multiple products, multiple companies, multiple revenue streams. Instead of having one company do $100,000 a month in revenue, you now have eight companies. Maybe they're only doing $25,000 a month in revenue, but if one struggles a little bit or Google makes a change that affects this business or Instagram does this. You now have that built in insurance. And the compounding with these Internet businesses are next level. So not only is it cheaper than ever to build, faster than ever to build with AI, the compounding effects are super real. And I love the diversification of the multipreneurship model.",
      "start": 137130,
      "end": 178800
    },
    {
      "speaker": "A",
      "text": "Yeah.",
      "start": 178800,
      "end": 179280
    },
    {
      "speaker": "C",
      "text": "All right, so tell me a little bit about your origin story, how you get here.",
      "start": 179280,
      "end": 182560
    },
    {
      "speaker": "B",
      "text": "Grew up in Montreal, Canada. Always was an Internet nerd. Started creating different blogs, communities online. Started making a few bucks as a teenager. When I was 17, my first week of school, high school, I was actually in a school shooting and 19 people got shot. And I remember being in the chemistry class, my teacher had locked the door. I'm hearing bullets left and right. I realized as a 17 year old that life is short and I wanted to do big things. From that moment, I took building on the Internet really, really seriously. I started a company called Islands, which was kind of like a discord for college students. That was sold to WeWork. And I was the head of product strategy and later the head of product of WeWork. We were worth $47 billion. All of a sudden we've run out of cash. The headlines read 25 billion, 20 billion, 15 billion, 10 billion. WeWork can't raise cash. I vowed to myself that the next thing I start isn't going to be an unprofitable venture backed business. It's going to be a profitable machine. So I asked myself, what is a model that could marry the freedom that I want with the creativity of building multiple businesses. And that's what got me so interested in this new way of being an entrepreneur, being a multipreneur. Yeah.",
      "start": 183120,
      "end": 270290
    },
    {
      "speaker": "A",
      "text": "Greg is proof that you don't need VC funding or a big team to build a million dollar business. You can be a solopreneur and get started today on a business that might just change your life. But that requires knowing the right information and finding the right problem to solve. Now imagine there was a place that gave you all this. The problems to solve, the blueprints to solve them, and the strategies that turn simple ideas into million dollar online businesses. Well, at starter story, we have a library of over 4,000 case studies and business idea breakdowns where you can access this. All backed by data from real entrepreneurs. So if, if you're actually serious about building that next profitable side project, head to the first link in the description and we're Gonna give you 160 Solopreneur business ideas so you can get started on your journey today, just like Greg. Now let's get back to Greg and how he actually launched this thing.",
      "start": 270450,
      "end": 325670
    },
    {
      "speaker": "C",
      "text": "So you're out of WeWork and you start your first company. What is that company that you start?",
      "start": 325830,
      "end": 330470
    },
    {
      "speaker": "B",
      "text": "Lca. So it's an innovation agency. We'll work with a Nike, a Dropbox, a Shopify, a TikTok. And we'll say we will help you come up with new ideas to future proof your business. Instead of charging $1,500 a month, which most agency owners do, we charge on average $1.5 million a year. Why? Because if we come up with a whole new vision for where to take your company, oftentimes Those products generate nine to 10 figures of revenue. If you're spending $1.5 million, sounds like a pretty good trade to me.",
      "start": 330870,
      "end": 363010
    },
    {
      "speaker": "C",
      "text": "So you're making a million dollars per client. How did you actually land these clients.",
      "start": 363210,
      "end": 367690
    },
    {
      "speaker": "A",
      "text": "And build this business?",
      "start": 367690,
      "end": 368570
    },
    {
      "speaker": "B",
      "text": "ACP Funnel, baby. A stands for audience. You gotta start by social media audience, Instagram page, TikTok page, Twitter account. I had built a Twitter account of over 10,000 people. That's not a lot, by the way. 10,000 people. Anyone can get to 10,000 followers. C stands for community. How do you convert some of those audience members into someplace where you own their emails, you have their sms, they have a place to and you really understand what are their pain points. And I started posting, hey, come to these orange wine disco parties in these basements in Williamsburg. I actually met some of my first clients at these parties. And then P for product. What is the product that you can create that they want the most? And I, and I told them, oh, I'm actually starting this thing called lca. We sell innovation. And they were like, come into my office first thing Monday. Because I had already built so much trust with them. Our first year we did a million and a half in revenue. We had one big client and then one kind of half client. Second year, all of a sudden we're doing five plus million in revenue. Sounds like a lot, but again, a few clients, $1 million each, and it's been going up ever since then. The ACP funnel is the secret sauce that I've used for the last 15 years that I'm only now sharing with the world.",
      "start": 369690,
      "end": 447230
    },
    {
      "speaker": "C",
      "text": "So you're technically a solopreneur with this massive agency, but then you become a multipreneur. Tell me what that transition look like.",
      "start": 447790,
      "end": 454730
    },
    {
      "speaker": "B",
      "text": "We started a second business called Nice Break, Nicebreak, Fun. We started direct with the product. That's. No, no, that's. That's not the way to build a business nowadays. The way to Build a business nowadays is you start with the community first, then you build the product. So we actually closed it down after that. I said, all right, let's go back to the ACP funnel. And we started dispatch. We started a Twitter account. Within a few weeks, it got to a couple thousand followers. It was all around design inspiration. You know, we had the audience and we started saying, hey, there's. There's an opportunity here. So within 72 hours, we whip up a landing page, a brand and a team, and all of a sudden we're selling design subscriptions. Our first year, we did seven figures of revenue, 450,000 in profit. Then we wanted to try something different. So we started a Twitter account called Boring Marketer and started just tweeting about ad stuff, SEO stuff, just boring ways to get customers. We build a community around it, and then we built this AI assisted tool to help do keyword research, to help create SEO content. Basically create this SaaS tool. In its first year, it did 350,000 in profit. In its second year, it'll do 2 to 3 million in profit.",
      "start": 455050,
      "end": 527840
    },
    {
      "speaker": "C",
      "text": "All right, let's talk about hiring. You have these companies within your personal holding company. How do you hire people to run these companies?",
      "start": 528400,
      "end": 534160
    },
    {
      "speaker": "B",
      "text": "One way I hire is I build communities, and then I actively reach out to some of the most active people, we call them nerds in residence. Someone who's an expert, who cares, you know, if it's the AI example, you need an AI nerd who's thinking about this all the time. Right. We find them through the community. The second way I find talent is I cold DM a lot of people. If I find someone interesting online, I won't be shy and I'll try to find their email address. I'll DM and even if they have a job, I'll say, hey, let's, let's hop on a quick call. The best people to hire actually work a job.",
      "start": 534640,
      "end": 568240
    },
    {
      "speaker": "C",
      "text": "Let's talk about how you find ideas and how you build them really quickly. What's your process?",
      "start": 568720,
      "end": 573280
    },
    {
      "speaker": "B",
      "text": "I use two tools. One is called Reddit list.com which tells me how fast a particular subreddit is growing. And it gives me a ranking of all the different subreddits. And I use a tool called gummysearch.com which basically takes a subreddit and tells me what are the biggest problems that this subreddit is having? And it's your job as the entrepreneur, as the multipreneur to solve them. Yeah.",
      "start": 573840,
      "end": 597600
    },
    {
      "speaker": "C",
      "text": "Are there any other tools that you use to run and build your businesses.",
      "start": 597600,
      "end": 601120
    },
    {
      "speaker": "B",
      "text": "I use Framer to create landing pages and websites really quickly. I use ConvertKit for email. I love all the automations they do. I use Vidiq, which is a chrome extension that gives you competitive analysis on YouTube. And there's this little feature where what are the top questions on a YouTube comments? So imagine going to a starter story YouTube page and you can sort by top questions and that gives me ideas around what I could be building for the starter story community. I use Slack for team communication. Our entire team runs on notion. We use Figma for designs. I use Loom like crazy. I just like creating quick looms about stuff and people could see my face. Or I can screen share. That runs our eight figure business.",
      "start": 601280,
      "end": 643620
    },
    {
      "speaker": "C",
      "text": "Okay, we are out here in your beautiful condo in Miami, Florida. Tell me about multipreneurship. Why is it the future and why is it different than solopreneurship?",
      "start": 644100,
      "end": 654020
    },
    {
      "speaker": "B",
      "text": "I'm not advocating for launch five products on day one. Become a solopreneur. Find a niche, build an audience, build a community, build a product for them. All I'm saying is at the end of that, once that business is generating at least $100,000 of profit, find an operator. Then that frees you up to find the next thing. Either buy another business using some of that cash flow or your own cash flow or incubate something new. One of the benefits of being a multipreneur is a lot of the sleepless nights you're giving to the operator. The second thing is if you're creative, you're going to love being a multipreneur. You get to work on different projects, different spaces. Every day just feels different. But you need to have a lane. Our lane for example is we believe community based products outperform non community based products. So we build businesses based on the ACP funnel that we've defined.",
      "start": 654100,
      "end": 708580
    },
    {
      "speaker": "C",
      "text": "Tell me what a day in the life is like for Greg. A multipreneur running an eight figure business. What does that look like?",
      "start": 708740,
      "end": 714740
    },
    {
      "speaker": "B",
      "text": "I wake up around 6am I make a French press coffee. I have it. I sit outside, I see the sun come up. It makes you feel grateful for for being alive. And I get to work. I plan out what I want to do today. What are the two or three things that if I did these things today, I would be happy. Sometimes in the afternoon I'll go for a 45 minute workout and then after the day is done, I try not to think about work. So I do things where I don't have my phone that helps me reset for the next day.",
      "start": 715300,
      "end": 745260
    },
    {
      "speaker": "A",
      "text": "Yeah.",
      "start": 745260,
      "end": 745660
    },
    {
      "speaker": "C",
      "text": "All right, last question that we ask for every founder that we interview. If you could stand on Greg's shoulders back in the wework days or even before that, what would be your advice?",
      "start": 745820,
      "end": 755020
    },
    {
      "speaker": "B",
      "text": "I made the mistake of listening to the top entrepreneurs of my day who said go build a venture backed company and go scale it and be Mark Zuckerberg. I was living someone else's life by doing that. And I spent 12, 13 years of my life 7am to 2am every single day, working seven days a week. And I think everyone deep down knows what's for them and life is about getting to that truth. My advice to everyone is find your truth. Don't listen to what anyone says and go after it.",
      "start": 755500,
      "end": 789640
    },
    {
      "speaker": "C",
      "text": "That's great advice. Thank you, Greg.",
      "start": 790040,
      "end": 792800
    },
    {
      "speaker": "B",
      "text": "Thanks, Pat.",
      "start": 792800,
      "end": 793480
    },
    {
      "speaker": "C",
      "text": "Yeah, follow this advice and you will have a $10 million multipreneurship empire.",
      "start": 793480,
      "end": 798600
    },
    {
      "speaker": "B",
      "text": "Peace.",
      "start": 799640,
      "end": 800120
    },
    {
      "speaker": "A",
      "text": "What's up guys? I hope you were inspired by Greg's story and how he approaches starting businesses. I think the coolest thing about Greg is how he's able to find painful problems and then create solutions to those problems. Really? Really. That's why he's able to run six different businesses at the same time, doing millions in revenue. If you want to do something similar but don't know where to start, head to the first link in the Description to download 160 proven Solopreneur business ideas. You won't find this information anywhere else. And if you're really serious about building the business that might just change your life, come join thousands of founders inside starter story. Alright, see you in the next one. Peace.",
      "start": 801000,
      "end": 840260
    },
    {
      "speaker": "B",
      "text": "Sam.",
      "start": 842590,
      "end": 847960
    }
  ]
}