{
  "source": "/home/salouri/Projects/starter_story/transcripts/BskeAo66er0/BskeAo66er0_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "I never made more than like 40, 50k a year out of college. And that's pre tax, so I was broke. So I packed up my car, drove like 1200 miles away. That's where I kind of learned how to like talk to people, network, do customer service, write blogs.",
      "start": 80,
      "end": 14720
    },
    {
      "speaker": "B",
      "text": "All right, so today we're meeting up with Scott. He makes $50,000 a month making videos and he's gonna show us exactly how he does it. So yeah, tell me about what you do.",
      "start": 14880,
      "end": 28560
    },
    {
      "speaker": "C",
      "text": "What do you run?",
      "start": 28720,
      "end": 29440
    },
    {
      "speaker": "A",
      "text": "Yeah, so we run a productized service for B2B SaaS companies. So think about like an agency service, except you're able to buy it kind of like an E commerce product. So it's, it's short animated videos for B2B SaaS companies to run as paid ads and get customers in the door.",
      "start": 29680,
      "end": 47819
    },
    {
      "speaker": "B",
      "text": "What's a typical client for who we work with?",
      "start": 47819,
      "end": 50380
    },
    {
      "speaker": "C",
      "text": "We work with software companies that are primarily B2B. So they have platforms like, if you think of stripe, like a payment processor or something like that. And they're typically also funded. So an important part about selling something like a productized service is making sure that the people have the money to actually buy what you're selling. So we found that companies that are VC backed or have gone through like seed and series A funding, they typically have the money to purchase what we're selling. So that's what works best for us.",
      "start": 50380,
      "end": 78720
    },
    {
      "speaker": "B",
      "text": "And companies want this because it helps sell more of their product or helps their brand market better.",
      "start": 78720,
      "end": 83680
    },
    {
      "speaker": "C",
      "text": "The main goal with the videos is not necessarily to directly get our clients more customers. It's more so to get the potential customers to like stop scrolling or to maybe go book a demo or something like that. It's more of like the scroll stopper some people call it, where it's super attention grabbing, but it doesn't give you enough information to actually go buy the service or product.",
      "start": 83680,
      "end": 111060
    },
    {
      "speaker": "B",
      "text": "Tell me a little bit more about your background. You were doing actual video agency work?",
      "start": 111060,
      "end": 115220
    },
    {
      "speaker": "A",
      "text": "Yeah, so I've done, I've done everything. I've done like music videos, event recaps. You know, me and a friend used to shoot weddings and just like basically everything. I've also been a designer, built websites, all this stuff. And for me video is what really stuck. And then it was hard for me to scale and it was, it was.",
      "start": 115220,
      "end": 132970
    },
    {
      "speaker": "C",
      "text": "Hard to get work.",
      "start": 132970,
      "end": 133610
    },
    {
      "speaker": "A",
      "text": "I didn't really know what I was doing. So I ended up stumbling onto Twitter and meeting, you know, a lot of the people, what they call like money Twitter. Right. And that's really all about how can you take what you already know how to do, which for me was the video production stuff, and monetize it at a higher level? And then that's when I kind of got into all of the technical, technical business stuff.",
      "start": 133610,
      "end": 156030
    },
    {
      "speaker": "B",
      "text": "You go to college or.",
      "start": 156030,
      "end": 157110
    },
    {
      "speaker": "A",
      "text": "I went for two months and dropped out, I think.",
      "start": 158310,
      "end": 160990
    },
    {
      "speaker": "B",
      "text": "What, did you drop out? What happened?",
      "start": 160990,
      "end": 162390
    },
    {
      "speaker": "A",
      "text": "Yeah, so I ended up meeting this guy and he's like, hey, I'm starting this business in Colorado. You know, we're going to try to like help people manage vacation rental properties. Like, I think you'd be a good fit for it. So I packed up my car, drove like 1200 miles away. I hadn't had any actual business experience prior to that, but that's where I kind of learned how to like talk to people, network, do customer service, write blogs, stuff like that. That was in 2019, I think. So I was 19 when I did that.",
      "start": 162390,
      "end": 194700
    },
    {
      "speaker": "B",
      "text": "So now you're only like what, 24, 23?",
      "start": 194700,
      "end": 196900
    },
    {
      "speaker": "A",
      "text": "Yeah, I didn't really make any money until the last like year. Even though I tried all this stuff after college. I mean, it was all just learning, you know, I never made more than like 4, 40, 50k a year out of college. So I mean, and that's pre tax. So I was broke, you know, the three and a half years after I left. But I was able to leverage my skills. And this is something for like a lot of people too, that they can, they can use is like if you have a specific skill, if you can find ways not just to make money with it, but like for me, for example, because of the video stuff, I've gotten to like go shoot at NASCAR in the pit and just a bunch of cool stuff. Even though I wasn't getting paid very well for that. It was stuff that I was able to add to my resume of just things that you're able to do.",
      "start": 196980,
      "end": 241930
    },
    {
      "speaker": "B",
      "text": "Has video always been your passion?",
      "start": 241930,
      "end": 243530
    },
    {
      "speaker": "A",
      "text": "I've been doing video since 2016 and it, it started off actually as I opened up Adobe Illustrator junior year of high school to make like these presentations for some business class I was in. And then that evolved into me getting a camera and trying out photography. And then photography got boring, so I tried out video. And then now it's kind of an intersection of all of them with what I'm doing because it's like design, but it's moving and all that stuff. But really personally, like, I enjoy anything creative. So I've painted, I've, you know, I used to like play some instruments. Just really any. Anything like that.",
      "start": 243530,
      "end": 282630
    },
    {
      "speaker": "B",
      "text": "So your business took off and you said you're making $50,000 a month now, is that right?",
      "start": 282790,
      "end": 287750
    },
    {
      "speaker": "A",
      "text": "Yeah, on average it bounces around a little bit with any business, Right. Like it could 35, then it could be like 55, right? Yeah, just depends on your lead.",
      "start": 287830,
      "end": 295730
    },
    {
      "speaker": "C",
      "text": "Sure.",
      "start": 296210,
      "end": 296490
    },
    {
      "speaker": "B",
      "text": "But you know, before that you were making maybe 50,000 a year and you grew to pretty much 10x that. Was there any mindset shift or was there anything that really set this business apart from others?",
      "start": 296490,
      "end": 306690
    },
    {
      "speaker": "A",
      "text": "If I was going to choose one thing, it would be switching from a scarcity mindset to an abundance mindset. And it sounds really, I guess like cheesy or like woo or whatever. If you make the shift to taking those same resources again, whether it's money, the knowledge network you have right. In just full on like utilizing them to try to produce more of what you have and grow that, I think the whole game changes.",
      "start": 306850,
      "end": 335270
    },
    {
      "speaker": "B",
      "text": "Before this business, you had kind of a lot of creative type jobs. You were doing video. How could someone who is also creative, an artist, a videographer, anyone in doing production, how can they turn that into a business and be able to work for themselves?",
      "start": 335270,
      "end": 347510
    },
    {
      "speaker": "A",
      "text": "Speaking from what worked for me, I think that the biggest thing one get.",
      "start": 347590,
      "end": 352370
    },
    {
      "speaker": "C",
      "text": "On social media, right?",
      "start": 352370,
      "end": 353370
    },
    {
      "speaker": "A",
      "text": "And I'll use Twitter as an example because that's again what worked for me. So what I would do is be posting every day, sit down for an hour, schedule it out, be consistent and write things or make reels or whatever you're gonna do about things specific to what you're doing are. So if it's video, make educational content for brands about how they can get more customers in the door with video. Right. That's kind of what I did. And then once you have that down, once you're consistently posting, you get a feel for it and you're learning about the specific platform that you're posting to, then that's when you can start actually selling a service. What works best for that is the productized model we talked about. So again, if you're doing something like video, right, there's a ton of different things you could do. You could design thumbnails for YouTube, you could do an on demand video editing service, you could do a color grading service. Right. And come up with like a specific offer and packages to sell or some kind of offer structure where let's say your main package is $3,000 a month, then you can have a downsell or an upsell or whatever.",
      "start": 353370,
      "end": 423350
    },
    {
      "speaker": "C",
      "text": "Right.",
      "start": 423350,
      "end": 423670
    },
    {
      "speaker": "A",
      "text": "And so what that might look like is certain deliverables inside of a package. And a deliverable would be like we'll color grade this many videos in this specific way for this amount of money. If you can have a service people need is recurring and you can find the people who have the money to buy it, then there's, there's really no stopping you. Yeah.",
      "start": 423750,
      "end": 445530
    },
    {
      "speaker": "B",
      "text": "And you think that's more effective than just, I guess, selling your time to do some, some video work for, you know, a few hours?",
      "start": 445530,
      "end": 452969
    },
    {
      "speaker": "A",
      "text": "100% packaging. Your, your skill set is much more effective because you're in control of what you're charging. You're being paid for your expertise, not your actual time. So if you had an A person and a B person and they both had 10 years of experience, maybe you say a person is getting paid hourly even if it's $500 an hour.",
      "start": 452969,
      "end": 472090
    },
    {
      "speaker": "C",
      "text": "Right.",
      "start": 472090,
      "end": 472370
    },
    {
      "speaker": "A",
      "text": "Like they're a lawyer or something. And then B person is selling a product service, they're still going to make 10 times more because they could sell what person A is doing for $500 an hour, maybe it takes them 10 hours. And then person B can then charge $5,000, give them the same result. And so technically person A and person B are being compensated the same, but person B can go and then hire people to help them fulfill that.",
      "start": 472370,
      "end": 499290
    },
    {
      "speaker": "C",
      "text": "Right.",
      "start": 499610,
      "end": 500010
    },
    {
      "speaker": "A",
      "text": "And so it's just this whole, this whole scaling thing is, is where you make the real money.",
      "start": 500250,
      "end": 505330
    },
    {
      "speaker": "B",
      "text": "Do you have any employees or it's just you?",
      "start": 505330,
      "end": 507450
    },
    {
      "speaker": "A",
      "text": "Yeah. So I, I started off by myself and now we have a team of about four. So I don't have any full time employees, but I have like a couple full time contractors and then some like a closer and fractional roles that help certain things operationally. And my team is, is also international as well.",
      "start": 507450,
      "end": 526109
    },
    {
      "speaker": "B",
      "text": "How does that work?",
      "start": 526109,
      "end": 526749
    },
    {
      "speaker": "A",
      "text": "It's great because, I mean for a lot of reasons, but they get paid, you know, more than they would make where they are. And my team's pretty young too, like younger than me. So it's cool to be able to give people, you know, like when I, back when I was 18, like I would have loved to be doing what they're doing now. And so it's, it's cool to bring that full circle and be able to pay someone what they're worth more than they would make where they live. You know, they can work remote. They're not my employees, so they take.",
      "start": 526749,
      "end": 553930
    },
    {
      "speaker": "C",
      "text": "Trips and stuff and take work off.",
      "start": 553930,
      "end": 555690
    },
    {
      "speaker": "A",
      "text": "So that's, that's been enjoyable too.",
      "start": 555690,
      "end": 557570
    },
    {
      "speaker": "B",
      "text": "And how do you find really good talent?",
      "start": 557570,
      "end": 559170
    },
    {
      "speaker": "A",
      "text": "There's a lot of ways, but when you start building an audience, people will naturally want to work for you. Because they believe in what you're doing and they think that what you're doing is cool. So all the people that are working for me right now reached out to me and the reason I hired them is because I know if they're reaching out to me that they're really dedicated and motivated to get done what they want to do. And it's turned out to be true so far.",
      "start": 559170,
      "end": 581150
    },
    {
      "speaker": "B",
      "text": "How much does it cost to run your business, like generally speaking, monthly?",
      "start": 581230,
      "end": 585070
    },
    {
      "speaker": "C",
      "text": "So we have a tech stack that is. And then there's also payment processing fees and stuff like that in terms of like labor. It's hard to put a pin on that because it's completely dependent on how many videos we're doing. Our gross profit margins are about 65% and then net is probably between 40 and 50, just depending on a couple things. But in terms of our. The tech stack is really the only one thing that we consistently spend money on on a monthly basis.",
      "start": 586270,
      "end": 620610
    },
    {
      "speaker": "B",
      "text": "What do you mean by tech stack?",
      "start": 620610,
      "end": 621890
    },
    {
      "speaker": "C",
      "text": "So, okay, so we have the cold email sending software, the software that we run the list through. I have to pay for Slack. You know, we use Stripe, which is free, but we pay the fee on that tech stack specifically is prob. Like twelve hundred dollars a month.",
      "start": 622050,
      "end": 636990
    },
    {
      "speaker": "A",
      "text": "And that's.",
      "start": 636990,
      "end": 637470
    },
    {
      "speaker": "C",
      "text": "So that's just what we use to be able to actually execute the services that we sell.",
      "start": 637470,
      "end": 641470
    },
    {
      "speaker": "A",
      "text": "Right.",
      "start": 641550,
      "end": 641950
    },
    {
      "speaker": "B",
      "text": "I notice you mentioned building an audience. What does that look like for you?",
      "start": 646990,
      "end": 649950
    },
    {
      "speaker": "A",
      "text": "Just posting consistently and finding a niche too. When you think of a niche, like, it has to be really specific, like super specific. So at first it was just videos for me, and then it became short videos, like no longer than 60 seconds. And then it became short videos for online brands. And then it went to short videos for online brands that are B2B SaaS companies.",
      "start": 650030,
      "end": 677490
    },
    {
      "speaker": "B",
      "text": "Did you see the business grow when you kept niching down like that?",
      "start": 677650,
      "end": 680210
    },
    {
      "speaker": "A",
      "text": "Yes, because it made it very obvious like who our product was for. It's counterintuitive too because like when you. The more people you say like, no, you're not a fit, then the faster you'll find people that will actually buy from you.",
      "start": 680210,
      "end": 693510
    },
    {
      "speaker": "B",
      "text": "Have you been able to raise your prices because of this niching down that you've done?",
      "start": 693510,
      "end": 697110
    },
    {
      "speaker": "A",
      "text": "Yeah, we, we. The first video we sold was $500 and we've basically 10x our prices. So now our average order value is like 3k. But we sell. We just introduced some new packages that have been selling really well from anywhere from 6 to 12.",
      "start": 697590,
      "end": 715590
    },
    {
      "speaker": "B",
      "text": "What advice would you have just for anyone that wants to get started with an online business. What's the first step?",
      "start": 715910,
      "end": 722060
    },
    {
      "speaker": "A",
      "text": "Do things like go on YouTube and do research on what you actually want to do. And then I would spend as much money as you can afford on coaching and programs that are fit on what direction you want to. You want to go from people that are reputable, not. Not Lambo guru. This is where I get a lot.",
      "start": 722060,
      "end": 748060
    },
    {
      "speaker": "C",
      "text": "Of my work done.",
      "start": 748060,
      "end": 748820
    },
    {
      "speaker": "A",
      "text": "We got the nice Aputure light set up here and trust the old 16 inch MacBook Pro. So we actually coincidentally just closed the deal right as we started filming this.",
      "start": 749060,
      "end": 759500
    },
    {
      "speaker": "B",
      "text": "So just got a $400 sale.",
      "start": 759500,
      "end": 761900
    },
    {
      "speaker": "C",
      "text": "We got starter stories and good luck charm.",
      "start": 761900,
      "end": 763980
    },
    {
      "speaker": "A",
      "text": "So we're gonna send this contract out.",
      "start": 763980,
      "end": 765620
    },
    {
      "speaker": "C",
      "text": "And then talk a little bit about.",
      "start": 765860,
      "end": 767380
    },
    {
      "speaker": "A",
      "text": "How we got here in the first place.",
      "start": 767380,
      "end": 768620
    },
    {
      "speaker": "B",
      "text": "You said you'd grown it from 0 to 50,000 pretty much in a year. What did that look like? Did you start with just like 5,000amonth? How did that grow?",
      "start": 768620,
      "end": 775770
    },
    {
      "speaker": "C",
      "text": "We kind of started how we are still now, but we sophisticated our offer. So before it was you'll buy one video, it'll basically be whatever length and it's a flat fee. Essentially what we did now is we created a package so you're not only buying, you can still buy one video, but we use it as a downsell. Now if someone doesn't want to buy the package with the packages, it's a set of videos. And then we reformat that set of videos so that people can run it on all the platforms and things like that. And then we also will set up retargeting ads for them. We won't run them, but we'll do a bunch of setup and stuff like that so that it's an offer that's more inclusive of what the end goal is rather than just here is a video. It actually sets them up for success.",
      "start": 776010,
      "end": 823380
    },
    {
      "speaker": "A",
      "text": "Yeah.",
      "start": 823620,
      "end": 824060
    },
    {
      "speaker": "B",
      "text": "So when you started repackaging your offering like that, is that when you started.",
      "start": 824060,
      "end": 827140
    },
    {
      "speaker": "C",
      "text": "See the growth in terms of, I guess like financially? Yeah, because in terms of monthly like revenue it was like 7k, then 5k, then 9k and then we went to like 1223, 33. And I would say what we introduced that offer when we were struggling to get above like 12k a month because it just wasn't the one. Videos weren't sophisticated enough and the ticket price wasn't high enough to bring us past that threshold.",
      "start": 827380,
      "end": 853850
    },
    {
      "speaker": "B",
      "text": "How did you find your first customer? What's been your main channel for growth?",
      "start": 854000,
      "end": 857040
    },
    {
      "speaker": "C",
      "text": "Yeah, so there's been a couple different ones. Some work better than others, but primarily we've done Twitter. We've done cold email, we've done like direct DMing. So like on Sales Navigator, on LinkedIn or through Twitter. And really, I mean, keeping it simple, like, it's just really cold outreach. And then the organic content, reaching out to people.",
      "start": 857040,
      "end": 876800
    },
    {
      "speaker": "B",
      "text": "For the viewers who don't know a lot about cold outreach, what does that typically look like? How many cold emails are you sending and what's like your lead response rate?",
      "start": 877280,
      "end": 885890
    },
    {
      "speaker": "C",
      "text": "That sort of stuff you got to send a lot. And for our icp, which stands for ideal Customer Profile, specifically, the open rate or reply rate for software is only about. They're two different things. The reply rate is really only like 4% typically on average. So you're talking about reaching out to thousands of people. And then when you get those people to reply, not all of them will book a call with you either. So it's kind of. You just have to do the math depending on what your numbers look like. And in terms of, you know, what a cold email looks like, it's basically. It's really simple. It's basically two sentences. It's like, hey, you know, we noticed on your site that you don't have a video, like above the fold on your landing page. That that's something we do. Like, have you ever looked into that? And that's it. You know, a lot of people will write like a huge paragraph and like, no one has a title. Right.",
      "start": 885890,
      "end": 939690
    },
    {
      "speaker": "B",
      "text": "How does the sales process work for anyone that's running kind of a product service? What would you recommend doing or.",
      "start": 940250,
      "end": 944690
    },
    {
      "speaker": "C",
      "text": "Yeah, so to break it down really simply, you basically have like top of funnel. You have like the middle of the funnel and then you have bottom. So top of funnel for us is organic social posting, the DMs and cold email and then the ads.",
      "start": 944690,
      "end": 958130
    },
    {
      "speaker": "A",
      "text": "Right.",
      "start": 958130,
      "end": 958370
    },
    {
      "speaker": "C",
      "text": "So like, those three things, what happens is a certain amount of people convert from top of funnel to the middle of funnel. So someone will open the email, someone will see a post of ours, or even both. Sometimes people will open an email and then go check out my LinkedIn profile. Right. And then they'll book a call either directly through our socials or on the website. And that's kind of the middle funnel. And the bottom of our funnel is like getting on a sales call with my closer, then either buy or not buy, essentially. Yeah, so it's. It's basically those three main parts.",
      "start": 958370,
      "end": 987820
    },
    {
      "speaker": "B",
      "text": "What did you learn?",
      "start": 987820,
      "end": 988380
    },
    {
      "speaker": "C",
      "text": "This B2B and the sales process. So the coaching and then just trying it out yourself.",
      "start": 988380,
      "end": 992820
    },
    {
      "speaker": "A",
      "text": "Yeah, so the coaching is good for.",
      "start": 992820,
      "end": 994380
    },
    {
      "speaker": "C",
      "text": "Like, at least for me. Like, I felt like Pretty directionless. I was like, oh, you know, I know I want to have an online business but I don't know where to start. I don't know like what kind of stuff to watch. But you're dedicated and you know you want to do it.",
      "start": 994380,
      "end": 1007660
    },
    {
      "speaker": "A",
      "text": "So.",
      "start": 1007820,
      "end": 1008080
    },
    {
      "speaker": "C",
      "text": "So I spent the money on the coaching. The coaching gave me an outline and direction and then I took that direction and I tried it myself. So for example, the cold email stuff, I knew enough to actually just try it. I didn't know enough to do it. And then you start doing it more and through repetition you get better at it. So same thing with the sales calls. Like I am not a salesperson. Like I don't like doing it and. But I've probably taken like 150 sales calls and then once I took enough sales calls to have a structure to it, I gave that to someone to do for me.",
      "start": 1008230,
      "end": 1044349
    },
    {
      "speaker": "B",
      "text": "What's your schedule? What's the typical day for you?",
      "start": 1044349,
      "end": 1046149
    },
    {
      "speaker": "C",
      "text": "Like wake up at 7:30, start working by like 8 or 8:30, drink a ton of coffee and in terms of actually working, I probably sit at my desk, you know, eight hours a day, pretty normal working amount. And then you know, an hour or two is also just spent like thinking like walking and stuff like that. When I'm actually sitting at my desk, what I'm doing is project management. So I'm in Slack channels, you know, communicating with clients, implementing feedback, delivering products to them, things like that. A certain top portion of my time is spent doing organic content, so writing I'm going to be recording more videos, planning stuff out for that and then also consuming a certain amount of content. You know, obviously try not to consume too much but maybe threads about building your business and stuff like that. So like a certain amount is fulfillment. Some of it is sales and overseeing some of the people that work with me and then just trying to get better every day.",
      "start": 1046149,
      "end": 1106120
    },
    {
      "speaker": "A",
      "text": "Yeah.",
      "start": 1106120,
      "end": 1106400
    },
    {
      "speaker": "B",
      "text": "Do you work on the weekends?",
      "start": 1106400,
      "end": 1107560
    },
    {
      "speaker": "C",
      "text": "Yeah. So the thing about weekends for me personally is if I, if I don't, I don't work like eight hours on Sunday and eight hours on Saturday. But I find that if I don't work at all on the weekends I lose some sort of like momentum or I feel like I'm coming back into my business and I've been gone for a week.",
      "start": 1108520,
      "end": 1130420
    },
    {
      "speaker": "B",
      "text": "Exactly. So on that same note, vacation, do you take time off or do you take time to recharge or anything like that?",
      "start": 1130500,
      "end": 1136260
    },
    {
      "speaker": "C",
      "text": "Yeah, so I actually recently took off. That's the other cool thing about having a business though is like you don't have, like, PTO necessarily. You can kind of do it when you want, as long as you have some sort of system in place. But, yeah, I recently. I recently went out to California for, like, a week. And then another cool thing is because it's fully remote, like, I could go on, like, a working trip and still work, but have a refreshed, you know, environment to work in.",
      "start": 1136420,
      "end": 1165470
    },
    {
      "speaker": "A",
      "text": "Yeah, yeah.",
      "start": 1165470,
      "end": 1166230
    },
    {
      "speaker": "C",
      "text": "If there's one last thing, something I hear really often is, like, you know, follow your passion. It's kind of bullshit. Like, follow. Instead of following your passion. Like, save your passion for what you want to do outside of work. What you should really be doing, at least in my experience, is following what you're good at and you like doing. Because if you find something you're good at and you enjoy doing, you're ahead of 99% of people already. And then you can just save your passion for. Because you don't want to make your passion your job. Yeah, yeah. So.",
      "start": 1170630,
      "end": 1205660
    },
    {
      "speaker": "B",
      "text": "And if you're good at something, it's a lot easier to just kind of do it every day, even when you're not making any money. It's like, if you're good at something, it feels good to do it, therefore.",
      "start": 1205660,
      "end": 1214740
    },
    {
      "speaker": "C",
      "text": "And. Yeah, so for me, that was video. I used to do them for free. You know, like, way back when I was, like, 16, I used to do them for free. And my mom was like, you need to start charging money for these. I was like, oh, really?",
      "start": 1214740,
      "end": 1226060
    },
    {
      "speaker": "A",
      "text": "Like, and now we're here, so.",
      "start": 1226140,
      "end": 1227860
    },
    {
      "speaker": "C",
      "text": "Yeah, yeah.",
      "start": 1227860,
      "end": 1228850
    }
  ]
}