{
  "source": "/home/salouri/Projects/starter_story/transcripts/e6COsh5wfNA/e6COsh5wfNA_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "These two roommates built a $1.8 million a year business in two years. They've worked with some of the biggest.",
      "start": 240,
      "end": 6160
    },
    {
      "speaker": "B",
      "text": "Names on the Internet and have done.",
      "start": 6160,
      "end": 7560
    },
    {
      "speaker": "A",
      "text": "Over 1 billion views on YouTube with a simple formula for going viral. But they have a confession. Their business is not profitable.",
      "start": 7560,
      "end": 16440
    },
    {
      "speaker": "C",
      "text": "We had like $40,000 of this debt for like months and months and months.",
      "start": 16440,
      "end": 20400
    },
    {
      "speaker": "A",
      "text": "They choose not to be profitable for a reason. Because their goal is to build a business that optimizes for having fun rather than profits. And like Mr. Beast, invest every dollar back into creating their own content and chasing their dreams.",
      "start": 20480,
      "end": 34290
    },
    {
      "speaker": "C",
      "text": "Make as much cash here, and then dump that all into building the next Disney.",
      "start": 34290,
      "end": 38730
    },
    {
      "speaker": "A",
      "text": "They invited me into their wacky studio in Chicago, broke down all the ways they make money, and showed me just how fun it is to build a business with your best friend. They also broke down their dead simple formula on how they can guarantee millions of views.",
      "start": 38730,
      "end": 51570
    },
    {
      "speaker": "D",
      "text": "Just humans are wired.",
      "start": 51650,
      "end": 54690
    },
    {
      "speaker": "A",
      "text": "In this video, Henry and Dylan put on a masterclass on how to chase your dreams while having a shit ton.",
      "start": 55890,
      "end": 61170
    },
    {
      "speaker": "B",
      "text": "Of fun along the way.",
      "start": 61170,
      "end": 62430
    },
    {
      "speaker": "A",
      "text": "I'm Pat Walls and this is Starter Story.",
      "start": 62670,
      "end": 64830
    },
    {
      "speaker": "C",
      "text": "Welcome.",
      "start": 65150,
      "end": 65790
    },
    {
      "speaker": "E",
      "text": "Thanks for having me.",
      "start": 66670,
      "end": 67630
    },
    {
      "speaker": "F",
      "text": "Tell me about who you guys are and what you built.",
      "start": 68350,
      "end": 70310
    },
    {
      "speaker": "E",
      "text": "I'm Henry, this is my best bud Dylan.",
      "start": 70310,
      "end": 72670
    },
    {
      "speaker": "D",
      "text": "And we built Clip Co, which is.",
      "start": 72750,
      "end": 75110
    },
    {
      "speaker": "E",
      "text": "An animation studio that does 2 million bucks a year in Top Line. And then we take basically all the profits from that and we make these crazy animated shorts of our own that tell, you know, really complicated ideas in a simple, funny way.",
      "start": 75110,
      "end": 87670
    },
    {
      "speaker": "F",
      "text": "Can you guys explain to me how your business works and what your goal is by creating this to fund your creative pursuits?",
      "start": 87670,
      "end": 95210
    },
    {
      "speaker": "E",
      "text": "So basically we've got pool of the best animators in the world, best animators and video editors. And then we work with a lot of companies that have a lot of media that they want to make, but they don't have anyone to execute on it. So we just match up awesome animator with company that doesn't have any editors and we basically let them work together.",
      "start": 95210,
      "end": 112010
    },
    {
      "speaker": "D",
      "text": "So that business, Clip Co is this.",
      "start": 112010,
      "end": 113970
    },
    {
      "speaker": "E",
      "text": "Cash flowing machine that allows us to hire, you know, we have like 10 of our own animators that just work on our content and pay us. So it cash flows into the content that we want to make and how.",
      "start": 113970,
      "end": 125010
    },
    {
      "speaker": "F",
      "text": "Much content you guys making.",
      "start": 125010,
      "end": 126150
    },
    {
      "speaker": "E",
      "text": "Our goal with content is like, can we just get out one short per day now I say that, but they're like one of the most highly animated 60 second shorts in the world. We say it's like south park for nerds. So we want to explain something in 60 seconds that's maybe really complex, but tell it in a funny and simple way.",
      "start": 126150,
      "end": 142310
    },
    {
      "speaker": "C",
      "text": "And we're also taking those shorts and turning them into an illustrated email. So basically, double the content.",
      "start": 142310,
      "end": 148150
    },
    {
      "speaker": "F",
      "text": "And what kind of numbers is this content doing?",
      "start": 148150,
      "end": 150230
    },
    {
      "speaker": "D",
      "text": "In the last year, putting out daily.",
      "start": 150230,
      "end": 151870
    },
    {
      "speaker": "E",
      "text": "Shorts, we've done a billion views combined. And then we just launched this Smart nonsense newsletter, which did like, 10,000 subs in the first month. And now we're three weeks later, and we're at, like, 20,000 subs.",
      "start": 151870,
      "end": 162110
    },
    {
      "speaker": "F",
      "text": "Take me through the timeline of when you guys first met and everything you've built since.",
      "start": 162190,
      "end": 166270
    },
    {
      "speaker": "C",
      "text": "I met Henry at this accepted students day in College in 2015. We're basically good friends through all of college. The only, like, entrepreneurial friends. We kept talking, and by 2020, we're like, hey, let's take these conversations and turn them into a podcast, and hopefully the whole world will listen.",
      "start": 166270,
      "end": 182270
    },
    {
      "speaker": "E",
      "text": "He's like, dude, like, I think if.",
      "start": 182270,
      "end": 184110
    },
    {
      "speaker": "D",
      "text": "We start a podcast and it'll be.",
      "start": 184110,
      "end": 186020
    },
    {
      "speaker": "E",
      "text": "About this, we'll call it Smart Nonsense. And, dude, based on my numbers, in six months, we could have a million people listening to this thing. And I'm like, sign me up. Three months later, we're running out of, like, unemployment money from the government, and the podcast has 14 views. And so that's when we were like, okay, we need to figure out how to make money. Service business was the best way to do that. We didn't really have anything. It was just us. We had some ideas.",
      "start": 186020,
      "end": 207460
    },
    {
      "speaker": "C",
      "text": "We turn that into an agency which prints a lot of money, and then we have all these animators and all this money, and we're like, 2022 is the year of making content. For the last year, we've been making YouTube shorts, and that's what's taken us from zero to a million subs on YouTube and a billion views.",
      "start": 207460,
      "end": 223190
    },
    {
      "speaker": "F",
      "text": "Where did the idea for Click the Agency come from?",
      "start": 223190,
      "end": 225950
    },
    {
      "speaker": "C",
      "text": "It was basically like, we made a podcast and hired editors abroad in the Philippines to help us produce it. We, like, did this whole system. So I'm like, let's try this little podcast system with our favorite podcasts, which. The first one was my first million.",
      "start": 225950,
      "end": 239510
    },
    {
      "speaker": "E",
      "text": "They're looking to crack into video. Sam Parr and Sean Puri have no idea how to do a video podcast. So they're hitting up Twitter like, yo, who's gonna help us with video? Should we do video vote in this poll or whatever?",
      "start": 239590,
      "end": 251170
    },
    {
      "speaker": "C",
      "text": "And we're like, dude, we'll do it for free. And we're there tomorrow. Yeah. And basically, like, forged plane tickets. We're like, dude, we're Literally there tomorrow.",
      "start": 251170,
      "end": 258410
    },
    {
      "speaker": "G",
      "text": "I hope you're at your house.",
      "start": 258410,
      "end": 259370
    },
    {
      "speaker": "C",
      "text": "And then Sam and Sean, like, are you guys serious? Like, what the fuck? What is this? So we had this strategy, like, we're crazy. We're gonna show you exactly what we're gonna do for you and then just beat you over the head with it until you pay us money. We tried this with the all in podcast. We wanna work with them. So, like, let's make one video for them that'll like, wake them up. Second video is like, oh, this is really interesting. Like, what's Henry doing? And the third video, they're like, how.",
      "start": 259370,
      "end": 281350
    },
    {
      "speaker": "G",
      "text": "Do we work with you?",
      "start": 281350,
      "end": 282030
    },
    {
      "speaker": "D",
      "text": "And it was cool.",
      "start": 282030,
      "end": 282630
    },
    {
      "speaker": "E",
      "text": "Like in All In's case, I remember the first blitz video went out and Jason Calacanis was like, I don't know what you want, but, like, you're hired.",
      "start": 282630,
      "end": 291150
    },
    {
      "speaker": "C",
      "text": "So that it woke him up, pissed him off, did all three on one.",
      "start": 291870,
      "end": 295629
    },
    {
      "speaker": "F",
      "text": "So you guys were basically just doing free work. How did you guys fund this?",
      "start": 296430,
      "end": 299870
    },
    {
      "speaker": "C",
      "text": "The first agency we worked with basically gave us a little bit of buffer. We have maybe a month of free work we can do, but they better pay us, like the day that month ends. Unfortunately, they didn't pay us. The day ended. So Henry's credit card basically came into our lives and we had like $40,000 of this debt for like months and months and months.",
      "start": 299950,
      "end": 319470
    },
    {
      "speaker": "E",
      "text": "And we were always of the mindset. We were like, okay, if we can't.",
      "start": 319470,
      "end": 322390
    },
    {
      "speaker": "D",
      "text": "Pay this credit card, what's the worst?",
      "start": 322390,
      "end": 324190
    },
    {
      "speaker": "E",
      "text": "It's a 20% premium.",
      "start": 324190,
      "end": 325750
    },
    {
      "speaker": "D",
      "text": "We got to like, we just have.",
      "start": 325750,
      "end": 326830
    },
    {
      "speaker": "E",
      "text": "To make 20% more money. That was kind of our mindset. We just have to sell one more client. We can do that.",
      "start": 326830,
      "end": 331270
    },
    {
      "speaker": "C",
      "text": "Luckily, we tend to grow the business to, like, pay it off, but it is this risky. Like, scary in the moment, but shit, we do have a lot of debt. Like, a lot's riding on this.",
      "start": 331270,
      "end": 338270
    },
    {
      "speaker": "F",
      "text": "You guys have worked with some hu.",
      "start": 338270,
      "end": 339460
    },
    {
      "speaker": "B",
      "text": "Huge names.",
      "start": 339530,
      "end": 340090
    },
    {
      "speaker": "F",
      "text": "Will Smith, Ali Abdaal Naval. How did you land huge clients like that?",
      "start": 340090,
      "end": 343970
    },
    {
      "speaker": "E",
      "text": "We called it squatter marketing.",
      "start": 343970,
      "end": 345250
    },
    {
      "speaker": "C",
      "text": "We're just going to pretend like they hired us and be the crazy person that like, makes videos for them for a year straight, just not getting paid. But because they share all our stuff, everyone thinks we work with them. They're like, oh, if all in wants to work with them, why wouldn't we? Because that's the pinnacle. So now we get all the clients from their network.",
      "start": 345250,
      "end": 362570
    },
    {
      "speaker": "B",
      "text": "Quick break. This is me five years ago, desperate to start my own business, but plagued with shiny object syndrome. I tried building SaaS tools, freelancing affiliate marketing. But none of these business ideas ever panned out to anything. But everything changed one day when I looked inside and wondered, what if instead I built a business around what I'm good at and what I'm passionate about? Well, that decision led me to building a business that now makes over a million dollars a year. And that's what Starter Story is all about. It's a community of thousands of founders who change their life by building an online business around their skills and their passions. Our 4000 plus case studies and business idea breakdowns will show you how regular people just like you found the right idea and turned it into millions. For example, Luke joined Starter Story and dove into our case study about a newsletter business that makes over $25 million a year. Just one month later, he launched his own newsletter business that did $5,800 in revenue in 30 days. So if you're serious about finding that right idea, click the first link in the description. We're running a special for the YouTube family. All right, enjoy the video. I'll see you around. Peace.",
      "start": 362650,
      "end": 428050
    },
    {
      "speaker": "F",
      "text": "You guys have done over a billion views on YouTube. You've created viral content to a science. So what's the secret of creating vi? How do you do it?",
      "start": 428130,
      "end": 435750
    },
    {
      "speaker": "D",
      "text": "When we were trying to engineer viral content, Dylan comes to me and he's like, what have people been watching forever for the last tens of thousands of years? And what will they keep watching? And we came to the conclusion it was like story. People were telling stories in cave paintings. So they will be around another 50,000 years, right? We were doing all this content before.",
      "start": 435750,
      "end": 453630
    },
    {
      "speaker": "E",
      "text": "That was like abstract. And I was talking about book quotes.",
      "start": 453630,
      "end": 456430
    },
    {
      "speaker": "D",
      "text": "And like, who knows what. And Dylan was like, Henry, just tell.",
      "start": 456430,
      "end": 459870
    },
    {
      "speaker": "E",
      "text": "A really good story.",
      "start": 459870,
      "end": 460710
    },
    {
      "speaker": "D",
      "text": "Humans are wired to listen to stories.",
      "start": 460710,
      "end": 463310
    },
    {
      "speaker": "E",
      "text": "So if your story is good on a 60 second clip, you can get.",
      "start": 463310,
      "end": 466070
    },
    {
      "speaker": "D",
      "text": "People to watch for 50. The human brain literally can't not finish watching a story.",
      "start": 466070,
      "end": 471130
    },
    {
      "speaker": "E",
      "text": "Like, we want to close those loops. So that was the big breakthrough with story.",
      "start": 471130,
      "end": 474650
    },
    {
      "speaker": "G",
      "text": "And then our advantage was we had this team of amazing animators so we could now animate these stories and bring.",
      "start": 474650,
      "end": 481570
    },
    {
      "speaker": "C",
      "text": "Them to life with basically our version of South Park.",
      "start": 481570,
      "end": 484650
    },
    {
      "speaker": "G",
      "text": "So now you're hooked on the story.",
      "start": 484650,
      "end": 486690
    },
    {
      "speaker": "C",
      "text": "Itself, and then you're just following the journey on screen.",
      "start": 486690,
      "end": 489130
    },
    {
      "speaker": "F",
      "text": "You guys have a team of 50 animators and editors. Tell me about how to hire great people and keep them on.",
      "start": 489130,
      "end": 495850
    },
    {
      "speaker": "G",
      "text": "Our principle has always been hire better. So our, our current team, we're not going to accept them unless they wow you. Meaning like, wow, this person is better than me. I would Learn from them. And then you look back and you have 50 people who are all just learning from each other. And it's so talent dense.",
      "start": 495850,
      "end": 511990
    },
    {
      "speaker": "D",
      "text": "When we're looking at people's portfolios, we.",
      "start": 511990,
      "end": 513950
    },
    {
      "speaker": "E",
      "text": "Should just trust our gut.",
      "start": 513950,
      "end": 515229
    },
    {
      "speaker": "D",
      "text": "If they're really good, our gut is always like, whoa. Like, did our. Did our jaw hit the floor where we like, wow. If we see someone work and our.",
      "start": 515229,
      "end": 522430
    },
    {
      "speaker": "E",
      "text": "Guts, like, on the fence, never going to work out.",
      "start": 522430,
      "end": 524700
    },
    {
      "speaker": "F",
      "text": "And where do you find this kind of talent?",
      "start": 524930,
      "end": 526410
    },
    {
      "speaker": "G",
      "text": "We started hiring when we were getting money from the government to survive. And we're like, okay, Henry will sleep on the floor so he doesn't need as much money. And I just wear the same T shirts every day. So we'll take the extra money and hire editors. But we couldn't afford, like, a 5, $6,000 editor in the U.S. but we.",
      "start": 526410,
      "end": 543050
    },
    {
      "speaker": "D",
      "text": "Knew we also couldn't afford to be editing content daily. If we wanted to make content daily, we need to outsource the editing immediately. Yeah, otherwise we'll burn out. We can't edit and make all the content. If we want to focus on the content, we need an editor immediately.",
      "start": 543050,
      "end": 556310
    },
    {
      "speaker": "C",
      "text": "So we hired in the Philippines. The Philippines is the best place in.",
      "start": 556310,
      "end": 560270
    },
    {
      "speaker": "G",
      "text": "The world for creative talent.",
      "start": 560270,
      "end": 561390
    },
    {
      "speaker": "F",
      "text": "What is the cost of something like that?",
      "start": 561390,
      "end": 563190
    },
    {
      "speaker": "C",
      "text": "Look like a lot.",
      "start": 563190,
      "end": 564190
    },
    {
      "speaker": "E",
      "text": "The cost is a lot.",
      "start": 565630,
      "end": 566870
    },
    {
      "speaker": "D",
      "text": "So our personal team is like, maybe.",
      "start": 566870,
      "end": 568470
    },
    {
      "speaker": "E",
      "text": "25 or 30 grand a month, which is funny because that's a lot of money to be paying for shorts that make five grand a month.",
      "start": 568470,
      "end": 576690
    },
    {
      "speaker": "D",
      "text": "So operating at a total loss. But for us, it's like, that never felt like much money because it was.",
      "start": 577160,
      "end": 583120
    },
    {
      "speaker": "E",
      "text": "Just cash flowing from the agency.",
      "start": 583120,
      "end": 584400
    },
    {
      "speaker": "D",
      "text": "We never saw it. It was never in our pockets. Like, might as well be, I don't.",
      "start": 584400,
      "end": 587800
    },
    {
      "speaker": "E",
      "text": "Know, lit on fire. Maybe this is the benefit of doing the Mr. B strategy of just throwing profits back into everything so it doesn't feel like we're spending anything.",
      "start": 587800,
      "end": 595440
    },
    {
      "speaker": "F",
      "text": "For anyone watching this video, I want to know what it's like to start a business with your best friend.",
      "start": 595440,
      "end": 600440
    },
    {
      "speaker": "D",
      "text": "I don't know how you could start.",
      "start": 600520,
      "end": 602360
    },
    {
      "speaker": "E",
      "text": "A business without your best friend at this point.",
      "start": 602360,
      "end": 605040
    },
    {
      "speaker": "D",
      "text": "The highs are so incredibly high and the lows are so gr. I guess one thing we do is.",
      "start": 605040,
      "end": 609900
    },
    {
      "speaker": "E",
      "text": "Just, like, use humor to get out.",
      "start": 609900,
      "end": 611180
    },
    {
      "speaker": "G",
      "text": "Of it every time. It's like, ducky, we're going to make 50 grand by tomorrow. How do we do that?",
      "start": 611180,
      "end": 615540
    },
    {
      "speaker": "C",
      "text": "He's like, dude, I don't know.",
      "start": 615540,
      "end": 616900
    },
    {
      "speaker": "G",
      "text": "But we do it every time. For any solo founder.",
      "start": 616900,
      "end": 619540
    },
    {
      "speaker": "C",
      "text": "Kudos to you, but we could never do it.",
      "start": 620020,
      "end": 621580
    },
    {
      "speaker": "G",
      "text": "This is like the best thing in the world.",
      "start": 621580,
      "end": 623060
    },
    {
      "speaker": "D",
      "text": "I'll also add like, so Dylan's a perfectionist through and through, sweats the details, every single one of them. And my skill set is very much.",
      "start": 623060,
      "end": 631820
    },
    {
      "speaker": "E",
      "text": "Like, let me just ship things that are 80% good enough stuff.",
      "start": 631820,
      "end": 634600
    },
    {
      "speaker": "D",
      "text": "So me without a Dylan over time just like starts sprinting in the wrong direction. Dylan without me doesn't get enough stuff.",
      "start": 635080,
      "end": 642480
    },
    {
      "speaker": "E",
      "text": "Shipped out the door to have iterations.",
      "start": 642480,
      "end": 644040
    },
    {
      "speaker": "D",
      "text": "So I think that kind of co.",
      "start": 644520,
      "end": 646320
    },
    {
      "speaker": "E",
      "text": "Founder of maybe the executor and maybe the perfectionist or the visionary or the builder and the seller, I do think like that's probably maybe the best archetype, but maybe it's all I know.",
      "start": 646320,
      "end": 657800
    },
    {
      "speaker": "F",
      "text": "So you guys have this business that makes $2 million, but your whole focus is on creating content.",
      "start": 657800,
      "end": 663560
    },
    {
      "speaker": "C",
      "text": "Why Content over money saw the pinnacles of success. Luckily, like doing all this blitzing, we got into the room into literal parties with some of the richest, most powerful people. And the funny thing was a lot of them were jealous of us and what we could do. So they would ask us about like, hey, how do you build a personal brand? Like, how do you grow? And we're just like, let's just make enough money, we don't need a billion dollars like they do and just funnel all our money into content and just kind of like shortcut what they did.",
      "start": 663800,
      "end": 690340
    },
    {
      "speaker": "F",
      "text": "Walk me through a day in the.",
      "start": 690340,
      "end": 691300
    },
    {
      "speaker": "A",
      "text": "Life for you guys.",
      "start": 691300,
      "end": 692060
    },
    {
      "speaker": "F",
      "text": "You got two really sides of the business that you're working on. What does a typical day look like.",
      "start": 692290,
      "end": 696290
    },
    {
      "speaker": "E",
      "text": "For you with these businesses at this point? Because we've outsourced the entire running of the agency. It's just like, explore, ask the question, why find that thread, go down the rabbit hole. And then our job is just like, tell it in a 60 second book report. Which is super fun. So we just get to learn and be curious. And then I spend maybe an hour a day just like floating around the agency, making sure there's no major fires. And then we usually talk in the afternoon and he's got some crazy ideas, something he's been thinking about that we explore.",
      "start": 696290,
      "end": 724360
    },
    {
      "speaker": "F",
      "text": "What is the long term vision? What does the future look like for what you guys are doing?",
      "start": 724360,
      "end": 727880
    },
    {
      "speaker": "E",
      "text": "We're definitely lifestyle first. So we're just like always optimizing for fun. What's the path of least resistance? How can we have the fewest headaches? Like, how can we just be happiest in the short run? So it was always like, how can we put the right people in place to make sure we're working on the content, on the stuff. One thing we like is this idea of Being above the clouds, it came from Colin and Samir, but it's like you need to stay above the clouds, have everyone doing whatever they need to be doing below the clouds. But the second you, the second the leaders or the explorers, the visionaries, the second you come below the clouds and you're like doing day to day stuff and like answering this and doing that fire, you're in a lot of trouble. Beyond that, we don't, we don't plan too far out. I have this tendency of planning and planning and planning and getting the logo design and doing the artwork and like not actually doing anything. So Dylan having us just like default to action. Our plan is in the short run, optimize for happiness and then like as a byproduct, just teach as many people as possible. Seems to be working.",
      "start": 727880,
      "end": 778010
    },
    {
      "speaker": "F",
      "text": "Where can people watching this YouTube video get ideas on how to make money now?",
      "start": 778170,
      "end": 782490
    },
    {
      "speaker": "C",
      "text": "We started with our own itch. We needed a podcast to get edited, so we hired editors and then oh, turns out other people have podcasts that they need edited so they just used our editors. Turns out they could pay us for that. So we have always just subscribed to do what you want, create the product you want. And there are probably other people like you. So sell them that product.",
      "start": 782490,
      "end": 801250
    },
    {
      "speaker": "E",
      "text": "Yeah, if we create something we truly need right now, there's probably 10 other people that need it and if we can charge them a couple thousand bucks, that's enough money to live. So scratching your own itch.",
      "start": 801250,
      "end": 809840
    },
    {
      "speaker": "F",
      "text": "Last question. We asked the founders, if you could go on your guys shoulders and give each other advice, what would you do differently or what advice would you have for founders?",
      "start": 809920,
      "end": 818120
    },
    {
      "speaker": "E",
      "text": "The tendency, because it was my tendency, is to just over complicate almost everything in business. I'm like thinking about oh, what's our subscription price? And churn's too high. And like we need account managers and we need project managers and we need quality assurance. And Dylan's like, no, if we can match an animator with a client for two years, everything else goes to zero. Nothing else matters.",
      "start": 818120,
      "end": 839180
    },
    {
      "speaker": "C",
      "text": "I think a big misconception is how you approach business. Business shouldn't be this. You make money 10 years in the future. Which is kind of where Henry was going originally versus I'm like how do I make money ten hours in the future? How do I do something now, make money today? I think people just get scared about business and end up not doing anything. When you could just go and pitch your idea and try and make 10 bucks off it. That's the advice I would give to anyone thinking about becoming an entrepreneur.",
      "start": 839180,
      "end": 862770
    },
    {
      "speaker": "F",
      "text": "Thanks for having me, guys.",
      "start": 862770,
      "end": 864050
    },
    {
      "speaker": "C",
      "text": "Thanks for coming through.",
      "start": 864210,
      "end": 865570
    },
    {
      "speaker": "F",
      "text": "Follow this advice and you'll get 1 billion views in one year.",
      "start": 865650,
      "end": 869090
    },
    {
      "speaker": "E",
      "text": "Nice.",
      "start": 869330,
      "end": 869810
    }
  ]
}