{
  "source": "/home/salouri/Projects/starter_story/transcripts/loXc0Tyi4R4/loXc0Tyi4R4_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "So my mobile app, Puff Count, is currently doing $40,000 per month in recurring revenue. I honestly don't think you need any experience to build mobile apps, because to be like, I didn't have any.",
      "start": 320,
      "end": 10280
    },
    {
      "speaker": "B",
      "text": "How did this Guy Build a $40,000 per month mobile app with no coding experience? Well, it's all because of his unconventional approach to shipping.",
      "start": 10280,
      "end": 19520
    },
    {
      "speaker": "A",
      "text": "Marketing really is 95% of the success of a mobile app.",
      "start": 19680,
      "end": 24080
    },
    {
      "speaker": "B",
      "text": "Stephen Cravatta started his journey as a typical online entrepreneur, jumping from one business model to another while not seeing really any success with anything. But one day, he stumbled upon mobile apps and immediately recognized the opportunity.",
      "start": 24160,
      "end": 40060
    },
    {
      "speaker": "A",
      "text": "Not a lot of people are doing mobile apps right now, but it's a lot easier than a lot of people think to get into. It's untapped.",
      "start": 40300,
      "end": 46460
    },
    {
      "speaker": "B",
      "text": "So I gave Stephen a call and asked him about his business and how anyone can start building similar profitable mobile apps from scratch. Luckily, he shared his entire process. How to find and validate your idea, how to build an app with no experience, and how to market and monetize it. All right, let's get into it. I'm Pat Walls, and this is Starter Story. What's up, Stephen? It's exciting to have you. Thanks for joining the show. Can you tell me a little bit more about yourself and the business that you built?",
      "start": 46860,
      "end": 79000
    },
    {
      "speaker": "A",
      "text": "Yeah, sure. I'm Stephen Gravada. I build viral mobile apps. I've amassed over 12 million downloads on my apps in total. I'm working on an app right now called Puff Count that is currently doing $40,000 in monthly recurring revenue. So this is the last 30 days of sales for PuffCount. As you can see, we did $43,000 in sales. If we look at the last 90, we have done just over $112,000 in sales.",
      "start": 79080,
      "end": 105840
    },
    {
      "speaker": "B",
      "text": "So before we get into how people can actually start building these apps, can you tell us what you really like about this business model?",
      "start": 106479,
      "end": 113120
    },
    {
      "speaker": "A",
      "text": "With apps, there's unlimited scale. You can reach anyone on the planet, and all you have to do is build it once and you can sell it a million times. So it's unlike any other business. But also it's a lot easier than a lot of people think to get into. With no code tools, and with upwork, you can build these apps in less than a month. And there's templates online so you can start. You don't have to start from scratch anymore. The biggest misconception people have is that, like, it's hard to get into. So, like, not a lot of people are doing mobile apps right now. It's Untapped. But I honestly don't think you need any experience to build mobile apps. Because to be honest, like, I didn't have any. I don't design anything, I don't develop anything. I just have the idea and I know how to put a team together. Like, you just need to be driven and not not give up on your idea and.",
      "start": 113280,
      "end": 151830
    },
    {
      "speaker": "B",
      "text": "Got it. Okay, let's talk about how you can actually build something like this step by step. Everything starts with an idea, right? Can you share your ideation process?",
      "start": 152060,
      "end": 162220
    },
    {
      "speaker": "A",
      "text": "I take mental notes of problems that I experience in my day to day life. If you're building an app from the position of solving a problem for yourself, you become the ideal user and that makes you so much better at creating the product and making it useful for the people you're trying to reach. If you can solve a problem for someone and you can kind of take them through this transformation, whether it be weight loss, dieting, quitting, vaping, if you can improve someone's life, they are going to love your product and the marketing becomes much easier as well. Right, because you can be like, hey, you have XYZ problem, here's the solution. So everything becomes easy if you're solving a problem for someone.",
      "start": 162620,
      "end": 194200
    },
    {
      "speaker": "B",
      "text": "Stephen is the perfect example of how someone with zero experience turned a simple idea into thousands of dollars. But that came with knowing the right information and having the right problem to solve. Now imagine there was a place that gave you all this. The problems to solve, the blueprints to solve them, and the strategies that turn simple ideas into million dollar online businesses. Well, that's what you're going to get at Starter Story. It's a library of over 4,000 case studies and business idea breakdowns where you can access this, all backed by data from real entrepreneurs. So if you're serious about building a profitable side project, head to the first link in the description and we're going to give you 52 micro SaaS, ideas just like Stephen's, so you can get started on your journey right now. Okay, so scratching your own itch is definitely the way to go if you want to find a painful problem. But what do you do after you get the idea for your app? How do you actually validate it's an idea worth building?",
      "start": 194600,
      "end": 256520
    },
    {
      "speaker": "A",
      "text": "I did market research, I looked at sensor tower, looked at other, you know, quit drinking or quit smoking cigarettes apps and I saw that they were crushing it. Looked at Google Trends, saw that vaping was on the rise. And then probably the most important part was I looked on TikTok, I saw that Vape videos were going super viral on TikTok. But I think where a lot of young entrepreneurs especially fall short is they. They give up on the idea too quickly. If you have a good idea and it solves a problem for people, like, commit to it, just like me. For Puff count, the first four to six months, I didn't make any money. It was only after I locked in the marketing. Like, marketing is 90% of being successful and validating an idea.",
      "start": 256920,
      "end": 290820
    },
    {
      "speaker": "B",
      "text": "All right, we'll definitely touch on the marketing later, but for now, let's focus on building the app. What do you do after the idea is locked in?",
      "start": 290820,
      "end": 298590
    },
    {
      "speaker": "A",
      "text": "What I do is I brain dump everything. So I get on Google Docs and I brain dump all the ideas, all the features that I want in the app. I put all the competitors there, and I kind of write out, you know, what I think the app should do. And then from there, I literally take a piece of paper and a pencil and I start to sketch out the app. When you're looking at these competitors and you're seeing who's making money in your niche in the market, on the App Store, you should be taking note of everything. Their features, their onboarding, their UI that will give you a good guide into what a good app looks like. And then you take those sketches and you upload them to a site called 99designs. You upload those sketches and you say, here's the app. Here's the premise of it. Here are the features. Make my app come to life and you'll have 50, 60, sometimes 70 plus. Professional UI designers all submit their idea of what your app should look like. This is how I developed the UI for literally all of my apps.",
      "start": 298590,
      "end": 343680
    },
    {
      "speaker": "B",
      "text": "Okay, and what about turning that design into an actual working app? How do you build it with no. No coding experience.",
      "start": 343680,
      "end": 350550
    },
    {
      "speaker": "A",
      "text": "You go on to upwork and you look for a developer. You can price it based on, like, the complexity of your app. For an app like Puff counts, fairly straightforward. Couple main features, you get that done for less than five grand, right? You can get the MVP out there. I recommend only hiring developers from Eastern Europe. They're going to give you the best quality code for a cheaper price. Once you have your developer that you'd like to go with, you do it on a per project completion basis. So I don't pay anyone per hour. I pay them when the app is complete. It's on the store. There's no bugs, but 100%, you can build an app for less than a thousand dollars. You can go to a website called ThemeForest and you can download pretty decent starter template for any app out there. And again, you know, just launching an mvp like keep it simple. And if your budget is tighter, like the simpler your app the better.",
      "start": 350950,
      "end": 394060
    },
    {
      "speaker": "B",
      "text": "And how do we trust the developer? What if they steal the idea for our app?",
      "start": 394380,
      "end": 399100
    },
    {
      "speaker": "A",
      "text": "It's never been a problem for me. And also your ideas are worth absolutely nothing. And more likely than not, the idea that you have for this app already exists. So like the idea is out there. You just have to trust someone. I always take like a 15 minute interview call with with the people that I like from the applicants on upwork. I get their vibe. I see. Are they coming to the table with more ideas for my app? Do they seem excited about it? How do they present? But you have to get past that fear of hiring someone online that you don't really know. Like that's part of being a founder is finding great talent, trusting them and iterating as you go.",
      "start": 399340,
      "end": 430570
    },
    {
      "speaker": "B",
      "text": "Okay, now let's talk about the elephant in the room. Marketing. Share your strategy.",
      "start": 430890,
      "end": 436410
    },
    {
      "speaker": "A",
      "text": "Marketing really is 95% of the success of a mobile app. And TikTok is the best way to market any app. The only thing you need to be successful on TikTok is you need to know how to do market research. So that's exactly what I did. I went on TikTok, I typed in vaping and I saved all of the most viral videos there and I put them into a spreadsheet so so I could really understand what the hook was, what the value was, how they were shooting the content. For example, this one that got 8.3 million views drove tens of thousands of downloads for puff count. I saw a viral video, this guy had like 20 million plus views taking apart a vape. So I was like, okay, cool, I'm going to use the same concept and I'm going to show people exactly what are in a vape. And then at the end, conveniently call to action, baby. Nothing crazy. I think where a lot of people go wrong is like they'll make the entire video about their products and they'll talk about the features and all this other stuff and then it becomes a clear sale sales video. Like that sucks. No one wants to watch a sales video on TikTok. My TikToks are entertainment. First call to action. At the end, a quick two second call to action.",
      "start": 436570,
      "end": 496500
    },
    {
      "speaker": "B",
      "text": "Okay, so right now TikTok Organic is the bread and butter of marketing mobile apps. But are there any other marketing channels that have worked well for you?",
      "start": 496660,
      "end": 504820
    },
    {
      "speaker": "A",
      "text": "The beautiful thing about organic TikTok is if the video does well organically, it's a great indicator that it's a great creative in general. You can put them on paid ads and click the spend my money button. That's literally all you have to do. Because as long as the creative is good, the algorithms on Facebook ads or TikTok ads or whatever, they will optimize around that solid creative and they will find you customers. What you can also do is you can find influencers on these platforms and you can pay them to make content for you. In my experience, it's tough to, you know, work with influencers. They always want a ton of cash and they don't really care, you know, how the videos perform for you. But you can find those diamonds in the rough creators and you can reach out to them and get pretty cheap content and you can use that and scale that way as well.",
      "start": 504980,
      "end": 545670
    },
    {
      "speaker": "B",
      "text": "Okay, cool. Now let's talk about the next step of the process of building a mobile app. Monetization. What's the best strategy to turn these users or turn these eyeballs into paying customers?",
      "start": 545750,
      "end": 558790
    },
    {
      "speaker": "A",
      "text": "Yeah, so there's, there's many different ways to monetize apps. And in my first games, I monetized through ads because people were on the app all the time, they were playing the game a lot. So the ads worked well for Grid and wordle. But for these tool focused apps like Puff Count, ads don't really work because you're not expecting the user to be on your app for a super long period of time. So the way you monetize that is through in app purchases, you need the user to either buy your app or commit to monthly, yearly, weekly subscription. The kind of strategy that everyone is using now is the app is free, you go through the onboarding and then you hit what is called a hard paywall. This is essentially a screen that asks you to pay, and if you don't pay, you can't access the features in the app. A hard paywall is unskippable. When I changed puffcount to a hard paywall and I made users commit to a free trial before they could use any features in the app, it changed my business overnight. My conversion rate shot through the roof upwards of 20, 25%.",
      "start": 559190,
      "end": 615110
    },
    {
      "speaker": "B",
      "text": "Nice. And what about pricing? How can someone find the best price point for their app?",
      "start": 615590,
      "end": 620910
    },
    {
      "speaker": "A",
      "text": "I tested different pricings. I started at $4, went up to $12. Right. With a lot of users coming to your app, you're getting a lot of data and you're understanding which price point gives you the highest ltv, the highest Lifetime value. I use Super Wall to do this. You can remotely configure your paywalls and you can change the price without sending app store updates. You can do it much quicker and Super Wall will actually tell you which price point will give you the best ltv. So I just optimize for that, the highest LTV price point.",
      "start": 621070,
      "end": 647720
    },
    {
      "speaker": "B",
      "text": "You mentioned earlier that before getting hit with the paywall, the user is being walked through the onboarding process. What's your experience with that?",
      "start": 648040,
      "end": 656360
    },
    {
      "speaker": "A",
      "text": "The onboarding is super important because this is an opportunity for you to walk the user through their own problems. So, for example, on Puff Count, my onboarding is extensive and I ask the users a lot of questions and some people say that's annoying. I don't want to do that. I just want to get into the app. But the data has told me that if I walk the users through the onboarding, they commit time and I'm able to walk them through their problem that puffcount is solving. So when they hit the paywall, they've thought about their problem a lot and they're like, wow, I actually really do need to quit. Or I really do need this product. And they're much more likely to convert.",
      "start": 656520,
      "end": 685340
    },
    {
      "speaker": "B",
      "text": "All right, now let's get technical. What tools and software do you use to build all of these apps?",
      "start": 685740,
      "end": 692060
    },
    {
      "speaker": "A",
      "text": "The tech stack I use to build apps is pretty short. I use upwork to find and hire developers. I use 99designs to get the UI built. I use Super Wall to ab test my paywalls. Optimizing your paywall is how you're going to make money with your app. Like, you need to optimize your paywall and find the highest LTV. So that is 100% essential. Everyone who has a mobile app should be using SuperWall. I use Revenue Cat for analytics data. Revenue Cat is good too, because that will give you more data on your user lifetime value. And again, your user lifetime value is like the most important metric in your app. You need to understand how much paying users are generating you over their lifetime so that you know how much you can spend on paid ads or on influencers or on installs. And as long as your customer acquisition cost is lower than your ltv, you're you're making money. I use Apps Flyer as my mmp. It connects with my my mobile app and Facebook or TikTok ads and sends data back to those platforms. I use TikTok and Facebook ads to send traffic. I also use Mixpanel and Amplitude to get kind of more in depth analytics in my products. And see what people are doing in the app once they do download it, once they do pay and cheat code is like, you should stay on the free plans. I don't think you should ever really upgrade mixpanel or amplitude. Like you should get your data, understand what you need to change and then get out.",
      "start": 692060,
      "end": 764830
    },
    {
      "speaker": "B",
      "text": "All right, for anyone looking for ideas, I want to ask, what do you think is the most lucrative niche to build an app in right now?",
      "start": 765230,
      "end": 772590
    },
    {
      "speaker": "A",
      "text": "When I look at like the most profitable niches in mobile apps, I think a lot of them do have to do with helping people be better, lose weight, quit vaping, quit drinking. Anything in the health space I think will absolutely crush. And of course like there are already apps that are doing really well. Like in fitness you have like My fitness Pal and you have all these weight training apps. But it comes down to the marketing. Can you get in front of people at a cheaper cost than these mobile apps? Right. Being a young founder, you truly do have an advantage because all these old heads in the industry, these big slow moving companies that never iterate on their idea, a small nimble entrepreneur can take them out. All it takes is one viral TikTok.",
      "start": 772910,
      "end": 812100
    },
    {
      "speaker": "B",
      "text": "All right, another question for you. Some people watching this right now may have started a couple other things before but didn't see immediate results and eventually gave up or quit. What advice would you give to those people?",
      "start": 812180,
      "end": 823220
    },
    {
      "speaker": "A",
      "text": "The struggle of building something new is it's never going to be perfect on the first try. But I've done this enough times now to know it's a process and you have to keep iterating. I know it's a good idea, I know it can make money. That's all I need. I don't need it to work super quick, right? Like I just need that validation and then I can go out into the market and talk to, talk to customers and make it better over time. Everything is built over time. Puffcount's been live for four years, but only last six or seven months. Have I really made decent revenue per month. It takes time, it takes commitment and you have to be willing to learn.",
      "start": 823540,
      "end": 854950
    },
    {
      "speaker": "B",
      "text": "All right, next question. How does a day in the life look like for a mobile app builder like you?",
      "start": 855350,
      "end": 860630
    },
    {
      "speaker": "A",
      "text": "I'm actually nomading. I've been traveling for about six months now. I'm in Europe time. So my day doesn't start till later in the afternoon. Like 1pm is when I start hopping on the phone and talking to people. So I have my morning to myself, make a coffee, go to the gym, get a workout in and then I'm in the zone to start, you know, building, start talking to my team, start taking sales calls, whatever it is. And I work till 7, 8, 9pm, sometimes much later, depending on what's getting done. And then, you know, on the weekends I have a chance to explore an entirely new city and new culture and meet new people and try new things. So inspiration is a fleeting feeling and when you do feel inspired to build an app or build a new project or work super hard, like you have to take advantage of it. Going back to why I kind of like decided to be a nomad and travel, like it's so I can do more of that. So when I had these moments of inspiration, I wasn't distracted by anything I can lock in.",
      "start": 860790,
      "end": 908000
    },
    {
      "speaker": "B",
      "text": "Alright, last question that we always ask. If you could stand on young Steven's shoulders and give him some advice or advice for anyone who wants to make it in this online business world, what advice would you give?",
      "start": 908240,
      "end": 919920
    },
    {
      "speaker": "A",
      "text": "First of all, it's not as hard as you think. Like, you just have to be driven and you have to, you know, be willing to work with people who have skill sets that you don't, outsource what you're bad at and build a team around you, Build a team that you trust, treat your team well, and again, don't give up super early on the idea. It takes months, sometimes years for a project to take off relentlessly talk to users, get feedback and iterate based on data. A huge mistake that I see first time mobile app founders doing is like, they're like, hey, I have this random idea for a feature in my app that I think I'm going to spend two months developing right before launching my mvp. Don't do that, like go to market with something simple that you can afford, get feedback from users and then build on top of it with your team.",
      "start": 920160,
      "end": 960070
    },
    {
      "speaker": "B",
      "text": "All right, Steven, thank you so much for your time. The businesses that you've built are amazing and thank you for coming on here and sharing it with everyone.",
      "start": 960470,
      "end": 968870
    },
    {
      "speaker": "A",
      "text": "Peace, brother.",
      "start": 969030,
      "end": 969830
    },
    {
      "speaker": "B",
      "text": "Yo guys, I really hope you enjoyed the rest of the video and got some good takeaways from Steven. But I want to say something quick. At the end of the day, the point of these videos is to inspire you and show you that this is possible so that you can go start your own thing on your own. While learning is important and will give you new ideas, action is the thing that's actually gonna move the needle forward and take you where you want to go. So research, learn, find an idea and then go build that shit as fast as you can. If you're still feeling a little lost right now, click that first link in the description and you're gonna get a free list of micro SaaS business ideas so you can get going on your side project. Much love and I'll see you guys.",
      "start": 970070,
      "end": 1012510
    },
    {
      "speaker": "A",
      "text": "In the next one.",
      "start": 1012510,
      "end": 1013230
    },
    {
      "speaker": "B",
      "text": "Peace.",
      "start": 1013470,
      "end": 1013950
    }
  ]
}