{
  "source": "/home/salouri/Projects/starter_story/transcripts/7LZ0MTkNr34/7LZ0MTkNr34_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "This is Alex and he makes over a million dollars a year with a business model that nobody's talking about. Affiliate marketing. He invited us into his house in California to show us his exact websites and how he built them on just a few hours a day while working.",
      "start": 320,
      "end": 17080
    },
    {
      "speaker": "B",
      "text": "A full time job.",
      "start": 17080,
      "end": 18080
    },
    {
      "speaker": "C",
      "text": "Yeah, the aha moment for me in terms of unlocking my side hustling and my ability to build a business was.",
      "start": 18160,
      "end": 23840
    },
    {
      "speaker": "A",
      "text": "But Alex's website made $0 for months until one day he uncovered something about the Google algo that changed everything.",
      "start": 24000,
      "end": 33660
    },
    {
      "speaker": "C",
      "text": "If you're building a business that relies on SEO, you want to go after.",
      "start": 33820,
      "end": 36780
    },
    {
      "speaker": "A",
      "text": "In this video we'll dive into how to build a business while you have a full time job. Niches that make $100,000 a month. And the secret strategy that Alex used to grow to a million dollars a year.",
      "start": 36860,
      "end": 48700
    },
    {
      "speaker": "C",
      "text": "The smart kind of innovative moment for us was the idea of just directly.",
      "start": 48940,
      "end": 53460
    },
    {
      "speaker": "A",
      "text": "I'm Pat Walls and this is starter story.",
      "start": 53460,
      "end": 56140
    },
    {
      "speaker": "C",
      "text": "Well Alex, nice to meet you.",
      "start": 57830,
      "end": 59830
    },
    {
      "speaker": "D",
      "text": "Thank you for having me in your lovely home.",
      "start": 59830,
      "end": 61430
    },
    {
      "speaker": "C",
      "text": "Yeah.",
      "start": 61430,
      "end": 61910
    },
    {
      "speaker": "D",
      "text": "Tell me about who you are and what you built.",
      "start": 61910,
      "end": 63950
    },
    {
      "speaker": "C",
      "text": "I'm Alex. I am the founder of finvs fin.com it's a popular product review site that helps visitors on the web compare different health and wellness options. It's now a seven figure revenue business. Started the business as a side hustle in 2018 and never looked back. Yeah.",
      "start": 63950,
      "end": 80990
    },
    {
      "speaker": "D",
      "text": "What does the actual business model, how does it work?",
      "start": 80990,
      "end": 82950
    },
    {
      "speaker": "C",
      "text": "We drive shoppers to brands, I make partnerships with those brands and every time somebody buys something referred from our site on one of those partner sites, we make a commission of some kind.",
      "start": 82950,
      "end": 92440
    },
    {
      "speaker": "D",
      "text": "Yeah. So you're essentially a middleman between shoppers and these brands.",
      "start": 92440,
      "end": 96040
    },
    {
      "speaker": "C",
      "text": "That's right. Yep, totally.",
      "start": 96040,
      "end": 97680
    },
    {
      "speaker": "D",
      "text": "So you started Finn versus Finn while you had a full time job. Can you tell me that story?",
      "start": 97760,
      "end": 102080
    },
    {
      "speaker": "C",
      "text": "Both of my parents were entrepreneurs. I kind of knew from day one that that was always my dream. My idea right out of college was hey, why don't I go work with some early stage founders and eventually have an idea and meet enough people and build enough skills to to be successful as an entrepreneur. But what I found in my life as a marketer at early stage companies is that it's not a 9 to 5. It's really that you're sort of having a founder mentality in order to be successful. A big aha moment for me was this idea that hey, I need a true 9 to 5. I need to be able to close my work laptop at 5 so that I can side hustle and you know, find a path for my Own entrepreneurship. Really the key to that was working at a larger company.",
      "start": 102240,
      "end": 140450
    },
    {
      "speaker": "D",
      "text": "Now you got this more chill work, life balance. Tell me how you get the idea for Finn versus Fin and what is the journey look like from there?",
      "start": 140450,
      "end": 146910
    },
    {
      "speaker": "C",
      "text": "I was working at a fintech company at the time. The first iteration of a product review, product comparison site was just that stupid, like fintech, fin versus Fin. And so we were going to compare. Fintech companies quickly saw $100 million Series A's venture funding going to a wide range of telemedicine companies and thinking, huh, there's no content online about that. And that's a pretty considered purchase. You know, if you're going to buy a medical product, how are you going to make that decision by yourself? How do I know which one to go trust? So it's kind of like scratching our own itch there in terms of what of content to write. But yeah, I wrote the first 60 articles myself. I didn't hire anyone learning WordPress at the same time. That's where the site was built. Typically in the beginning we would drive traffic through organic SEO, kind of anticipating the series of products or queries that shoppers might be making online. You know, what are shoppers searching for essentially is the first question. And you can meet that demand with content. The smart kind of innovative moment for us was the idea of just partnering with brands directly. I'd say it took us about six months before we saw a significant amount of organic traffic where I felt comfortable starting to reach out to the brands that we were driving traffic to and had enough confidence to say, I'm pretty sure we're driving sales. I don't see those numbers on my end, but there could be more if we work together. It's a pretty compelling pitch. And they name their price in terms of the customers that you're willing to drive. So at this point the numbers, the revenue is starting to seem shockingly good. Unbelievable. Yeah. When you first have that aha moment like this could be a business and imagine what could happen when you step on the gas.",
      "start": 146910,
      "end": 237470
    },
    {
      "speaker": "D",
      "text": "Yeah, you're starting to make some money, you're starting to balance. Do I still work my full time job? Do I not? What does that look like? What does that journey look like for you?",
      "start": 237470,
      "end": 244190
    },
    {
      "speaker": "C",
      "text": "So at some point, you know, maybe a full year in, I felt like my income was being replaced. It could be replaced. At the same time I think there's a fear or there was a fear for me around is this legitimate and will this last? And how foolish if you quit your day job and it doesn't really last for very long and then where are you? You know. So I think at that point I just said okay, one year, we'll see. And if the lights are still on in a, then this is super fun. And I could see myself doing this full time. Yeah.",
      "start": 244190,
      "end": 271570
    },
    {
      "speaker": "D",
      "text": "How much were you making from Finn vs Finn at the time that you're working a full time job?",
      "start": 271570,
      "end": 276090
    },
    {
      "speaker": "C",
      "text": "I guess I didn't feel comfortable making that switch until my income was replaced. So I was making 150k in salary. So that's kind of my own personal earnings from the site when I felt comfortable making the switch. Yeah.",
      "start": 276090,
      "end": 288210
    },
    {
      "speaker": "B",
      "text": "My favorite part about Alex's story is that he didn't quit his full time job until he was making $150,000 with this new side project. And just like Alex, I actually did the same thing. I started a million dollar business while I had a full time job, but it wasn't easy. It required having the right idea and a solid execution plan in place. If you're curious about doing something similar and you have a full time job, well, we're running a free workshop on how to build a million dollar business on just two hours a day. We'll talk about how to overcome self doubt, how to find a million dollar business idea and exactly how to execute on that idea on just two hours a day. Head to the first link in the description to save your seat. We have just a limited number of spots.",
      "start": 288210,
      "end": 333360
    },
    {
      "speaker": "D",
      "text": "See you there. Back to the video.",
      "start": 333440,
      "end": 335040
    },
    {
      "speaker": "B",
      "text": "Peace.",
      "start": 335440,
      "end": 335920
    },
    {
      "speaker": "D",
      "text": "You guys really weren't making money for months. Can you tell me about the breakthrough moment where you started to realize that this could be a business?",
      "start": 336160,
      "end": 342480
    },
    {
      "speaker": "C",
      "text": "We identified the opportunity for health and wellness and that was like a bullseye. Right. We were amongst the first in the world to review some of these telehealth and telemedicine platforms which are now public and household names and super common. So I feel like, you know, in some sense that is the secret sauce. Figuring out a niche that not super crowded. You can't win in a crowded space when you're. When you're young and new and your site isn't authoritative on any level, but you can win queries that nobody has ever written something for. So generally if you're hunching for ideas that meet that criteria, I would say it has to be new and there has to be sort of high margin in that product category and there has to be kind of a lot of activity or momentum that will keep it going. A space where no one has talked about those things, but it has a lot of potential because it's tried and true. At the end of the day, it's not going to just be here and an end.",
      "start": 342480,
      "end": 390790
    },
    {
      "speaker": "B",
      "text": "What does your keyword research process look.",
      "start": 390790,
      "end": 393830
    },
    {
      "speaker": "D",
      "text": "Like from starting to research the keywords and then writing the articles in the early days?",
      "start": 393830,
      "end": 398230
    },
    {
      "speaker": "C",
      "text": "If you're gonna, if you're building a business that relies on SEO, you wanna go after low competition, long tail keywords. If you're in the audience that you're trying to serve, they might be just super intuitive to you. There's query patterns as well that you start to recognize that are high intent. If you have the pattern, it's just about fitting in the product or the brand or best this for that. In the early days it was mostly focusing on the brands that we wanted to, okay, this is a space we want to be in or maybe we've already written about and we have some traction in. Okay, so who are the players in that space? Who do we actually think is going to be here in three years and then strive to write the very best thing online about that brand? Sometimes that means going more in depth than the article that's number one on Google. Sometimes it means being more concise and more to the point. It's just what is the true intent behind the query that somebody typed in and how well does that piece of content that you're creating meet that intent? That's how you'll win. Be there first, write the first thing online about it and write the best thing.",
      "start": 398230,
      "end": 453430
    },
    {
      "speaker": "D",
      "text": "So everything's going great, you're gaining traction, you're building this business. What happens next?",
      "start": 453590,
      "end": 457990
    },
    {
      "speaker": "C",
      "text": "I decided to go full time at the business after about two years. My business partner, who I started the business with, didn't want to forego his career and sort of always wanted this to be a side hustle, which at the time I very much respected. It's where we started. It was our agreement. The solution to that really was me buying him out. Now on the second run, I think I'll have more confidence to do it myself. But I still very much value the contributions of a partner by but I think I also would be just more choosy and more long term oriented when I think about the skills that we each bring to the table.",
      "start": 458150,
      "end": 487050
    },
    {
      "speaker": "D",
      "text": "Yeah, tell me more, a little bit more about what you'd be looking for in a partner.",
      "start": 487050,
      "end": 491170
    },
    {
      "speaker": "C",
      "text": "You just want somebody who matches your intensity and shares your vision and hopefully also has some skills that are not just pure overlap with yours. If you were to meet someone, a potential partner, and you have some alignment on vision, the next step would be, hey, Maybe we just see how we work together on some small projects, feel it out, and if it's right, then double down, double down, and pretty soon you, you will either see traction or need to formalize or both.",
      "start": 491250,
      "end": 515390
    },
    {
      "speaker": "D",
      "text": "Yeah, Finn versus Fin is not your only website. You built. You decided to build actually a portfolio of affiliate marketing websites. When did you decide to do that and what does that look like?",
      "start": 515390,
      "end": 525190
    },
    {
      "speaker": "C",
      "text": "So we have about six sites in the portfolio total, and they tend to focus on more niche or more narrow focus than just general health and wellness and all things telemedicine. The reason I did that is because you have economies of scale when it comes to your partnerships. If you have one partner, you can put them on five sites. That was the idea there. In terms of adding sites to the.",
      "start": 525190,
      "end": 545220
    },
    {
      "speaker": "D",
      "text": "Portfolio, affiliate marketing might be one of the most competitive side hustles you can start in terms of anyone can start it. How do you differentiate and how do you think about competition?",
      "start": 545220,
      "end": 553980
    },
    {
      "speaker": "C",
      "text": "The expectation that you're going to be able to stay atop of Google forever, I think is wildly not true. You're going to be competing with other people in your niche, other experts and authoritative websites, as well as big publishers that go after everything under the sun. So think of Forbes and in my space, Healthline. But you can always serve your partners with net new content. Even as your past moneymaker content starts to erode, as your rankings start to erode, stale content at the end of the day will, will not win on Google. So it needs to be fresh and it needs to be within your area of expertise that from Google's perspective, not going too far outside of your lane, topical authority or kind of niche.",
      "start": 553980,
      "end": 593920
    },
    {
      "speaker": "D",
      "text": "What I think is really cool about your business is that you're not just doing organic search. You actually have dabbled a bit in paid advertising. Can you tell me about that?",
      "start": 593920,
      "end": 601400
    },
    {
      "speaker": "C",
      "text": "Trying diversify the traffic is definitely something that every online entrepreneur should be thinking about realizing that you could go to your partners and say, hey, I know you want more growth. I have an idea for more growth. It's outside of the realm of what we normally do. And it will cost, you know, a test spend of a few, a few thousand dollars, something like that. And it very well may fail and fall on its face, but we will be stronger and we'll have learned something for it. And the upside is, is that if it works, it's extremely scalable. It's actually scalable to the moon. And you know, most brands would say it's kind of interesting. Yeah, maybe not this month, but next month. I've since Tested many different niches, different product categories with this strategy and it definitely does not always pan out, but when you find it, it's a gold mine and it's controllable in a way that SEO and other organic algorithms are not.",
      "start": 601400,
      "end": 647080
    },
    {
      "speaker": "D",
      "text": "Yeah, what I love about Finn versus Fin is that you did this all while you had a full time job. Can you give a little bit of advice for someone watching who might have a full time job, who wants to do something similar?",
      "start": 647160,
      "end": 657400
    },
    {
      "speaker": "C",
      "text": "I think being good at your job is maybe a prerequisite. So if it's your very first job and you're learning everything from scratch, you know, it might not be the right time to start a side hustle. But from those days, what I remember is feeling a sense of urgency around my side project and sometimes having to manufacture that for myself because it is a side project, meaning you don't have a boss and you don't have a deadline on it and the money isn't flowing in as a motivator or the traction isn't there necessarily to keep you motivated. So I do remember just feeling like, you know this, if I don't do this work today, my dream is being pushed out further because no one else is going to do that work.",
      "start": 657400,
      "end": 692840
    },
    {
      "speaker": "D",
      "text": "Running an affiliate business, what does the team look like and what were some like the first hires you made or some of the big hires you made for the business?",
      "start": 692840,
      "end": 699800
    },
    {
      "speaker": "C",
      "text": "The first thing that we outsourced was writing after that was hiring a virtual assistant to sort of take on a lot of the publishing tasks. From there, one of the biggest decisions was hiring an editor full time, taking the editing off my plate. And then additionally we've added a designer to the team and a web developer. That gives me enough space to just really focus on the partnerships, which is where I feel my interest is, as well as the ability to have the most leverage. From a revenue perspective, what does a.",
      "start": 699960,
      "end": 726220
    },
    {
      "speaker": "D",
      "text": "Typical day in the life look like for an affiliate marketer in 2024?",
      "start": 726220,
      "end": 729940
    },
    {
      "speaker": "C",
      "text": "So I really start my workday probably around 8:30 or 9 maybe. I might have a weekly meeting with some of my team members, sort of set the agenda for the week. I likely have a few meetings on my calendar with brands themselves to discuss how we're continuing to expand their partnership and the customers that we're driving to them. I likely stop for lunch and head out of my little dark office in my home, hop back on my computer to either review content, tweak some ad campaigns of some kind. We do have a paid media strategy. It's a big part of the business. I typically stop working around 4, which is when the help for my son leaves and I don't do a lot of work on the weekends anymore. But, but I do have a nice window after sort of evening family time after I put my son to sleep where I can have a few uninterrupted hours to respond to emails and make sure that folks on my team who are distributed across the world have their next steps for the next day.",
      "start": 729940,
      "end": 787600
    },
    {
      "speaker": "D",
      "text": "Essentially, yeah, you built this awesome business. What's next?",
      "start": 787600,
      "end": 790720
    },
    {
      "speaker": "C",
      "text": "I'm actually working on selling the business and finding it a new home. So I think it's important to understand your purpose for the business. Is it just about the lifestyle and you actually don't care about how much money you make? Is it something that I see myself working in or yourself working in for the remainder of your life, or is it something that you know has a short period of time that you want to be running it, but you ultimately want to have an exit? So thinking through those and then which corporate structure which functions you take on yourself and what you outsource, I think is, are key considerations. Yeah.",
      "start": 790880,
      "end": 822330
    },
    {
      "speaker": "D",
      "text": "If you could stand Alex's shoulder and give him some advice on some of those things, what would you say?",
      "start": 822330,
      "end": 826500
    },
    {
      "speaker": "C",
      "text": "One of the key things that I've learned in this process is you can try and engineer the outcome as much as possible from the get go, but the reality of the situation is that you can't see around very many corners and you're going to have to pivot a bunch. So my key piece of advice to anyone who wants to own a business one day and start it and be an entrepreneur is to just get started. Because where you start is not going to be where you end by any means. Just pick a broad based audience and start trying to figure out what their problems are and how you can help them. But it doesn't need to be more engineered than that. You don't need to be thinking about this being a business that's going to be multi generational or IPO or it doesn't even have to be a business necessarily that you're hoping to sell one day. It's important just to get started and figure out the pieces once you have a bit of momentum.",
      "start": 826810,
      "end": 870820
    },
    {
      "speaker": "D",
      "text": "Thank you, man.",
      "start": 872820,
      "end": 873620
    },
    {
      "speaker": "C",
      "text": "Yeah.",
      "start": 873860,
      "end": 874420
    },
    {
      "speaker": "D",
      "text": "Follow this advice and you will be a million dollar affiliate marketer.",
      "start": 874660,
      "end": 877950
    },
    {
      "speaker": "C",
      "text": "Peace.",
      "start": 878340,
      "end": 878660
    },
    {
      "speaker": "D",
      "text": "That was great.",
      "start": 881620,
      "end": 882340
    }
  ]
}