{
  "source": "/home/salouri/Projects/starter_story/transcripts/ZGwQoRw7mh8/ZGwQoRw7mh8_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "My name is Ben and I turned my side project into a full time job.",
      "start": 160,
      "end": 3280
    },
    {
      "speaker": "B",
      "text": "This is Ben, a regular dude in a regular 9 to 5 who always wanted to start his own business. He was always starting different side projects, but nothing really worked until one day he changed his entire approach.",
      "start": 3520,
      "end": 15680
    },
    {
      "speaker": "A",
      "text": "Don't go full time on your project until you do this.",
      "start": 16000,
      "end": 18480
    },
    {
      "speaker": "B",
      "text": "Once he made this change, he started a business that would eventually hit 15,000 mrr and allow him to work full time on his own stuff.",
      "start": 18800,
      "end": 26480
    },
    {
      "speaker": "A",
      "text": "The idea finally started to get traction.",
      "start": 26770,
      "end": 28890
    },
    {
      "speaker": "B",
      "text": "When I brought Ben onto the channel to share everything, including what he learned from all his failed side project ideas, why this idea was different, and how with the right approach, anybody can build a side project that makes money. All right, let's get into it. I'm Pat Walls and this is Starter Story. All right, welcome Ben, to Starter Story. Tell me about who you are, what you built, and what's your story.",
      "start": 28890,
      "end": 56210
    },
    {
      "speaker": "A",
      "text": "My name is Ben Bozet and I'm a software developer who created Tech Lockdown. Tech Lockdown is a platform that helps adults block websites and apps and just be more intentional with their Internet use. It started out as a side project, but I was actually laid off in 2023 and I had to make the decision to either go full time on my side project or accept a job offer and go back into working full time.",
      "start": 56590,
      "end": 79630
    },
    {
      "speaker": "B",
      "text": "All right, well, let's go a little bit deeper into how Tech Lockdown works. What does this app do and how does it work?",
      "start": 79710,
      "end": 84990
    },
    {
      "speaker": "A",
      "text": "The core part of the platform is the content policy, which lets you schedule when websites and apps are blocked. And you can use categories or keywords to instantly block millions of websites and apps. But then once you set that up, you connect your devices using a VPN connection. You know, your smartphone or your computer is now using like a filtered Internet connection.",
      "start": 85270,
      "end": 104390
    },
    {
      "speaker": "B",
      "text": "Cool. What type of people use Tech Lockdown? What's like your typical user?",
      "start": 104710,
      "end": 109510
    },
    {
      "speaker": "A",
      "text": "So my typical user as an adult, they're just trying to be more careful with how they use the Internet and they might have developed unwanted habits or compulsive behaviors. The business model is typical SaaS subscription. I have a 14 day free trial which allows people to try things out, set things up, and decide if it's a good fit. And then from there, they either pay $15 month to month, or they pay basically $10 a month if they pay for an annual plan. Ultimately, I want people to buy an annual plan, but a lot of people give up after like a month, so I provide that option.",
      "start": 109750,
      "end": 139650
    },
    {
      "speaker": "B",
      "text": "All right, well, one of the things that I really think is cool about your story. You had a full time job and this was a side project. Have you always been building side projects?",
      "start": 139730,
      "end": 147090
    },
    {
      "speaker": "A",
      "text": "Y so ever since, you know, in college, I was doing side projects, messing around with stuff even when I had a full time job. And I just could never shut that side of my brain off. So the first failed side project was I made a lead generation platform for freelance developers to help them find clients. And I just got way too obsessive over like the colors on the website and the logo and the name of it. And I just didn't think about the business model enough or how I would get customers. So it just didn't go anywhere. The next thing I worked on was a landing page builder. This time I wasn't obsessed, but I didn't really think about how I'd launch it. And I burnt myself out before launching it. I overcomplicated it and it didn't go anywhere. And then I ended up co founding a web agency with a designer and another developer. Did that for about two and a half years. But it was just really difficult, a hard business to run. Ultimately, I was glad when we ended that business.",
      "start": 147090,
      "end": 196970
    },
    {
      "speaker": "B",
      "text": "Okay, so you had a few kind of failed side projects that didn't work out. How did you come up with the idea for Tech Lockdown?",
      "start": 197290,
      "end": 203690
    },
    {
      "speaker": "A",
      "text": "Well, it ultimately started back in 2020 when work from home became normalized and everyone was just getting way too much Internet time, so decided to set up guardrails around my own Internet use. I found out that it's just really hard to do that. So I spent a ton of time researching and kind of putting together my own system that would work well for me. And then from that I just distilled that into a YouTube video and a Reddit post. And I was shocked by how many people were messaging me and emailing me and asking me to consult and all these things. But at that point, I actually didn't start monetizing it at all. Kept creating free content and building my audience. About a year later is when I actually monetized it.",
      "start": 203770,
      "end": 242260
    },
    {
      "speaker": "B",
      "text": "All right, so you had built this side project. It's doing well, it has paying customers. And then something crazy happens. What happened?",
      "start": 242330,
      "end": 249290
    },
    {
      "speaker": "A",
      "text": "Well, I got laid off and I kind of already planned to leave in September of that year, but I had to figure out all these things like, how do you pay for health insurance? How expensive is that? The income from Tech lockdown was like $3,000 at that point, which would not have covered my expenses. My natural instinct was to, to go back to this, like safety net. Which is a W2 income. But I figured I'm only going to get this opportunity probably once. Let me give it a good at least I know that if I go back and I do an interview somewhere, I bet I could get another job. I ended up doubling down on Tech Lockdown and I'm glad I did that because it's grown by 5x since I was laid off.",
      "start": 249530,
      "end": 285590
    },
    {
      "speaker": "B",
      "text": "What do you think was different about Tech Lockdown as a side project compared to your previously failed side projects?",
      "start": 285830,
      "end": 292070
    },
    {
      "speaker": "A",
      "text": "Well, I think the first thing is I didn't start off trying to make a side project. It was genuinely something that I was passionate about and I was trying to solve a problem. I also didn't overcomplicate the logo and the marketing and all that. I actually didn't have a logo until I had a few hundred customers. So I was just laser focused on if I have any free time, it's got to go towards the most meaningful stuff. It was actually really helpful to have an audience who was really focused on that topic too. So that when I actually worked on something I felt like I wasn't just like throwing something out there into the ether. I knew that someone would use it eventually. So it was really motivating compared to what I was doing before.",
      "start": 292150,
      "end": 328680
    },
    {
      "speaker": "B",
      "text": "I know a lot of people watching this right now might have a full time job. They're figuring out how do I find the time to build, what should I work on, what hours of the day should I work? Can you break down a little bit more tactically about how you built this business with limited time and energy?",
      "start": 328970,
      "end": 343050
    },
    {
      "speaker": "A",
      "text": "I've formed a habit of waking up really early in the morning prioritizing like development tasks and stuff that just required more focus and attention in the morning. So I would do that between like 5:30 and 8:00'. Clock. 8:30 and then if I worked on anything in the evening it might be more like marketing related because I could do those kinds of tasks without having to be hyper focused and alert. And I also stayed really focused on a specific marketing strategy. If you're juggling a full time job and you're also trying to do customer acquisition through marketing, you should pick a channel that is energizing to you and that you can do reliably and that you don't dread doing. So for me that was content marketing, but for other people it literally might be knocking on doors, talking to customers face to face. It just depends on your personality.",
      "start": 343370,
      "end": 387110
    },
    {
      "speaker": "B",
      "text": "That's awesome. Thanks for sharing all that. For anyone watching this right now who has a side or they're thinking about starting a side project and they have a full time job, what would be your advice to them?",
      "start": 387270,
      "end": 396690
    },
    {
      "speaker": "A",
      "text": "I'd say make sure that you have a way to get customers. I think the customer acquisition problem is the thing you have to solve before you leave your job and you have to have a plan that you can kind of throw gasoline on, right? If I have 40 hours a week to throw at this, I know that there's going to be an extra output. I wouldn't start a side project just because you hate your job and you just want to work for yourself. It's really not that glamorous being your own boss. If you have a problem with your job, maybe just make your full time job getting the better one. Start a side project when it's something you're genuinely passionate about that you would almost work on for free if you couldn't make money with it.",
      "start": 396850,
      "end": 431310
    },
    {
      "speaker": "B",
      "text": "All right, before we finish Ben's story, I want to speak directly to anyone watching this who's stuck in a 9 to 5 and thinking I want to build something too. I just don't know where to start. The truth is, there's never been a better time to start a side project and thanks to AI, you don't need to spend months learning how to code. This is why we created Starter Story Build. It's our accelerator that helps you go from idea to working product. In just a couple weeks. We'll show you how to guide AI to build the app for you. Skip the tutorials and actually launch something real and stay focused and accountable inside a cohort of other builders. Ben's story is proof side projects can change your life, but you have to start and Starter Story Build is the best place to do that. If you're interested, just click the first link in the description to join. I hope to see you in there. Now let's get back to Ben's story. All right, well, let's take a dive into ideas. You started a bunch of side project ideas. A lot of them failed and one was really successful. What would be your playbook or strategy for finding a good side project idea?",
      "start": 431550,
      "end": 496400
    },
    {
      "speaker": "A",
      "text": "For one thing, I would pick an idea that you can make a very simple version of that's still complete that you can use to validate and bring to market quickly. If the idea that you're picking is going to take you two years to build, there's no simplified version that you can release. I'm not sure that I would do it. Another thing I would do is start off by building an audience. Don't wait to have the product before you build the audience. And it needs to be an audience that's interested in that topic, not just like your general social media following. You need to have like a pretty good customer list of pre qualified people that would use it. Then you'll have something an audience to launch to once you're ready with a simplified version of your product. If you have limited free time and energy, you need to not dread waking up early in the morning morning to work on your side project. It needs to be something you're genuinely passionate and excited about so that at the end of a long workday, you're not like resentful of this thing that you're working on. You're excited and ready to go and maybe you're even thinking about it during the workday because it's just something you're genuinely into.",
      "start": 496480,
      "end": 554559
    },
    {
      "speaker": "B",
      "text": "Okay, great. Can you break down some of the numbers behind this business? How big is it? How much money is it making?",
      "start": 554880,
      "end": 560320
    },
    {
      "speaker": "A",
      "text": "In the last two years, there've been over 2 million people that have found the site organically, either through Google search or referrals or social channels. I have 1,300 customers that generate over 15,000 in monthly recurring revenue. And then I have a mailing list with around 20,000 contacts.",
      "start": 560560,
      "end": 577920
    },
    {
      "speaker": "B",
      "text": "All right, cool. So I mean, that's an amazing business that you built. Let's talk about actually how you grew that business. What was the growth and marketing strategy to go from 0 to 15k? Mrr.",
      "start": 578080,
      "end": 588240
    },
    {
      "speaker": "A",
      "text": "So my core strategy was just to write really well researched and helpful content. I'm going to give it away for free. And it made it really easy for people to just share the stuff that I was writing. I made a guide on how you can convert an iPhone into a dumb phone. Because I know there's this audience of people that are just kind of fed up with their smartphone and they're tired of being addicted to it. So I basically showed with a really detailed step by step guide how you can make it so that you can only access like a few key apps on your iPhone and like you can't even use Safari or anything like that. That article alone, it's one of the top performing guides that I've ever published and it's been read hundreds of thousands of times. I also developed this kind of a system or an approach at least that I could use when promoting content or videos on Reddit. And the thing with Reddit is you can't be overly promotional, so you have to be a little bit more subtle. So if I made like a YouTube video or I made a guide. I would put like all of the good stuff in that Reddit post. I would kind of just tack on a reference to like the YouTube video or the guide. But what I found was more people engaged with it, so it was more likely to go to the front page. And then at the same time, there's a lot of people that want to explore the topic further, and they figure if you've got some other resource, you probably are talking about other things. So I think that's why that that ends up working.",
      "start": 588320,
      "end": 661360
    },
    {
      "speaker": "B",
      "text": "Okay, well, thank you for sharing those. Is there a specific strategy or framework that you have when with creating content and what creates successful content?",
      "start": 661600,
      "end": 671040
    },
    {
      "speaker": "A",
      "text": "I think a big part of it is authenticity. A lot of my competitors are kind of these faceless apps or companies. They look really corporate, but maybe don't look so trustworthy. And especially if you're doing a side project, people don't know who you are. You're not a big company, and it helps to just put your face on it and own what you're building. And then when I write about content, I'm not saying we, I'm saying I. I'm not pretending to be a big company when it's just me working on the project.",
      "start": 671360,
      "end": 695720
    },
    {
      "speaker": "B",
      "text": "All right, well, let's get into the fun stuff. Tech Stack what are the tools, languages, frameworks, and apps that you use to run this business?",
      "start": 695960,
      "end": 703160
    },
    {
      "speaker": "A",
      "text": "So a lot of my tech stack decisions were based on time constraints. So a lot of my early decisions were things like Supabase for the database and authentication. And then I would use simpler web application frameworks like Sveltekit, which is a little more accessible if you're just a JavaScript developer and you don't go too far into React land. I was using Vercel for hosting. Even though you could do it cheaper yourself, $20 a month is well worth it to have the peace of mind and continuous deployment system. I think the most important part of my stack was actually the email provider. I use Mailgun and Elastic Email. I think I ended up paying about $150 a month. But I email a lot of people. I pay for Google Gemini. I pay for like the Light Plan for Ahrefs. I use Plausible Analytics. Plausible is just an amazing analytics tool that I check daily. It's probably one of the more important optional things that I pay for. And a lot of the costs are just on the tech stack side of things. Infrastructure tends to be really cheap. But all in all, like, you should be able to hit a 70% profit margin easily with all the optional stuff added in.",
      "start": 703480,
      "end": 766520
    },
    {
      "speaker": "B",
      "text": "All right, so one of the last questions I want to ask you is, you know, you built a bunch of side projects. What have you learned through building these that surprised you?",
      "start": 766860,
      "end": 774380
    },
    {
      "speaker": "A",
      "text": "It's actually not that hard to make money with a side project. The hard part is making it into a viable business. There's a lot of side projects that are basically just selling a dollar for 90 cents and when they actually go to scale, it doesn't work out and they can't take it to be a full time job. It's less about being really innovative or inventive. It's just coming up with a smart strategy where your customer acquisition cost is low enough that you can build it into a sustainable and grow it outside of just yourself.",
      "start": 774540,
      "end": 800120
    },
    {
      "speaker": "B",
      "text": "The last question I want to ask you is if you could stand on Ben's shoulder when you were starting all those side projects, when you finally started that successful one, what advice would you.",
      "start": 800200,
      "end": 809600
    },
    {
      "speaker": "A",
      "text": "Give to young Ben to not overcomplicate things and find the simplest version of the product to prove the concept first. Getting bogged down in the details leads to burnout and not actually shipping the product. What you'll find with a lot of side projects is no one ever actually sees it because it never gets shipped. So distill it down to the core feature set, test it, build an audience, but don't overcomplicate it.",
      "start": 809600,
      "end": 831910
    },
    {
      "speaker": "B",
      "text": "Well, that's great advice. Thank you Ben for coming on the channel. I love the business you built. Solopreneur building all yourself. It's amazing. Congrats and hope to see you on the channel again.",
      "start": 831910,
      "end": 840070
    },
    {
      "speaker": "A",
      "text": "Thanks for having me Pat.",
      "start": 840150,
      "end": 841270
    },
    {
      "speaker": "B",
      "text": "I love Ben's story because it's something that anybody watching this video can do too. He was just a regular guy with an idea, but the difference was he decided to actually go and build it. He started it on the side, grew it slowly and eventually went all in. That goes to show you that sometimes all you need is the willingness to just put in the work. So I want to challenge you. It's time to start building your side project and the perfect place to start doing that is inside. Starter Story Build. We'll show you how to go from a simple idea to a real working app. In just a couple weeks, hundreds of people have joined and started launching their first apps. Is really cool to see. So if you're interested in taking on that challenge, head to the link in the description and check out Starter Story Built. Alright, thank you guys for watching. I'll see you in the next one. Peace.",
      "start": 841670,
      "end": 888720
    }
  ]
}