{
  "source": "/home/salouri/Projects/starter_story/transcripts/dXKzST0FE-A/dXKzST0FE-A_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "This guy makes $1.3 million a year with a business model that's going to change the world. The productized service. He invited us into his house to show us exactly how it works, how he runs it with zero employees, and how he does it all from the comfort of his own home. Brad started building this idea while he was working a 9 to 5. And the crazy part is he didn't quit his job until he was making $80,000 a month.",
      "start": 240,
      "end": 22560
    },
    {
      "speaker": "B",
      "text": "I did all of my work during my Zoom calls that I had with my team.",
      "start": 22640,
      "end": 26400
    },
    {
      "speaker": "A",
      "text": "So the secret behind his business is a pricing strategy that nobody is using. And, and we're gonna break down why this is making him one of the highest paid solopreneurs in the world.",
      "start": 26480,
      "end": 35930
    },
    {
      "speaker": "B",
      "text": "A lot of people say it's like the Netflix of design.",
      "start": 36010,
      "end": 38490
    },
    {
      "speaker": "A",
      "text": "In this video, he shares everything. How he launched in 24 hours, how he got his first client, and how anyone can build a life changing business while still working your day job. I'm Pat Walls and this is Starter Story. All right, Brett, it's absolutely amazing what you've built. Can you tell me exactly what you do and how you make money?",
      "start": 38730,
      "end": 58650
    },
    {
      "speaker": "B",
      "text": "So, yeah, so I sell basically design as a subscription. It's kind of called a productized service, which basically means that I sell packages for clients to, you know, pick and subscribe to. It's about $5,000 a month. They get, you know, certain number of things. And I don't have any contractors, no employees, never have had any sort of help whatsoever.",
      "start": 58680,
      "end": 79030
    },
    {
      "speaker": "A",
      "text": "So you're telling me you run a $1.3 million a year design agency all by yourself. How exactly do you set that up?",
      "start": 79030,
      "end": 86030
    },
    {
      "speaker": "B",
      "text": "It's really pretty bare bones. So what I do is users subscribe to my service. Bas client gets a trello board, they get immediate access to it, which is a big selling point of a product service, and they can begin inputting design requests into the queue, and they're basically worked on one by one. I work on a request for a client every couple days, may take 30 minutes to an hour to complete, send it to them, go through the feedback stages, and then rinse and repeat, essentially. So I do that for all 20 clients. I also don't have any meetings with clients. So once you're onboarded, you know, there's no Zoom calls, there's no even really any slack communication. Everything happens Async, which allows me to basically, basically dedicate my entire day to just design work. And that's it.",
      "start": 86030,
      "end": 126910
    },
    {
      "speaker": "A",
      "text": "Take me through the process of when you came up with the idea and Then getting started with it.",
      "start": 126910,
      "end": 131790
    },
    {
      "speaker": "B",
      "text": "You know, I always kind of wanted to go into freelancing. When I started agency, I knew I didn't want to work for someone else. I had done that my whole life. Wasn't. That just wasn't for me. And I happened to come across another agency doing something similar to what I'm doing today. They were doing it for graphic design, but I was a web designer. I did landing pages and product design. I thought I could take what they do, apply it to what I'm good at, and just make it the highest quality option out there. So it was basically just taking an idea that already existed and making it better. And I built it in a day, built it on a Saturday. It was essentially just a webflow one page site that I stood up and set up a trello board kind of structure. I launched it on product, which is, you know, a pretty cliche way of launching a product. But yeah, it was. It was a pretty simple. Probably took me six, seven hours to build, and that was it.",
      "start": 131790,
      "end": 177730
    },
    {
      "speaker": "A",
      "text": "And did you have a full time job at that time?",
      "start": 177730,
      "end": 179370
    },
    {
      "speaker": "B",
      "text": "I had a full time job for three, three and a half years running Design Joy. I quit when I was making 80,000amonth. And I joke because I did all of my work during my zoom calls that I had with my team, so. But I did get all my work done. I just, you know, I was more focused on Design Joy. And it got to the point where I looked back, you know, three and a half years later, okay, maybe this actually is something that I can sustain. So I finally made the leap. Yeah.",
      "start": 179370,
      "end": 203670
    },
    {
      "speaker": "A",
      "text": "All right, Brett, so most agencies charge by the hour, but you're doing something totally different. A productized service. Can you tell me more about that?",
      "start": 203670,
      "end": 209630
    },
    {
      "speaker": "B",
      "text": "Yeah, I mean, it's. It's basically like instead of charging hourly or having like, quote individual projects and write up proposals for clients, I have off the shelf packages that people can choose from. And all of them, you know, include unlimited requests, which means, you know, you're not charged per hour, and you pick a plan, and no matter how much or how little you use it, you end up paying the same price. A lot of people say it's basically a retainer. Well, not really. Retainer could be anything. And you're still tracking time, and you're technically paying by hour, even though it's packaged up to a fixed price. But the way that I work is, you know, I have some clients that end up paying $5,000 an hour if they have one request or 300 if they have several. So just the hourly rate depends on, you know, how many requests clients have.",
      "start": 209630,
      "end": 249430
    },
    {
      "speaker": "A",
      "text": "How can people like you were before in your 9 to 5 job take their work and productize it and build.",
      "start": 249430,
      "end": 255710
    },
    {
      "speaker": "B",
      "text": "A business like this? I would say, like, my advice to someone actually wanting to do what I've done is no matter what industry you're in, so if you're in content writing, if you're in video production, or maybe you just create YouTube thumbnails, or if you're in design, find the things that you're good at and niche down. Like, for me, I'm a designer, which means I could technically do a lot of things, but there's certain things that I'm good at, and that's like, you know, branding, product design, landing page design, design. I don't really worry about the other stuff because I'm not fast at it. So, like, find the things that you're fast at, build a package around it, like, bundle it up, come up with pricing. That that makes it attractive, but also makes it worth your time, and then just stand up a website. As simple as that. Yeah. Awesome.",
      "start": 255710,
      "end": 291770
    },
    {
      "speaker": "A",
      "text": "Let's talk about cost to run a productized service. What kind of tools do you use, what do you pay for, and how much does it cost to run this business?",
      "start": 291770,
      "end": 297890
    },
    {
      "speaker": "B",
      "text": "Yeah, so it cost me precisely $176 a month to run Design Joy. So I use Figma for design Webflow, you know, hosting Adobe and Shutterstock. 100 bucks a month. By far my most expensive tool that I use. So everything else that I use, which is a number of tools, including Trello and Airtable, I use, it's basically the free versions of it.",
      "start": 298130,
      "end": 318910
    },
    {
      "speaker": "A",
      "text": "You haven't spent a penny on marketing. How did you get clients when you first started and how do you get clients now?",
      "start": 318990,
      "end": 323950
    },
    {
      "speaker": "B",
      "text": "Yeah, so I took the route of, you know, for those unfamiliar with it, it's called Product Hunt. If you come up a new product, you can post it on there. It has an upvoting system, tons of hits per day. So if you're, if you're mildly successful, you'll get some interest in some clients right away. So I took that route. Then I event and started like building in public, joining a bunch of communities. Today, my primary means of getting leads is like basically anytime I tweet. So Twitter came on board for me about a year ago. I was very late to the scene and I built a mild following on the platform, and that's basically where most of my leads are generated today.",
      "start": 324270,
      "end": 358090
    },
    {
      "speaker": "A",
      "text": "You're a creative guy. You have lots of little side projects and you do more Than just design joy. How do you come up with new ideas and test them quickly?",
      "start": 358090,
      "end": 365610
    },
    {
      "speaker": "B",
      "text": "I basically do the bare minimum possible, so I know myself quite well with design joy. Like I said, it was a day. Just launched a website, a one page site with scribbles. It was like a six hour project, right. With my course, I just like went in my car, recorded some audio files and uploaded them and that was it. So I'd rather do that than spend weeks, months building something that may ultimately fail and waste a bunch of time. I'd rather just release something minimally viable out there and see if it bites. And if it does, then I can figure things out from there.",
      "start": 365770,
      "end": 395990
    },
    {
      "speaker": "A",
      "text": "All right, real quick. On the topic of winning ideas, I have to tell you about the business that I built. It's called starter story and it's literally 4,000 ideas, case studies and courses about how regular people built online businesses to millions in revenue. You can get a ton of inspiration from these. But we also show you how much money they're making, how they came up with their idea, and how they grew their businesses to millions. It's only $1 to try it out for seven days. And yes, you can cancel it, but if you're serious about surrounding yourself with successful founders who have been there before, then definitely check it out@starterstory.com I put the link right below in the bio if you want to try it out. Back to the video with Brett. I hope you enjoy it. See ya. How can other or people that want to get into design get good like you?",
      "start": 395990,
      "end": 438790
    },
    {
      "speaker": "B",
      "text": "Yeah, I think the big thing, it's not fun to hear, but the big thing is just doing it. You know, I did not go to school for design. I basically taught myself how to do it. And I was, you know, in design programs all day long, basically mimicking good design that was already out there. So I got to understand the tool very well. I got to understand how to get get to that end result. I surround myself with good design. I'm constantly seeking it out, constantly on like dribbble and all these landing page inspo sites and following good designers to kind of stay on top of what's in. I did fake projects. Like I would find a project and like rebrand it or redesign it. As long as you're doing it, as long as you're in figma, like pushing pixels every day, you'll eventually get there.",
      "start": 439110,
      "end": 476520
    },
    {
      "speaker": "A",
      "text": "What's a typical day in the life for a solopreneur?",
      "start": 483160,
      "end": 485960
    },
    {
      "speaker": "B",
      "text": "So for me it's. It looks like this. I mean, I wake up about 7:30 in the morning, my wife goes to the gym. I usually watch the kids till about 10:30, which you could look at it as like, as a curse, but like I look at as blessing because that's the time I get to really like dedicate my time and spending with them. So I, I don't start work until about 11:30 to 12 and then I work till about 4 to 5 o' clock in the afternoon and then spend time with the family and changing diapers and doing, you know, that sort of thing, watching tv, just pretty boring stuff. We don't really go out and do much. You know, it's hard to with a baby and little kids, so we pretty much stay inside. But yeah, that's about it.",
      "start": 486360,
      "end": 525630
    },
    {
      "speaker": "A",
      "text": "Do you have any sort of routines or anything like that that you like to do?",
      "start": 525860,
      "end": 529300
    },
    {
      "speaker": "B",
      "text": "Routines? No, like, I'm not a good time manager. Like surprisingly, like you would think that I would be doing this, but my escape. So like one thing I like to do is every Friday night, like I play video games with my friends back home, like family, like my uncle, brother. Like a bunch of us get play video games. But that's basically the only routine that I have other than watching the kids in the morning and working from that time period. And that's, that's pretty much it, man.",
      "start": 529300,
      "end": 550580
    },
    {
      "speaker": "A",
      "text": "All right, our final question that we asked to all of the people that we talked to, if you could go back, sit on Brett's shoulder when you getting started, what's the one piece of advice that you would give to him?",
      "start": 550580,
      "end": 560800
    },
    {
      "speaker": "B",
      "text": "Yeah, I think for me, I say this a lot. I mean, I'm a pretty insecure entrepreneur. I don't think I'm alone in that I may come across as a confident person, but I'm really not. Like, I see myself below a lot of people. So when I, when I, when I created Design Joy, I mean, there was a reason why I kept a full time job until I was making 80k a year. Like that's how insecure I was at actually making this work. And so that brought on a lot of stress. Like, what if this doesn't last? Like, what am I going to do? What's my backup plan? So it held me, it held me back for a long time and put a lot of like strain on my back. So I would probably tell them, like, to believe in yourself and like, you're capable of doing this, doing it and believing that you can, as corny as that sounds, is what I needed all along because I was like, I almost pictured Design Joy as like, I. Equate it to, like, a shooting star. Like, it happened so quick, and I felt like it could dissipate so quickly, too. So they prevented me from making that leap. And, like, and when you. When I made that leap, my revenue doubled the next month. Like, when I left my job to take on Design Joy full time, it doubled next month. Like, I wasted so much time, like, double efforts, like, keeping my main job and keeping that job that, like, if I just had confidence in myself, I could have, like, been where I was today, like, two years later or two years ago. So, as cliche as it sounds, it's what worked for me.",
      "start": 562000,
      "end": 642910
    },
    {
      "speaker": "A",
      "text": "Cool. Well, thank you, Brett. Do design work.",
      "start": 644260,
      "end": 648820
    },
    {
      "speaker": "B",
      "text": "You'll have a Porsche.",
      "start": 648980,
      "end": 656880
    }
  ]
}