{
  "source": "/home/salouri/Projects/starter_story/transcripts/5u9u8yzPEpA/5u9u8yzPEpA_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "I taught myself to code with ChatGPT and my apps have made over $10 million to date.",
      "start": 160,
      "end": 5440
    },
    {
      "speaker": "B",
      "text": "How did this guy make over $10 million with three iPhone apps after learning how to code less than two years ago? Well, two letters, AI.",
      "start": 5440,
      "end": 15200
    },
    {
      "speaker": "A",
      "text": "Now, with the advent of ChatGPT and the popularization of AI, there's so many different problems that you can solve, either in different ways or at a decreased cost in order to solve it.",
      "start": 16000,
      "end": 27800
    },
    {
      "speaker": "B",
      "text": "I spent over an hour talking to Blake to figure out the truth behind actually built these million dollar AI apps and how other builders can take advantage of the same opportunity. And he shares it all, including his process for finding million dollar AI ideas and validating them, his blueprint for building an app from scratch as a complete beginner, and the marketing strategy that is making him millions.",
      "start": 27800,
      "end": 50700
    },
    {
      "speaker": "A",
      "text": "TikTok and Instagram are very solvable right now. You can figure out the various influencer strategies to funnel millions of people to your products.",
      "start": 51100,
      "end": 59900
    },
    {
      "speaker": "B",
      "text": "Now let's get into the details. I'm Pat Wal. This is Starter Story. Welcome man. It's nice to have you. Tell us about who you are and what you built.",
      "start": 60380,
      "end": 71720
    },
    {
      "speaker": "A",
      "text": "Yeah, absolutely. My name is Blake Anderson. In one year I taught myself how to code with AI. The first app that I built was called Riz GPT. It's at $2.5 million in annual revenue. The second app that I built was called Umax. Once again came up with the idea, designed and built the application and led the majority of the marketing. In the past year, we've done almost $5 million in revenue. Then the third app that I co founded was called Calai. This one I also came up with the idea for. Though I did not build the actual application, I helped with the designs. But I have two amazing co founders that lead operations on that. Kali was launched about six months ago and is now doing over a million dollars in revenue per month.",
      "start": 72360,
      "end": 119390
    },
    {
      "speaker": "B",
      "text": "Okay, so you built not one, but three successful AI apps that are doing almost $20 million per year. Tell me about this opportunity in apps right now.",
      "start": 119810,
      "end": 129730
    },
    {
      "speaker": "A",
      "text": "Okay, this is a great question. There are two primary reasons that apps are so lucrative right now. The first is the advent of ChatGPT and the popularization of AI. There are so many different problems that you can solve either in different ways or at a decreased cost in order to solve it. With Rizz GPT, it would have been virtually impossible to build a AI dating assistant without the use of LLMs. And number two is novel distribution techniques. TikTok and Instagram are very solvable right now. You can figure out the various influencer strategies, the user generated content strategies, organic account growth strategies to funnel millions of people to your products. And I don't think that the algorithms were as optimized for new accounts to be able to generate millions of views a few years ago. But now that they're all in bloodbath competition with one another, they have to incentivize new creators, and so they'll push more views to new accounts than they did previously.",
      "start": 129970,
      "end": 192170
    },
    {
      "speaker": "B",
      "text": "All right, so essentially, apps have become way easier to build and market recently, which is why they're a great business to start for anyone that's watching this right now. But let's go back. I want you to actually share the story of how you got started with this whole thing.",
      "start": 192330,
      "end": 205210
    },
    {
      "speaker": "A",
      "text": "I've always been fascinated by entrepreneurship. Always hustling throughout childhood, figuring out new ways to make money. Mowing lawns, raking leaves, shoveling driveways. Then in high school, I was still hustling like I built an Ethereum mining machine back in 2016 or 2017. Scaled Instagram meme pages. But to be honest, I drank way too much alcohol, did too many drugs. Really just prioritize, like partying and living a relatively degenerate lifestyle after college. So senior year, I'm graduating. All of my friends have great jobs in New York City making six figures, and I had nothing. You know, I had moved back home. Family isn't doing well financially. House is going up on the market. My older brother's giving me loans for groceries. I was like, okay, I gotta figure something out. I do not want to get a full time job. And I set a goal for myself right as I graduated college, I was like, over the course of the next 12 months, I will figure out a way to make $50,000 on my own.",
      "start": 205680,
      "end": 266510
    },
    {
      "speaker": "B",
      "text": "All right, so you're back at your parents house, borrowing money from your brother to buy groceries, but you set this crazy goal for yourself to make $50,000 over the next year. I suppose this is where your first app, Riz GPT, comes into play, right? How do you get started with it?",
      "start": 266830,
      "end": 282430
    },
    {
      "speaker": "A",
      "text": "Yeah, we had friends that would send in fraternity group chats or whatever. Group chats with guys seeing, like, what say to this girl. And we figured that we could build an app to help people respond to girls. I taught myself to code with ChatGPT in the month of May, June 2023. And then we launched in July of 2023. The first version of the app was so bad, I built this myself. We didn't have notifications, we didn't have reviews. The design was a mess. The paywall was terrible and the first few promos go out and it doesn't really do anything. Few hundred downloads, we're making a few bucks and then I find these two underground kind of undiscovered creators. I pay them each $50 for a promo. So $100 total and overnight, 5, 10 million views total 45,000 downloads in that first big day. 200,000 downloads on that week, 500,000 downloads on the month. We're at 80K mrr from the jump. That's pretty much all profit. We ended up scaling it to a little bit over 250k mrr and then it kind of dropped down and plateaued to like 150 to 200k mrr consistently. And that's where it's at. Now.",
      "start": 282750,
      "end": 352800
    },
    {
      "speaker": "B",
      "text": "Blake is proof that you don't need the perfect app or website to start making thousands of dollars off an idea. All you need is an MVP and a smart marketing strategy. But you also need to make sure that you're working on a solid idea. That's why I created the Starter Story Academy. A place that helps you find an idea, validate the idea with real feedback, and shows you how to execute on that idea so you can get those first users. So if you're curious about building a software product like Blake and hundreds of other founders just like him, head to the first link in the description to check out the academy. Now back to the video. All right, Blake, your story is insane. Mobile apps totally changed your life. Now let's talk about how our viewers could do something similar. Everything starts with an idea, right? What do you think are some of the mobile app ideas that could be turned into millions of dollars right now?",
      "start": 353040,
      "end": 403290
    },
    {
      "speaker": "A",
      "text": "Yeah, number one, I think that there are a lot of fragmented tools. It's like AI LinkedIn image generator or like AI resume analysis. But I think that there's massive opportunity to build a career AI style platform where you roll up all these tools into one platform and brand it as like if you're a student and you want to get a job, this is the platform to help you do so. And you can build that in a mobile app as well as a web app. Next up, language learning, the ChatGPT advanced voice mode. It's pretty incredible. It's like actually a personal tutor. Duolingo is making 33 million dollars a month. Multiply that by 12 and we get like 400 million dollars per year. Capture 1% of that market and you have a 4 million dollar annual application on your hands.",
      "start": 403610,
      "end": 450210
    },
    {
      "speaker": "B",
      "text": "That's crazy. Honestly, to me it Seems like you're the type of person that never runs out of ideas, no matter how many things you build. So let's talk about that. What are your methods for finding winning ideas?",
      "start": 450730,
      "end": 462650
    },
    {
      "speaker": "A",
      "text": "I've used honestly different methods of finding the idea for each app that I've worked on. With rizzgpt, it was very clear problem that I had observed with people that I know. People don't know what to say on dating apps and you build an app to solve it. Umax, on the other hand, was identified a little bit more opportunistically. When people want to become more attractive, they're willing to spend money on it. They were spending money on skincare, hair care, gua sha, the whole nine yards. But there didn't exist any software to solve the problem that people were having. When you find a niche that's heavily monetized with physical products, that's a good indicator that the niche converts. It's also a good indicator that you can probably build a software or application to solve a problem within it. I think that there's still a lot of room for like an all in one AI glow up application. Umax was kind of like the first iteration, but if someone were to put real time investment into building a super valuable application here that really helps people improve, I think that there's still millions and millions on the table there.",
      "start": 462970,
      "end": 523700
    },
    {
      "speaker": "B",
      "text": "All right, man, thank you for sharing that. Now that we have not only the exact ideas that could be built right now, but also your methods for coming up with more winning ideas, do you have a specific process for validating these ideas?",
      "start": 524180,
      "end": 536900
    },
    {
      "speaker": "A",
      "text": "My validation process primarily looks like a deep dive into the niche on social media. So what I'll do is I'll create an account, say Calai, and then purely consume nutrition and dieting and calorie counting, weightlifting content, essentially becoming the target market or target demographic, and then thinking about what it is that I want and then just build that.",
      "start": 537390,
      "end": 562590
    },
    {
      "speaker": "B",
      "text": "Okay, gotcha. Putting yourself in your customer's shoes is how you know they'll buy. Now let's talk about actually building the app. What's amazing to me is how you're able to learn design, coding and distribution in such a short amount of time and make millions with those skills. If you were to restart from scratch today, having nothing but the idea in mind, how would you build it?",
      "start": 563410,
      "end": 583010
    },
    {
      "speaker": "A",
      "text": "If I were to restart and build apps today, here are the tools that I would use. Number one for design, figma. Learning how to use figma will be one of the greatest unlocks in ensuring that the application that you put into the market is actually usable. Now, what I would recommend for anybody designing to do is to use references. I'm grabbing different apps that have similar functionality and design to what I'm looking to build and then using that to inform kind of my design process. Right. Even if you yourself don't intend to be a designer, you need to be able to work in Figma to work with designers, whether you hire them off upwork or work with someone internally. Number two, when it comes to building, what I would recommend is that you build in React native with the Expo framework using Cursor as your ide. Then finally, when it comes to marketing, the two primary methods that I would recommend are influencer marketing and doing internal ugc. So influencer marketing is when you find somebody that already has a platform or an audience and you pay them to promote your product. Internal UGC is where you or someone that you hire creates content based around your application and then posts that to accounts branded around your application. And if you are creating content yourself in the early days, you're going to want to use Cap Cut to do so. And you can do a combination of slideshows and faceless video content or content where you're speaking directly to the camera. The most important note here when it comes to marketing is constant iteration. Be ruthless about how you iterate. Try out different strategies and as soon as you find something that is able to produce profitable returns for the company based on the time and or money investment, you double down and double down and double down on that.",
      "start": 583730,
      "end": 690410
    },
    {
      "speaker": "B",
      "text": "I want to double click into marketing because I see a lot of founders struggling to get eyeballs on their products. What are the mistakes that you see people making most when it comes to figuring out marketing?",
      "start": 690810,
      "end": 702220
    },
    {
      "speaker": "A",
      "text": "Yeah, I think that where a lot of people get lost in marketing is they think, okay, I will just DM influencers and expect a response within 24 hours. They'll DM10 influencers and they get no responses. You go, oh, this is so hard. And I'm like, no, you're just, you're not getting creative with it. With Riz GPT, the creator is making the most profitable content. Most of them are like 18, 19 years old. They're just doing it for fun. And so getting in contact with them was really difficult. I would find that one of them had a Discord link hidden in their Instagram bio or something. I would join that discord and I would send a message every 10 minutes until the person responded. There were guys that I was DMing their mom saying, hey, get me in Contact with your son. I want to pay him money.",
      "start": 702300,
      "end": 745500
    },
    {
      "speaker": "B",
      "text": "All right, now let's talk about how to make money once you have those eyeballs. How should people watching this right now actually monetize their app?",
      "start": 746140,
      "end": 753580
    },
    {
      "speaker": "A",
      "text": "The primary monetization model for most apps is subscription. Everybody that I know that makes a lot of money on apps uses subscriptions. Generally, I try to go with lower price points for a couple of reasons. One, I want as many people as possible to be able to use my applications. People are more likely to tell their friends about it, get generally more positive user sentiment on social media, but then it also is more sustainable for long term growth. And you know, a lot of apps charge significantly higher price points, which leads me to the most important point, which is you should use SuperWall. SuperWall enables you to split test different offerings. So different price points, whether it's weekly, yearly, monthly, at different points in the app, being able to test these different offerings and different placements within the app can take you from making x dollars per user that downloads to 1.5 or 2x.",
      "start": 754050,
      "end": 808640
    },
    {
      "speaker": "B",
      "text": "Awesome. Okay, so far we've only talked about the positives of building apps, but surely there are some pitfalls, right? What are the main expenses you have of running AI mobile apps? And how can people minimize them to stay profitable?",
      "start": 809440,
      "end": 822160
    },
    {
      "speaker": "A",
      "text": "Yeah, so Apple charges 15%, but for whatever reason, it's really closer to 20% of revenue up to your first million dollars in earnings. Beyond that, Apple charges 30, but really closer like 33%. One thing that people significantly overestimate is like the cost of AI in the back end. Unless you're doing image generation or using advanced voice mode, AI costs are sub 3%. The bulk of the expenses are usually attributable to marketing and staff. If you're doing that content creation yourself, you can do it on your own. But one of the reasons that internal UGC is great is that you usually see somewhere around like 50 to 80% profit margins. People doing influencer marketing, you usually see somewhere in the range of like 25 to 70%. And then people doing paid ads, you generally see like 0 to 30%.",
      "start": 822400,
      "end": 873430
    },
    {
      "speaker": "B",
      "text": "So in house, organic content might be the way to go if you don't want to spend all your profits on marketing. And on that same topic, are you comfortable sharing your profit margins?",
      "start": 873830,
      "end": 882390
    },
    {
      "speaker": "A",
      "text": "So after influencer marketing, after Apple's cut, after server processing, that sort of thing, Risk I don't think I can talk about, unfortunately, because it's run by my other co founders. Umax does a little bit over $100,000 profit a month consistently Used to do more. Kali does a few hundred thousand dollars in profit a month.",
      "start": 883030,
      "end": 902340
    },
    {
      "speaker": "B",
      "text": "Okay, another sensitive question. Sorry about it, but I'm just curious, what made you leave the Rizz GPT team?",
      "start": 902580,
      "end": 908980
    },
    {
      "speaker": "A",
      "text": "Left because one of my co founders and I were constantly going head to head about like who is at the helm of the company. Essentially what I said to him was like, okay, we can't work this together anymore. Either you run the company and I keep my equity or I run the company and you keep your equity. And he wanted to continue running it, which I was like, great, I'm going to go work on new projects.",
      "start": 909460,
      "end": 928790
    },
    {
      "speaker": "B",
      "text": "All right, thanks for being transparent about that. Now I'm going to go a bit easier on you. Let's talk about technology. What's the tech stack?",
      "start": 929510,
      "end": 936150
    },
    {
      "speaker": "A",
      "text": "Honestly, my stack looks like Figma Cursor, Capcut, Mercury for Banking. That's actually pretty big. Mercury is the best platform for startup banking in the us. Upwork for occasional contracted work. One upwork method I would recommend for anyone considering hiring off of there. Hire like five to 10 guys to do an hour or two of work and then stick with the best guy. That tends to work very well. Coding languages, React Native and Node js. Yeah, pretty, pretty straightforward, nothing special.",
      "start": 936550,
      "end": 968260
    },
    {
      "speaker": "B",
      "text": "All right man, let's talk about some personal stuff. What are you up to these days?",
      "start": 968660,
      "end": 972420
    },
    {
      "speaker": "A",
      "text": "I've always been so passionate about self improvement, about doing everything one can in order to improve their health, to become more successful and find more purpose in their life. And so that's why I set off to build what I'm currently working on, which is Apex, which I describe as an all in one self improvement ecosystem where we're starting to create content, build a free community, build free mobile apps to help people and sell low margin, high quality physical products. It's something that I'm very excited for and passionate about and I wake up every morning just like so amped to work on it. It's going well. We started this a little bit over a month and a half ago.",
      "start": 972990,
      "end": 1011680
    },
    {
      "speaker": "B",
      "text": "Hell yeah man, that's exciting. I think it's awesome to be able to wake up every day and work on something that you're actually passionate about. Another question I want to ask you is what's the biggest lesson that you've learned in your entire journey?",
      "start": 1012160,
      "end": 1023920
    },
    {
      "speaker": "A",
      "text": "Arguably the biggest one is creating a sense of urgency. I found that my most productive and successful periods have come when there's a lot of risk and a lot of urgency to get shit done quickly. So when I was building Riz GPT, it was like I'm at home making $0 while my parents house is on the market. Meanwhile all of my friends are making these great six figure salaries, living up life after college, and I felt like I had a fire under my ass to get something done and to begin succeeding. When I was building umax, I had obviously just split from my previous team and I felt like I had something to prove. I was on my brother's couch, I spent Thanksgiving alone, I had some sliced turkey while I was coding. And now with Apex, everyone looks at me and they're like, dude, you, you did so well in the app space and now you're building what? Like you're making content, you're trying to be a fucking influencer. I feel that. Like I feel the pressure and it fires me up. And if you feel like you have that, for lack of a better word, like you have dog in you, create a sense of urgency.",
      "start": 1024240,
      "end": 1094930
    },
    {
      "speaker": "B",
      "text": "100% agreed. Now the last question that I want to ask you, we ask all founders that we interview on Starter Story. What would you say to entrepreneurs who are just getting started?",
      "start": 1095250,
      "end": 1104450
    },
    {
      "speaker": "A",
      "text": "Yeah, I think one of the things that has helped me most succeed is trying to abstract myself away from what you hear on social media and what others are telling you to do. You have to be able to think on your own and think from first principles as opposed to constantly just doing what others say. There's a naval quote that a friend recently reminded me of. If you want to make the wrong decision, ask everybody.",
      "start": 1104690,
      "end": 1130600
    },
    {
      "speaker": "B",
      "text": "Love it, man. Well, Blake, I appreciate you coming on Starter Story and sharing all of this value. I can't wait to see what you build next. I'll be watching. Take care, man.",
      "start": 1130840,
      "end": 1139280
    },
    {
      "speaker": "A",
      "text": "Cool. Appreciate you, brother.",
      "start": 1139280,
      "end": 1140680
    },
    {
      "speaker": "B",
      "text": "Okay, recapping this episode. What I think made Blake so successful is how hard he went on content marketing. I've done a lot of research on businesses and nearly every really, really successful bootstrapped B2C app like this purely got traction from content. I think the most successful B2C founders are people building iPhone apps. They truly understand that product is just not as important as distribution. As distribution and attention wins the game. If you want to win in B2C, especially if your app is not niche, it's like a calorie tracking app like this. Then you must be ready and excited for the content game. You must already be thinking about what TikToks you're going to try, all the channels you can try and even validating your idea in the first place through content online before you even build something. This is why I created the Starter Story Academy to not only have you focus on building an idea, but most importantly, figure out how to get attention on that idea, how to get your first customers, how to get feedback from those customers so you can build a better product that will resonate with thousands if not millions of users. If you're serious about taking the first step, then definitely check out the Starter Story Academy. Just head to the first link in the description if you want to learn more. Much love and I'll see you guys in the next one. Peace.",
      "start": 1141400,
      "end": 1214310
    }
  ]
}