{
  "source": "/home/salouri/Projects/starter_story/transcripts/IZsQqarWXtY/IZsQqarWXtY_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "This is David. He built an AI app that is now valued at over a million dollars. And the crazy part is he built it all with no code. He invited us into his house to show us exactly how he built this thing. With a family, a full time job, and just working a couple hours a.",
      "start": 240,
      "end": 16520
    },
    {
      "speaker": "B",
      "text": "Day, really, it took me just a couple weeks. Came down to learning all of his content, mostly through YouTube.",
      "start": 16520,
      "end": 22680
    },
    {
      "speaker": "A",
      "text": "David launched his product using a viral marketing strategy that got him thousands of users and in just a few days. But what goes up must come down.",
      "start": 22680,
      "end": 32700
    },
    {
      "speaker": "B",
      "text": "I blew through like $5,000 in days. I had a decision to make, right. It's either shut it down or keep going.",
      "start": 32780,
      "end": 40580
    },
    {
      "speaker": "A",
      "text": "In this video, he breaks down how he bounced back, how he made his first dollar, and how he plans to build a business that won't be replaced by ChatGPT.",
      "start": 40580,
      "end": 49180
    },
    {
      "speaker": "B",
      "text": "My vision moving forward is to build something that cannot be replicated both in ChatGPT as well as Microsoft.",
      "start": 49420,
      "end": 56060
    },
    {
      "speaker": "A",
      "text": "This is the breakdown on how a normal guy turned one idea into a million dollar business on just a few hours a day. I'm Pat Walls and this is Starter Story. David, thanks for having me.",
      "start": 56060,
      "end": 69450
    },
    {
      "speaker": "B",
      "text": "Thanks for coming on over.",
      "start": 69450,
      "end": 70450
    },
    {
      "speaker": "A",
      "text": "I love your story. Tell me a little about who you are and what you built.",
      "start": 70530,
      "end": 73970
    },
    {
      "speaker": "B",
      "text": "Sure. Dave Bressler built what was called Excel Formula Bot. Now it's just called Formula Bot. Microsoft gave me a cease and desist a few months ago or so. And so it's a software that really helps people work faster and smarter with data. There's really three main products, AI and Spreadsh, where it's kind of like Chat GPT inside both Excel and Google Sheets, formula generators that translates text into formulas with the help of AI. And then the last product where a lot of my time and resources have gone into is called the Data Analyzer, where it's kind of like Zapier. You can upload your data and then through natural language, get answers, analysis, charts, modeling, all done by just typing in some words. The application has been around for about a year and a half and during that time there's now roughly about 750,000 users. And of those 750k, there's about 5,000 people that pay for unlimited access to the tool. And during that time it's reached about $26,000 a month in recurring.",
      "start": 73970,
      "end": 134589
    },
    {
      "speaker": "A",
      "text": "As I understand, you started Formula Bot while you had a full time job. Tell me a little bit more about that story.",
      "start": 134589,
      "end": 139590
    },
    {
      "speaker": "B",
      "text": "It was July of 2022. I had this opportunity and the opportunity was my youngest one was how to be bored. And so I knew I was going to have about six weeks to do something. And I've been working a full time job since I graduated college 2011. And I've always kind of had that entrepreneurial neck. Basically said, okay, I've got six weeks, let's build something. People always say, scratch your own itch, right? Solve your own problem. And my problem was I was getting so bogged down with all of these junior anals, they'd come knocking on my office door like, hey, can you help me with this formula? Can you help me with that? I kind of thought, okay, my itch is helping people with Excel. While ChatGPT wasn't around then, the actual technology was. I actually asked the OpenAI application, I said, hey, I'm thinking about building this app. What's a good name for it? And one of the names that suggested was Excel Formula Bot. Thing you do, of course is you go to GoDaddy. It was available. And then I was like, let me just see if someone's built this yet. And. And I scoured the Internet for hours, couldn't find it. I'm like, this is it. I'm onto something special. It was tough trying to find that balance between personal life. You know, I can't help but to a certain extent stay on the grid for my full time job, especially in the senior position that I was in. And so while I wasn't working, I still had access to my phone. People were still asking me questions here and there. But then in the back of my mind I'm like, I've got this idea that I have to execute on. I tried to spend, spend as much time with the family, especially early on, but I couldn't help but find myself kind of stepping away for a little bit. Go to coffee shops where it might be and just kind of put my head down and execute. And there were definitely a lot of nights where I only got a couple hours of sleep. My wife at that time thought I was crazy, especially because I didn't really have a clear path. I just knew I wanted to build this thing.",
      "start": 139590,
      "end": 252880
    },
    {
      "speaker": "A",
      "text": "So from what I understand, you have no experience coding. How did you build and launch something like this?",
      "start": 252960,
      "end": 258000
    },
    {
      "speaker": "B",
      "text": "I'm not a coder by any means. If I see it, I kind of know, okay, that's JavaScript, that's HTML. And I knew for what I wanted to build as an mvp, it would take a pretty significant time to build it with code. And I at that time wasn't making any money. I didn't want to hire anyone because I just had an idea and so that's where I was really exposed to the no code industry. I was exposed to Bubble IO. That was really the only application that I really dove into to build because it was the most well known and based on the research that I had done, that the easiest of all the no code solutions. The first place I went was the Bubble official website for just kind of reading some documentation. But there's so much documentation out there, which is a good thing. Kind of where I got hung up was very isolated issues that I was trying to solve. That's really where YouTube University came in. There are some awesome bubble developers out there that produce such high quality content on YouTube and it's all free. At that time, the whole app was in bubble. It was 100% no code. Probably up until maybe four or five months ago, it went from 100% no code to now it's about, I would say like 5 or 10%. As you get more experience with no code, you start to understand some of the limitations. There's not a lot, but there are some limitations.",
      "start": 258320,
      "end": 337570
    },
    {
      "speaker": "A",
      "text": "David is the perfect example of how someone with zero experience turned one idea into hundreds of thousands of dollars. But that comes with knowing the right information and finding the right problems to solve. Now imagine there's a place that gave you all this. The problems to solve, the blueprints to solve them, and the strategies that turn simple ideas into million dollar businesses. Well, at Starter Story, we have a library of over 4,000 case studies and business idea breakdowns where you can access this, all backed by data from real entrepreneurs. So if you're serious about building a profitable side project and joining a tight knit community of founders, head to the first link in the description and we're going to give you 52 micro SaaS, ideas just like David's, so you can get started on your journey. Much love. Enjoy the rest of the video.",
      "start": 337970,
      "end": 383000
    },
    {
      "speaker": "B",
      "text": "Peace.",
      "start": 383160,
      "end": 383640
    },
    {
      "speaker": "A",
      "text": "All right, so you have this MVP that you built from scratch. How do you get your first customer and how do you get a ton of people to use it?",
      "start": 383720,
      "end": 389920
    },
    {
      "speaker": "B",
      "text": "The first people I told were the people that were at my full time job at that time. And they're like, oh my God, this is amazing. And he thought it took me months to build this thing. Really, it took me just a couple of weeks. And that really kind of speaks to the power of no code, because if you were to code it, it would take much longer. And so my next step was I need to tell more people about this tool. And so naturally the next place I went was Reddit, went to the Excel subreddit where there's probably several hundred people that follow it. Reddit title was AI Excel Formula Generator. I think I mentioned it was free and it was just a title and the description was just a link. Minutes later, it was like the top post of the day turned into the top post of the week. It blew up as much as like something can blow up within the Excel community. A couple of days after that, someone in the comment section said, you should post this on the Internet is beautiful subreddit. And so I posted it there. That was like the thing that put the app over the edge and made it go viral for months. And so I'd post it there. It got some 10,000 upvotes, thousands of comments. You know, I got thousands and thousands of people visiting the site using the app.",
      "start": 389920,
      "end": 463510
    },
    {
      "speaker": "A",
      "text": "All right, so you have thousands of users. How do you start making actual money from this?",
      "start": 463740,
      "end": 467220
    },
    {
      "speaker": "B",
      "text": "The next thing I did was I went to the OpenAI website once. The billing section was just like, oh God. I blew through like $5,000 in open air API costs in days. I had a decision to make, right? It's either shut it down or keep going. And so I accrued this huge bill over that time. I recouped some of it back. I put up a link, like a stripe link where it's just like, hey, my name's David. I built this app. It went viral. Give me, you know, feel free to donate. So I made a few thousand dollars back. I was super scrappy of like trying to make something back. At that time it was pretty poetic, especially probably at its peak of virality. The host from the Esports ESPN XL competition. I didn't say it correctly, but something like that. But it's basically like extreme sports, but it's for Excel. The host reached out to me and said, hey, we have our competition on ESPN in a couple of weeks. Can we run a beta ad? I'm like, sure. I'm like. And at that time I was like, maybe that's how I. Before I even thought about subscriptions. I'm like, maybe that's how I can make money. At least in the interim is just running ads. So I ran some Google Ads, made a few bucks here and there. It just, it definitely wasn't worth the hassle. But I ran an ad for ESPN for like a week and it drove a ton of clicks. And it was actually pretty funny because the guy asked me to design the creative. I'm like, look, dude, like you've seen the website, especially at that time. It was a single page piece of Crap. It wasn't creative at all. But I mocked something up for him. He said, okay, works for me. And so some of the donations that came in a couple of sponsorships, it gave me the motivation to kind of keep going and not just completely shut this thing down. And so then a few months later, launch with a paywall, logins and the whole nine yards.",
      "start": 467220,
      "end": 587120
    },
    {
      "speaker": "A",
      "text": "Let's talk about product talking to customers. How have you figured out what features to build?",
      "start": 587120,
      "end": 591560
    },
    {
      "speaker": "B",
      "text": "Early on just kind of scratched my own itch and what would bring me value and what started off as just an Excel Formula generator turned into different generators. That was really just the first product. It was actually interesting because at that time my site was blowing up and I took a few phone calls with VCs. They would ask me, you know, what's your vision? What's your broader vision? And I would just say more generators. And they're like, okay. I never got called back. I didn't have a broader vision. That's where I started talking to people that I work with, who it's required to work with data in spreadsheets, started asking them and see what they liked, what they didn't like. But occasionally, and this is where I think I would get the most value, talking with customers. A lot of them email me basic Excel questions that couldn't necessarily be answered through an Excel Formula generator. They would literally email me their Excel files, be like, hey, your Excel Formula generator couldn't do this. Can you help me with this? And it wasn't even to like build a formula, it was to like build a report where I have no domain knowledge of, of what they're trying to accomplish. I would probably get one email a week of someone just sending me a file. And so I thought, okay, you know what, even if they're not a paying customer, I'm going to take this, but guess what, I'm going to do it with you on a phone call and I'll do your work for you. But every time I do it, they have to hop on a call with me and they have to ask questions about what they like and what they don't like about the product, as well as some ideas that they have. And so the culmination of kind of scratching my own itch, leaning on my network and having these kind of impromptu phone calls kind of revolutionized the product away from just being an Excel Formula generator to just kind of being this all in platform for anything that you do with data analytics.",
      "start": 591720,
      "end": 699360
    },
    {
      "speaker": "A",
      "text": "Building a SaaS product, software product. There's probably going to be a Lot of competitors coming in. Tell me about how that works for your product.",
      "start": 699600,
      "end": 705760
    },
    {
      "speaker": "B",
      "text": "Took me a few weeks to build this app and a few weeks after that I think There was probably 10 other Excel formula Generator sites. And the frustrating part was they all sounded the same right at that time. Excel Formula Bot, Excel Formula Generator. The other one was called Excel Formulator. They all sounded the same. And when you'd go to Google and you'd search mine, you'd see the other couple ones right there. So at that point it was really a race to the bottom. And my prices, especially early on, it was $3. I was getting pretty frustrated, just all of the competition that was coming in and literally like carbon copying my exact application. Not only like what it does, but also the front end, the name. And then I just kind of reached the point where I knew I was going to have to build something that isn't just a simple input output. A few months later, Excel Formula Bot was gaining more and more popularity. Microsoft actually reached out to me. They reached out to me twice. One for a cease and business and the other one, it was someone that was on their add ons team. Excel has thousands and thousands of partners that they work with to build an add on that supplements what you can do with Excel. They reached out to me and said, hey, we want to take your Excel Formula Bot and add it within our add on store. Let us create build it for you. I was like, sure, how much does it cost? They're like, we'll do it for free. I'm like, this is awesome. And then as they were building it, I was like, wait a second, they're just going to hijack this idea and build it as one of the many features in their, in their suite. A couple weeks after that, they had announced their partnership with OpenAI. Everyone's so excited for AI being integrated in the Office suite. And I'm like, I am so, so bruised. And so that's where kind of went back to me being my own competition, where I had to really take a step back and think through what is this product going to be once Microsoft embeds this product within their suite. I've even talked about ChatGPT, ChatGPT, especially at this time as well. It was free and it still is free for unlimited uses. At that time you had to pay 299. Now you got to pay $9. It's kind of worked its way up 299 to 699 to $9. And you have to pay for unlimited usage. Whereas ChatGPT has always been free. And so I have about 5% churn. 10% of the reason as to why people churn is because of ChatGPT. And so early on, before a lot of the newer products, especially the the data analyzer where you can upload your data and talk with it, the competitive advantage I had over ChatGPT was really convenience. Generate formulas within Excel. You don't have to leave your spreadsheets, you don't have to open up your browser, you don't have to open up ChatGPT and write this long prompt. You can do it all there. Convenience and customization. When you sign up, you can put in your language, your speaking language, you can put in your language for what you prefer for Excel because there's a lot of people out there that speak in Excel in Spanish, but they prefer the Spanish version of Excel and then also vice versa. Again, Excel, it's used by a billion people in the world. Excel Fourula Bot is used by every single country in thousands of languages. So early on it really was convenience and customization, but that can only take you so far. And so more so recently with the addition of the new features and new product, it's moved from that to you can no longer do that in ChatGPT and eventually when Microsoft really just this past week, builds AI into their own tool. Right now my vision moving forward is to build something that cannot be replicated both in ChatGPT as well as Microsoft.",
      "start": 705840,
      "end": 933880
    },
    {
      "speaker": "A",
      "text": "Hey, Pat from Starter Story here. Thank you guys so much for watching. I really hope David's story inspires and motivates some of you to get started on your own thing. If you're curious about doing something similar but you're still looking for an idea, well, right now you can download our deep dive SaaS report for free. It breaks down 52 different, different micro SaaS ideas and tons of other stuff you'd want to know. Just click the first link in the description and if you're serious about building it, then consider joining Starter Story and we'll help you do that. Much love and I'll see you guys in the next one. Peace.",
      "start": 933880,
      "end": 965940
    }
  ]
}