{
  "source": "/home/salouri/Projects/starter_story/transcripts/DZTApvWzMuY/DZTApvWzMuY_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "$300 is all Shervin shares made in his first year on YouTube. Now he makes a full time income as a YouTuber living in the most expensive city in the world, New York City for ya. In this video he tells us why he quit his six figure job just to make pennies on YouTube.",
      "start": 160,
      "end": 14600
    },
    {
      "speaker": "B",
      "text": "I was just like, this is the end.",
      "start": 14600,
      "end": 15760
    },
    {
      "speaker": "A",
      "text": "Turns out it was a little motivation.",
      "start": 15760,
      "end": 17600
    },
    {
      "speaker": "B",
      "text": "I watched the GaryVee video and he's.",
      "start": 17600,
      "end": 19520
    },
    {
      "speaker": "A",
      "text": "Like, this is exactly when you can live with four roommates in a basement and eat fucking fast food. Do you understand? Paired with a humbling move back into his parents house, moving back into my parents. We'll exactly how he was able to go from miserable office job to YouTuber with thousands of subscribers and six figures in revenue. I'm Pat Walls and this is Starter Story. Alright, we're headed up to the content closet right now. Let's check it out.",
      "start": 19520,
      "end": 48620
    },
    {
      "speaker": "B",
      "text": "How's it going? Welcome Pat. Good to see you. Good to have you. Welcome to the content closet.",
      "start": 50140,
      "end": 55100
    },
    {
      "speaker": "A",
      "text": "Before you became a youtuber you were a software engineer and you had like a pretty six figure job but you left it all. So yeah, tell me, tell me why you did that.",
      "start": 59420,
      "end": 67160
    },
    {
      "speaker": "B",
      "text": "You know, I did everything my parents had told me to do, which was, you know, study hard, go to college, get a good job. And then I came to the realization that like, all right, Now I have 50 years of my life left. Is this what I really want to be doing? But it was just the desire to chase something that kind of like internally. This internal voice is telling me, hey, you got to go chase after something that just doesn't make logical sense right now.",
      "start": 67160,
      "end": 89480
    },
    {
      "speaker": "A",
      "text": "Did anyone help you or how did you come to the decision to finally quit?",
      "start": 89750,
      "end": 92670
    },
    {
      "speaker": "B",
      "text": "How did that look? So funny story is I quit my job twice, technically. Once was the software engineering job and then I kind of like did YouTube and kind of explored and I became a product manager and then I quit that job too. There was no one else. Like, I think all my friends were working regular jobs. They're enjoying it, they're doing well financially. And I watched the Gary Vee video and he's like, if you just graduated college, you need to chase your dreams.",
      "start": 92670,
      "end": 114630
    },
    {
      "speaker": "A",
      "text": "This is dreams we're talking about. We're talking about dreams.",
      "start": 114790,
      "end": 118290
    },
    {
      "speaker": "B",
      "text": "Like this is the time to be high risk. And I was like, he's so right. Like in five years if I'm married and have kids, I was like, in five years if I'm married and have kids, I won't be able to take a massive risk. Like you can't just quit your job because you have to pay for your mortgage or whatever else, like, you're supporting other people. So I was like, now's the time. Just take the risk. What's the worst thing that can happen? I can always go back into a software engineering job. And that's when I kind of, like, decided. And then it just became like, okay, how do we go about it? And journaling, journaling, journaling, journaling. And then finally one day I was just like, this is the end.",
      "start": 118290,
      "end": 154000
    },
    {
      "speaker": "A",
      "text": "Quitting your job for YouTube is a crazy move. How much do you have saved up? Do you have a backup plan at the time?",
      "start": 154000,
      "end": 158800
    },
    {
      "speaker": "B",
      "text": "So I had a lot of investments from software engineering, luckily, that I had put, like, in the retirement account and then, like, other assets. And I was fortunate enough that those assets had grown immensely. So I had kind of, like, a asset I could pull from if I really needed an emergency. But in my bank account, I think I had, like, five or $10,000. But I felt comfortable because I had, like, those assets backing me. And I was like, if I really need more money, I'll sell stuff and I'll use that money. But I didn't really want to sell anything at the time.",
      "start": 158800,
      "end": 187670
    },
    {
      "speaker": "A",
      "text": "But you're able to make it off of 5, 10,000? At least in the beginning, yes.",
      "start": 187750,
      "end": 192550
    },
    {
      "speaker": "B",
      "text": "So luckily, YouTube was already making some money. I was making, I think, two to 3,000amonth. And I was like, as long as I can increase that revenue by focusing more on that, then I should be fine. So I really just focused on increasing that revenue, and I cut my personal costs as low as possible, and that's kind of how I lived. And for the most part, that was helping me. And I recently just started paying myself through the business.",
      "start": 193030,
      "end": 213920
    },
    {
      "speaker": "A",
      "text": "You said that you brought your personal expenses down to basically nothing. What did that look like?",
      "start": 214080,
      "end": 218800
    },
    {
      "speaker": "B",
      "text": "That was kind of like moving back in with my parents. So no rent. They paid for food. I didn't have to pay for a car. So I had the lucky opportunity that I could lean on them. So that was kind of the big thing. I was like, all right, how can I go about using this as. As. As a. As a way to kind of not.",
      "start": 219440,
      "end": 238010
    },
    {
      "speaker": "A",
      "text": "Have to spend too much Money being a YouTuber. For anyone else who wants to do YouTube full time, how much do you have to spend as a YouTuber?",
      "start": 238010,
      "end": 244130
    },
    {
      "speaker": "B",
      "text": "You don't have to spend any money, and you have to spend all the money. I think it's all hard work and dedication. Like, one thing I've really prided myself is trying to meet as Many other creators as possible. And the big thing you learn from that is a lot of people don't want it. They say they want it. They're like, yeah, I want to do this, I want to do that, or I have this dream, I. But no one wants it. If you're hungry enough, you could do it. That's the part that I've realized. So many people just say things, but they don't actually put in the work. If you put in the work, day in, day out, there's nothing stopping you.",
      "start": 244130,
      "end": 271110
    },
    {
      "speaker": "A",
      "text": "How can you tell if someone really wants it?",
      "start": 271110,
      "end": 272950
    },
    {
      "speaker": "B",
      "text": "It's not about how they talk, it's about what they publish. Are they publishing consistently? Are they adapting and learning and growing? And are they asking questions? One thing I struggle with is asking for help. But I've realized that even people who. I'm not a big creator, but people who might be one step behind me, if they ask me for feedback, like, okay, that person is hungry. And then I'm like, okay, maybe I should be asking other people for feedback too. So that shows that you want to learn and you want to get better.",
      "start": 273030,
      "end": 299460
    },
    {
      "speaker": "A",
      "text": "When you first got started, how much time were you spending creating videos and how many subscribers did you have? In the early days, I was doing.",
      "start": 299620,
      "end": 307460
    },
    {
      "speaker": "B",
      "text": "Like, I think daily vlogs were the thing back then. So I was like, oh, I need to publish every single day. So I would record during the day, edit at night, and then publish the next morning. And I did a couple like 30 day, 90 day challenges. And I think I had like 100, maybe 200 subscribers at the time.",
      "start": 307460,
      "end": 323160
    },
    {
      "speaker": "A",
      "text": "How many videos were you putting out? What was your. What was your output like?",
      "start": 323160,
      "end": 325800
    },
    {
      "speaker": "B",
      "text": "I think it was once a week, twice a week. I still switch between that. I'm trying to do, like I did three months where I was like, we're doing twice a week, and then I scaled it back to once a week. But for the most part, I think twice a week, once a week, or twice a month are probably like the three best cadences for YouTubers. What I've learned and noticed from most people.",
      "start": 325880,
      "end": 344580
    },
    {
      "speaker": "A",
      "text": "So how long did it take you to get to a thousand subscribers? Was that a big mark for you?",
      "start": 344890,
      "end": 349450
    },
    {
      "speaker": "B",
      "text": "I've heard this great quote. 100 subscribers is the hardest, 1000 is the next hardest. 10,000 is a little bit harder. 100,000 is a little easier, and then a million is even easier. And I think it's because the snowball effect, right? I don't remember how long it took me to get to like a thousand, but I remember it was like Years, like two years maybe, just posting content. And I wasn't really analyzing what was bringing in subscribers. I was just posting out of like, oh, this is fun, I like this, let's just keep doing it. But it took like two, maybe three years.",
      "start": 350410,
      "end": 381090
    },
    {
      "speaker": "A",
      "text": "And how long did it take to make your first dollar through your videos?",
      "start": 381170,
      "end": 384210
    },
    {
      "speaker": "B",
      "text": "So before the 1,000, 4,000 hours limit that YouTube had, I was monetized and I was making like $10 a month within the first year that I started YouTube. And then they created that cap and I was under the 1000 subscribers. So they cut off my money. And I think I made like $300 over a year. But that was the first like couple dollars that came in and you couldn't get the money until you hit $100 threshold. So I was like, I would see it rise, rise, rise. And I was like, oh, I'm at $80, we need 20 more to get the cash.",
      "start": 385090,
      "end": 413640
    },
    {
      "speaker": "A",
      "text": "And how did you make that money? Was it just through YouTube AdSense?",
      "start": 413800,
      "end": 416760
    },
    {
      "speaker": "B",
      "text": "It was all YouTube AdSense. Yeah, that's the first money.",
      "start": 417080,
      "end": 418880
    },
    {
      "speaker": "A",
      "text": "I know you make money through lots of different ways. Now how did you find those and what does that look like for you?",
      "start": 418880,
      "end": 424200
    },
    {
      "speaker": "B",
      "text": "I started to make videos that were kind of search based and like were product reviews. Like one of them was like a fitness tracker band. And I was like, oh, they gave me like a referral link. You know, sometimes they say, oh, put your link in the app. Like, oh, you get one month free if you refer someone. So I was like, all right, let's do it. So I put that link in there and the video got some views. And then all of a sudden I had three years of membership and I was like, what do I do with this? And then it became 10 years of membership. And I was like, what do I do with this? So then the company reached out to me, they're like, hey, we have an affiliate program. It's invite only. Do you want to be in it? And I was like, of course. Like, what am I going to do with 10 years of membership? So that was the first time. They're like, okay, here's your link. Instead of getting a free month, which was like, I don't know, 30 bucks or something, we'll give you $50. And I was like, all right, that sounds better. Like cash over this thing that is not really attainable. And that was the first time that I started to get some amount of cash. And I was like, alright, let's replace that link. Then I was like, okay, so it looks like if I make a Product review and people are searching the review and I provide value and some people will decide not to buy it because of my video and some people will, and if I tell them to use my link then I can make some money. So that helps support making more videos.",
      "start": 424280,
      "end": 499340
    },
    {
      "speaker": "A",
      "text": "Could you break down all the different ways that you make that you make money as YouTuber? I know affiliate marketing, YouTube AdSense maybe. Do you have any brand deals? Could you break it all down for us?",
      "start": 499340,
      "end": 507660
    },
    {
      "speaker": "B",
      "text": "Yeah, um, right now it's just affiliate marketing and YouTube AdSense. Uh, I'm starting to get into sponsorships that I don't really want to yet. Cause I want to like optimize for watch time and I don't know, it's like a fear that maybe if I put a sponsorship in like views are going to drop. I think it's probably like 80, 20, 20% is YouTube AdSense. 80% is affiliate marketing. Um, and then within that like there's two major companies that cover most of the AdSense, probably around 50% of that and then the rest is like a whole bunch of other small companies. This is my bedroom. Very tiny New York City for ya.",
      "start": 507660,
      "end": 546180
    },
    {
      "speaker": "A",
      "text": "So living in New York City is obviously really expensive. How are you able to live in New York as a creator?",
      "start": 547220,
      "end": 552820
    },
    {
      "speaker": "B",
      "text": "You just have to give out an arm and a leg. I think part of it I was lucky and fortunate enough to meet two other creators who were also chasing the same thing and were like, we figured out what we wanted to prioritize. And for me it was like location. I want to be surrounded by other creators and we know a lot of other creators who kind of live near this area. And then the second aspect was save as much money as possible. So we tried to find the cheapest place where all three of us could live in. And this was it. Like it provided bedrooms for all of us. It has a nice big living room so that way we can like have our desks and create content. It kind of got our basic needs met. So it's just cut costs as low as possible and get like your high priority items. Yeah. And that's it.",
      "start": 553300,
      "end": 591990
    },
    {
      "speaker": "A",
      "text": "And how much does this place cost for rent? The whole place.",
      "start": 591990,
      "end": 594590
    },
    {
      "speaker": "B",
      "text": "And in this room we pay 4,500 for three of us. So me and my roommate Tejas, we pay 1600 and then Colt, our third roommate pays the rest.",
      "start": 594590,
      "end": 603510
    },
    {
      "speaker": "A",
      "text": "And do you eat out a lot or how do you save in money?",
      "start": 603750,
      "end": 606710
    },
    {
      "speaker": "B",
      "text": "I'm trying to cut that down. So actually one video I'm working on is how to make homemade meals in less than two minutes. And save money that way as well as like optimize time. So I have like a little smart oven thing that I use and that helps me like cook most of my meals.",
      "start": 608230,
      "end": 621970
    },
    {
      "speaker": "A",
      "text": "Nice. And what are the other big expenses as a new NYC creator? Other than rent and food? What do you spend?",
      "start": 621970,
      "end": 628970
    },
    {
      "speaker": "B",
      "text": "Coffee. This place is so small. Like it's nice to just change your environment and go outside somewhere. So I like to go work at a coffee shop or meet people at a coffee shop. That's probably my biggest expense. And then gym, I love working out so there was a time where I had two gym memberships but now I don't. Um, but like going to the gym or a sauna and, and cold plunge studio, like that's another cost. So I, I would say health and wellness costs are pretty high. Anything you really want to do in New York City, it's like almost double the price sometimes.",
      "start": 628970,
      "end": 659520
    },
    {
      "speaker": "A",
      "text": "Yeah, I think that's a good segue to go check out a coffee shop and.",
      "start": 659520,
      "end": 662840
    },
    {
      "speaker": "B",
      "text": "Right, say coffee. Coffee shop. Go to coffee shop.",
      "start": 663400,
      "end": 666280
    },
    {
      "speaker": "A",
      "text": "Alright, so what's been your most successful.",
      "start": 671720,
      "end": 674570
    },
    {
      "speaker": "B",
      "text": "Or viral video on YouTube? It was definitely the. I replaced my iPhone with an Apple Watch Ultra. I think it's around 1.56 million views right now.",
      "start": 674570,
      "end": 683450
    },
    {
      "speaker": "A",
      "text": "And what's the story behind it?",
      "start": 683690,
      "end": 685050
    },
    {
      "speaker": "B",
      "text": "So that's like been a video I've done a couple times before and the intention behind it was like, can I survive with just my Apple Watch? Like I'm always consuming social media on my phone and I want to just like get rid of my phone. So I was like, can I do 24 hours just Apple Watch? And I've done it before and it did pretty well. And I was like, alright, the new Apple Watch is coming out. Let's launch this video at the same time that all the Apple Watch Ultra hype is happening. So as soon as I got the watch, I did the video literally the next day and I tried to release it as fast as I could. I don't think the editing was great. It was just like get it out now.",
      "start": 685210,
      "end": 718570
    },
    {
      "speaker": "A",
      "text": "Why do you think it went viral?",
      "start": 718650,
      "end": 719770
    },
    {
      "speaker": "B",
      "text": "Timing topic and just having previous data that like this style could potentially work. So I think it was a factor of those three things of like, I know this video has worked for me in the past. Timing of Apple Watch Ultra and then the topic. People love Apple Watches. Yeah, yeah, yeah.",
      "start": 719770,
      "end": 735410
    },
    {
      "speaker": "A",
      "text": "And how did it feel when you were getting like all those views? Was it crazy?",
      "start": 735410,
      "end": 738170
    },
    {
      "speaker": "B",
      "text": "I think I was like, oh, I really don't care. I was like, it's not about the views. Like yeah, Having one viral video is, is cool, I guess. But like, I want to have an engaged audience and engaged people community. And if all those 1.5 million people watch the video and never come back, like, what's the point? I want people to come back. I'd rather have consistently 100,000 views than one video that gets like 10 million views. So that's kind of my goal.",
      "start": 740410,
      "end": 767460
    },
    {
      "speaker": "A",
      "text": "You got a team working with you now. How do you find good editors and good filmers and good people to work with?",
      "start": 771700,
      "end": 776260
    },
    {
      "speaker": "B",
      "text": "I think it's network either through other creator friends. I ask them, hey, do you know anyone who is available for work, going to different events and meeting people and then asking them, that's probably the biggest one. And then online, like upwork is a good spot. It's hard to find good people. You really have to like go through like hundreds of people to finally find a good editor. That's kind of how I found my first one. It was cheap. I think they were like seven to ten dollars an hour. Yeah. And if you outsource it to other countries, then you can save a ton of money that way. Yeah.",
      "start": 777310,
      "end": 804320
    },
    {
      "speaker": "A",
      "text": "All right. So Shervin, what would be your advice for anyone that maybe is in a full time job right now and wants to create content for a living or be a creator or just to get started creating?",
      "start": 804320,
      "end": 813880
    },
    {
      "speaker": "B",
      "text": "Start creating. I think take a day, one day a week, like your Sundays, and dedicate that day to creating content and just start building momentum because that's the most important thing. If you're not consistently creating, then it's not worth quitting your job. You have to first build the momentum, build the habits of actually doing it. And you have to sacrifice like some of your social life. You have to sacrifice other things in your life. But I think it's important to just get the ball rolling.",
      "start": 814840,
      "end": 838580
    },
    {
      "speaker": "A",
      "text": "You're doing videos on tech and gadgets and fitness. How do you find ideas for videos?",
      "start": 843620,
      "end": 848660
    },
    {
      "speaker": "B",
      "text": "Yeah, it's just a lot of searching on YouTube. Like, I'll search the topic. Like right now I'm doing a testosterone supplements video and one thing is like, I can search like the supplement's called Tongkat Ali. So it's like I could search that. It's like, okay, these videos aren't doing that well. But if I do testosterone supplements, maybe that is doing well. But if I do a video about gaining muscle, like, oh, that's gonna do extremely well. So yeah, the video might be about the same thing, but it's like, how do I frame it? And it's about researching and then all Right. What's kind of related to this and then looking at other videos kind of related to that and then just kind of going down a rabbit hole of a whole bunch of YouTube videos to finally figure out what's the best way to kind of frame this video. And then it's just chasing my curiosities. Like, I'm a very curious person. I like to think. So if I'm like, I want to learn about this, I must know like what happens if you do this. Then that kind of becomes an idea and then it becomes how do I package that idea? Yeah.",
      "start": 848740,
      "end": 898850
    },
    {
      "speaker": "A",
      "text": "Do you believe it's important to surround yourself with creators?",
      "start": 898850,
      "end": 902490
    },
    {
      "speaker": "B",
      "text": "I think anything you're trying to achieve, you must surround yourself with people who are also doing the same thing. You know, the five chimps, that theory, you become like the people you're surrounded by. So I'm a big believer in that. And that's why I'd surrounded myself with other creators. And then how did I go about finding them? It was just, I went to creator events. So like I think I looked on meetup or random things like that. Once you move to a new city, it's just like you're just searching online to find whatever you can. And then as soon as you meet one, then they start to invite you to other events and it becomes like this snowball effect where once you have at least like five creator friends, like they know about other events and it becomes, becomes this kind of word of mouth thing. And it's just like going to these dinners, going to any kind of event that's based around creating content, you get to meet other people who are also doing the same thing. And it's kind of lonely, I would say a lot of creators, like it's. There's not that many creators in the world. Right. People who are actually serious about it. So when you do meet other people who are also in the space, like, it's just like an instant bond because you know the challenges that they've been through and you know, like this person's also hungry. Like they're not just like here to like lollygag.",
      "start": 902730,
      "end": 965930
    },
    {
      "speaker": "A",
      "text": "I heard that you're trying to run a five minute mile. How's that going?",
      "start": 965930,
      "end": 968770
    },
    {
      "speaker": "B",
      "text": "I got injured, but I'm gonna do it. I am, I want to do it. If you know a guy named Dr. Andrew Huberman, I recently learned that he, his fastest time is at 4:57. So that's my new goal is I want to beat his time in the mile. I think it's like one thing as I'M getting older is like my body is, I've hit the age where my body's deteriorating every year so I just want to see like what am I physically capable of doing And I also want to use that as a goal to build these long term habits for longevity of just staying healthy with my cardiovascular system. But I did get injured but I'm slowly getting back into running and I'm like I need to take a safe approach. I'm not a 21 year old invincible man. Just about, you know, maybe this is not going to take longer than two months. Like it's going to take a year, two years but chase after that goal. Yeah.",
      "start": 970130,
      "end": 1018490
    },
    {
      "speaker": "A",
      "text": "And how close did you get?",
      "start": 1018490,
      "end": 1019530
    },
    {
      "speaker": "B",
      "text": "05:26 is my fastest time so far.",
      "start": 1020170,
      "end": 1022210
    },
    {
      "speaker": "A",
      "text": "That's pretty good. Almost there.",
      "start": 1022210,
      "end": 1024410
    },
    {
      "speaker": "B",
      "text": "Almost there.",
      "start": 1024410,
      "end": 1025210
    },
    {
      "speaker": "A",
      "text": "Okay.",
      "start": 1025370,
      "end": 1025930
    },
    {
      "speaker": "B",
      "text": "Make sure to like and subscribe. Turn on your notifications. Don't ever put that in a YouTube video.",
      "start": 1026330,
      "end": 1030970
    }
  ]
}