{
  "source": "/home/salouri/Projects/starter_story/transcripts/xZDofUHbZHA/xZDofUHbZHA_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "What if I just went for it? This was the question I asked myself one summer for probably the 39th time. It was a Sunday and I was about to get on a flight across the country. I just spent the weekend drinking into oblivion with my friends. The whole weekend felt like a blur. I was so hungover. And like with every other hangover, I.",
      "start": 12960,
      "end": 34220
    },
    {
      "speaker": "B",
      "text": "Began to ponder my life.",
      "start": 34220,
      "end": 35620
    },
    {
      "speaker": "A",
      "text": "I couldn't stop thinking about how much I didn't want this. Living for the weekends, dreading Mondays. A life full of comfort, yet devoid of any freedom. I was nearly 30 years old, already many years into my so called career. Successful by society standards. But still, something just didn't feel right. You see, as a kid, I always had dreams I'd be different. But as life went on, those dreams, they faded away. And I found myself stuck behind a desk. All thanks to a series of decisions I thought were in my best interest. College, the fancy job, the big city. These decisions. Did I make them for me? Or did I make them for everyone but me? And whenever I found myself alone in the airport, hungover like this, these dreams would come back. It was at this moment I found myself wondering. What if I just went for it? One year.",
      "start": 35780,
      "end": 84760
    },
    {
      "speaker": "B",
      "text": "That's all I need.",
      "start": 84920,
      "end": 86040
    },
    {
      "speaker": "A",
      "text": "What would happen if I chased my dreams for 365 days? And that's when it all started. In that moment, I reached into my suitcase and pulled out the book I've been struggling to get through. A book called Think and Grow Rich. This book would eventually rewire my brain for success. But for now, I flip to my bookmark and read this. Whatever the mind can conceive and believe, it can achieve.",
      "start": 86440,
      "end": 128930
    },
    {
      "speaker": "B",
      "text": "A simple quote.",
      "start": 129090,
      "end": 130130
    },
    {
      "speaker": "A",
      "text": "But I read it over and over and over. If you want to change, you must believe in that change. You must visualize that change. But what change did I want? I wanted to be free of my student loan and credit card debt. I wanted to work on things I was passionate about. I wanted to be free. But dreams. They're not enough. You must create a detailed plan of action to achieve your goal. So what would be my plan of action? I will stop spending money on bullshit. I'll dedicate nights and weekends to building my future. I'll. I will start building a business. I wrote all this down on a tiny little note card. This was my manifesto. Exactly what I want and exactly how I'll get there. When I got home, I nailed this little note card right above my bed. And I read it over and over, every night and every evening until it was etched in my memory.",
      "start": 130130,
      "end": 183510
    },
    {
      "speaker": "B",
      "text": "What should I Even work on what am I actually passionate about and how.",
      "start": 197380,
      "end": 202340
    },
    {
      "speaker": "A",
      "text": "Can I actually make money from it?",
      "start": 202340,
      "end": 204180
    },
    {
      "speaker": "B",
      "text": "These questions, they paralyzed me.",
      "start": 204340,
      "end": 206740
    },
    {
      "speaker": "A",
      "text": "They prevented me from ever actually getting started.",
      "start": 206820,
      "end": 209540
    },
    {
      "speaker": "B",
      "text": "And that's when I realized I was obsessed with control. I was obsessed with the idea of having it all figured out. And this made me scared of committing to anything.",
      "start": 209860,
      "end": 221040
    },
    {
      "speaker": "A",
      "text": "But really, I was scared of failure.",
      "start": 221280,
      "end": 223920
    },
    {
      "speaker": "B",
      "text": "But this manifesto, this little piece of paper right here, it did one thing. It forced me to get started.",
      "start": 224080,
      "end": 231680
    },
    {
      "speaker": "A",
      "text": "And getting started, even in the tiniest.",
      "start": 232000,
      "end": 234440
    },
    {
      "speaker": "B",
      "text": "Way, taught me something that would change everything. Failure is success. When I finally gave myself permission to fail, it unlocked the answer. I knew I wanted to build a business. But what do I work on? Getting started was the first part. But I quickly found myself trying to build things I had no business doing. My first business idea lasted about three weeks until I realized I was building something because someone told me it can make money online. I had no passion for the idea and no skills that would help me build it. And that's when I went back to the drawing board and, and looked for an idea that only I could build. Something that aligned perfectly with my skills, my passions, and of course, something that could actually make money. Within days, I came up with the idea for Starter Story. A platform where you could see how regular people like you and me built businesses that changed their lives. Exactly how they found their ideas, exactly how they launched, and exactly how they got customers. This was the product that I needed, and this was the product that only I could build. So why not create it for the world? I purchased the domain name, I put together a plan, I started building, and everything started to click. I realized that this idea, it had been living in my head all along. But my obsession with control, my fear.",
      "start": 234440,
      "end": 318110
    },
    {
      "speaker": "A",
      "text": "Of failure, prevented me from ever getting started on it.",
      "start": 318110,
      "end": 321270
    },
    {
      "speaker": "B",
      "text": "But once I let go of that, I was free. I believe that everybody has a business idea just like this. Something that aligns perfectly with your skills, your passions, and of course, something that can actually make money.",
      "start": 321510,
      "end": 335130
    },
    {
      "speaker": "C",
      "text": "To prove it to you, I'm running.",
      "start": 335290,
      "end": 336850
    },
    {
      "speaker": "B",
      "text": "A free workshop to show you exactly how you can do this too. We'll hang out and talk about how to overcome that self doubt, how to find your million dollar business idea, and.",
      "start": 336850,
      "end": 346170
    },
    {
      "speaker": "C",
      "text": "Exactly how to execute on that idea.",
      "start": 346170,
      "end": 348090
    },
    {
      "speaker": "B",
      "text": "On just two hours a day, just.",
      "start": 348090,
      "end": 350020
    },
    {
      "speaker": "C",
      "text": "Head to the first link in the.",
      "start": 350020,
      "end": 351580
    },
    {
      "speaker": "B",
      "text": "Description to save your seat spots are limited. I'll see you in there. Ever heard the phrase people never change? Well, I believe this is mostly true with one exception. People do change when they change their environment. It's the reason people change. When they leave their hometown for the big city. A new start. I needed a new start. I was trying to become this new person, trying to actually build something. But the problem was I was stuck in my old apartment, in my old ways. No execution, no focus, no consistency. And that's when I realized that was my problem. It was my environment. That's what I needed to change. So I went looking for a new place, a new environment where I could have a new start. And I know it sounds so simple, but that place was the Starbucks down the street. This was the place where I transformed from someone who never did anything to someone who actually got shit done. I started waking up every day at 6am and every day I walked into that Starbucks, I became a new person, this new environment, this new me. And this is when things really started to change. I basically stopped drinking and spending all my money on the weekends. I stopped spending every Sunday watching 12 hours of football. And I started building this new future.",
      "start": 351580,
      "end": 443040
    },
    {
      "speaker": "C",
      "text": "Things started to happen really fast. Two months in, I found my distribution channel, I went viral on Reddit, and all of a sudden I had an audience and an actual validated business model. Four months in, I made my first dollar and landed the first sponsor of my newsletter. Five months in, I started making Internet founder friends and building a following on Twitter and meeting people from all across the world. Eight months in, I landed my first really big sponsorship deal for $12,000. I had never seen this amount of money hit my bank account at one time. This is is when I knew that.",
      "start": 443359,
      "end": 482680
    },
    {
      "speaker": "B",
      "text": "I really had something.",
      "start": 482680,
      "end": 484160
    },
    {
      "speaker": "C",
      "text": "People were willing to pay me money for something that I built from a Starbucks and a laptop. And this blew my mind. And 365 days later, I had built a business to $3,500 a month from a laptop in a Starbucks. While I had a full time job, I had made it. I walked into work, handed my resignation and quit my full time job. I was going to go all in on starter story.",
      "start": 484560,
      "end": 511930
    },
    {
      "speaker": "B",
      "text": "This journey, it didn't come without sacrifice. Yes, I built this business, but in the process, I had to change into a different person. I became so focused on actually making this thing work that I felt like I had to leave a part of my past behind. I became more and more detached from my old friends and even my family. I had to move from the city that I loved. I even had to miss a good friend's wedding. All for what? And that was probably the hardest part. In my darkest moments, I laid awake wondering if this was all worth it. Am I being selfish to sacrifice everything in the name of chasing my dreams. I knew I had to go on this journey. But what would happen when I came back and I'm a new person? My old friends, my family, would they accept the new me?",
      "start": 520570,
      "end": 574260
    },
    {
      "speaker": "A",
      "text": "As I look back on the journey, I can't stop thinking about that question. What if I was never alone in that airport on that fateful day? What if I never had that book in my suitcase? Yes, the journey was full of sacrifice. If I didn't push through those 365 days of change to change my habits, to change my environment, to change my identity, what would have happened? And even though I had to change as a person, my friends, my family, they welcomed me back with open arms. They were so happy for me. I didn't realize it, but they were actually along for the ride the whole time. And that makes me so happy. In those 365 days, I built a business.",
      "start": 576500,
      "end": 612570
    },
    {
      "speaker": "B",
      "text": "And that changed my life.",
      "start": 612570,
      "end": 613880
    },
    {
      "speaker": "A",
      "text": "I achieved that freedom that I had set out to get. No boss, no Mondays. Nobody can tell me what to do. That doesn't mean that life is easier now, because there's a whole new set of problems when you're in control. But now I'm in the driver's seat. And even more important, I get to wake up every day and work on something that I'm so passionate about. STARTER STORY So, were those 365 days worth it? Who knows? But I know one thing for sure. I'll never have to ask myself the.",
      "start": 614200,
      "end": 643400
    },
    {
      "speaker": "C",
      "text": "Question, what if I never went for it?",
      "start": 643400,
      "end": 646840
    }
  ]
}