{
  "source": "/home/salouri/Projects/starter_story/transcripts/WGVxAmmJUmY/WGVxAmmJUmY_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "What's your story?",
      "start": 160,
      "end": 800
    },
    {
      "speaker": "B",
      "text": "I lived with my parents working as a waiter part time to make I think $10 per hour. I was telling people I'm gonna make it. I'm the next Mark Zuckerberg and I'm gonna have a billion dollar startup idea and I'm gonna focus on it.",
      "start": 2800,
      "end": 15600
    },
    {
      "speaker": "A",
      "text": "This is Mark, a guy who tried everything to become an entrepreneur, but nothing was working.",
      "start": 15680,
      "end": 22960
    },
    {
      "speaker": "B",
      "text": "I didn't have any salary, I didn't have any savings. I was like broke like crazy. Like we were living in like, I don't like 12 schools square meters. They were cockroaches.",
      "start": 23200,
      "end": 31110
    },
    {
      "speaker": "A",
      "text": "Then after years of failure, he finally built a business that worked.",
      "start": 31430,
      "end": 36710
    },
    {
      "speaker": "B",
      "text": "At some point, life become like very beautiful. Like, finally I made it, I have my apps, I make enough money to sustain my life. And Covid hit. Everything that I built for the last two years just suddenly disappeared. Wipe out. I've been in the journey for like almost five years already. I failed 30 startups and I didn't build anything, I didn't save any money, I didn't create anything that will last. And then one morning, I started to cry for no reason.",
      "start": 36790,
      "end": 61790
    },
    {
      "speaker": "A",
      "text": "In his darkest moments, Mark does something he never thought he would have to do.",
      "start": 61950,
      "end": 66990
    },
    {
      "speaker": "B",
      "text": "It made me question why I was an entrepreneur. Why am I doing all that if I can just get a sense of like, worthiness, having a job.",
      "start": 67150,
      "end": 74590
    },
    {
      "speaker": "A",
      "text": "But with everything on the line, Mark discovers something that would change his life.",
      "start": 74750,
      "end": 80510
    },
    {
      "speaker": "B",
      "text": "I feel bad and I decide I got to change everything. I'm going to be an entrepreneur again. But these times I'll do things different.",
      "start": 80990,
      "end": 87140
    },
    {
      "speaker": "A",
      "text": "This is the story of how Mark Liu went from working as a waiter for $10 an hour to making $1.5 million a year as a solopreneur. Welcome to Starter Story.",
      "start": 87770,
      "end": 99290
    },
    {
      "speaker": "B",
      "text": "I was born in a family of engineers. None of my friends or family members are entrepreneurs. And I grew up like 25 years in this ecosystem where the only thing that matters is like, you have to have good school degree, you have to go university. And I think that created a frustration inside of me because I didn't, for some reason I didn't care about school. I was a bad kid, I had bad grades. I didn't feel like I was belonging to where I was. People wanted to do stuff and I wanted to do the opposite. At university was the same. So they were partying but also studying. And I didn't know why I was learning what I was learning.",
      "start": 104730,
      "end": 133550
    },
    {
      "speaker": "A",
      "text": "After four years of partying and barely attending lectures, Mark graduated and had to make a big decision.",
      "start": 133790,
      "end": 139950
    },
    {
      "speaker": "B",
      "text": "When my friends and I graduated, from uni. They all got a job pretty easily in Paris as software engineers. And I think around the time I might have seen the movie the Social Network with Mark Zuckerberg. And for some weird connection in my brain I was like, this is me, I'm the next Mark Zuckerberg and I'm gonna have a billion dollar startup idea and I'm gonna focus on it. And the idea was to create a Tinder for sports lover. There was no business plan in mind. There was not even an idea of how to monetize that thing. I was just, I have to build that thing.",
      "start": 143570,
      "end": 172790
    },
    {
      "speaker": "A",
      "text": "Mark has a brilliant idea that he believes will be the next billion dollar unicorn. So he takes the road less traveled.",
      "start": 173190,
      "end": 181510
    },
    {
      "speaker": "B",
      "text": "As I chose a different path. I lived with my parents, working as a waiter part time, like at night basically to make I think $10 per hour. I was so arrogant that I spent a year working on this app. I was telling people I'm gonna make it. I built this identity for one year of this guy who is going to build the next brilliant idea and even know what I'm working on because it's a brilliant idea, right? And I realized after 365 days that this app would never exist because I didn't have the capacity to build it and that it would never make money. Everything crumbled. Like all my one year arrogant belief fell apart. And that's the moment where I stopped working on my app. Like I threw away all the code in 24 hours, quit my girlfriend because I was a terrible boyfriend and moved to South Korea, to the other side of the planet.",
      "start": 181670,
      "end": 226710
    },
    {
      "speaker": "A",
      "text": "Mark experiences his first failure, but he's still committed to becoming an entrepreneur. He wants to prove to everyone that he can do this a different way.",
      "start": 227270,
      "end": 237510
    },
    {
      "speaker": "B",
      "text": "A friend of mine gave me a call. He was in South Korea and he said he could raise some money from VC to build an AI startup back in 2017, which was pretty cool. We were both engineers. None of us was good at marketing, none of us was good at product and business. And so we ended up having this brilliant idea again. It's going to work out. If we build a product, we build a product. It took six months to make an app, but we didn't get any customers. So in the end, nothing happens.",
      "start": 240150,
      "end": 264550
    },
    {
      "speaker": "A",
      "text": "After spending a year building another product that got zero customers, Mark realized that maybe this whole venture capital thing wasn't for him. But this gives him an idea.",
      "start": 264710,
      "end": 276470
    },
    {
      "speaker": "B",
      "text": "After the AI startups, I didn't have any salary, I didn't have any savings. I was like broke like crazy. Like, I was living with my girlfriend as well. We were living in, like, I don't like, 12 square meters. There were cockroaches in the bathroom and stuff. The frustration of doing stuff for two years that led to nothing. It made me desire the craving for, like, tiny projects that have quick, instant results. I saw this ad on Facebook where you have those two people holding hands together inside of one mitten with thousands of likes. I knew that if it works for them, then it would work for me too. I ended up going in the street selling those gloves because I was terrible at Facebook ads, so I couldn't sell any online. Even though we made zero with the gloves, we probably sold 30 gloves. I still want to chase that thing. Show a different path, show a different way, and show that you can also make it with a different strategy.",
      "start": 279110,
      "end": 328640
    },
    {
      "speaker": "A",
      "text": "With three failed businesses and countless lessons learned, Mark realizes he needs to do something different. He doesn't want to be a starving artist sharing his flat with cockroaches and, and spending all his time working on projects that never make money. With this in mind, he starts looking for his next idea.",
      "start": 329280,
      "end": 348680
    },
    {
      "speaker": "B",
      "text": "I had this learning from those previous startups to start first with the problems, and I was like, what is a universal problem that everybody has that I can solve? Every business wants more customers, right? So maybe I can help any business get more customers. And the idea was to create a little tool for escape room businesses to help them get more customers. But I met a guy who is 100% marketer. His job is marketing. And he's like, why don't you just try to sell it before you make it? I listened to him. I did exactly what he told me. I sent some cold emails and I'm supposed to have the call. With this business in Australia, it's the first time I do a call with a lead. I'm thinking like an engineer and I feel like I'm scamming her, just talking to her, but she's so friendly. She's like, yeah, so what is your idea? And in the end of the call, after 4, 42 minutes, she's like, all right, yeah, send me the invoice. I'll pay. I'm sweating like, my armpits are sweating so much. And I make her confirm. I was like, are you sure? And then she said yes.",
      "start": 351640,
      "end": 406810
    },
    {
      "speaker": "A",
      "text": "After a couple years and several failed ideas, Mark's efforts finally paid off. He made his first dollar. He didn't need a fancy website or a perfect product. All he needed was a solid idea and someone who was willing to pay for it. If you're someone like Mark looking for their first idea, trying to make your first dollar online, then I have something special for you. This is a free breakdown of 50 plus solo developer ideas to help you get started. It includes a bunch of stuff, business models, revenue strategies, and a bunch of other stuff you'd want to know. And it's for everyone. No coders, developers, indie hackers. Just click the first link in the description and we'll send it over to you for free. Mark's efforts finally paid off. He's made his first dollar online. But most importantly, he now knows firsthand that entrepreneurship works. But when everything was at its best, something very unexpected happened.",
      "start": 407050,
      "end": 465600
    },
    {
      "speaker": "B",
      "text": "So this virally bought project quickly made some enough money to sustain my life. Like a thousand dollars per month. We moved to Bali and my days would be exactly the same. I would send some emails in the morning, try to get someone on the phone, call exactly like I did for the first dollar on the Internet. And the revenue grew to at the top, it went until $4,000 in monthly recurring revenue. At some point, life become like, very beautiful. Like I finally, I made it. I have my apps, I work on my own project, I don't have any meetings, I have customers. I make enough money to sustain my life. I live in Bali. I learned how to surf. It's just so nice. The revenue is going up. And then I was working with physical businesses and Covid hit everything closed down. Revenue went from $4,000 a month to zero in like 24 hours. Everything that I built for the last two years just suddenly disappeared. Wipe out.",
      "start": 466160,
      "end": 513420
    },
    {
      "speaker": "A",
      "text": "After Covid brings Mark's business to zero, he decides to take a break. He keeps on surfing and living life. Then when the lockdown eased, something insane happened.",
      "start": 513740,
      "end": 526220
    },
    {
      "speaker": "B",
      "text": "My girlfriend and I decided to get married. So we flew back to France and we had a beautiful wedding. After a couple weeks, they started to lock down everything again. We were supposed to come back to Bali, but we couldn't. So I'm 28 years old, I'm a married man, I don't make any revenue. Most of the businesses I've tried failed. And I think at this moment I feel not so good. Like I don't know why I'm doing all that anymore. I feel like I've never achieved anything really. And I'm back at 28 years old in the house where I left to try to show there was another way, showing that I failed, basically. And then one morning, I have no clue what is happening. I start to cry for no reason. Like I usually control my emotions. I start to cry but have no idea what's going on. And I look at my wall and I start to punch my wall four times like without even thinking. My wall is pretty thin. So it goes through the wall and I'm shouting and I'm like, I don't like so much anger that just comes out. So I've never felt this bad before. I don't really know what depression is, but this lack of control that I had on me and these emotions bursting out without me controlling anything, maybe.",
      "start": 526460,
      "end": 592830
    },
    {
      "speaker": "A",
      "text": "After five years of failure, with no income or savings, 28 year old, freshly married, Mark decides to do something that he never thought he would have to do. He applies for a few software engineering jobs. Luckily, because of his experience, he quickly lands one of the positions.",
      "start": 594590,
      "end": 613340
    },
    {
      "speaker": "B",
      "text": "And the job is like, we're offering you $9,000 a month. I look at that, I was like, I've been making a thousand dollars a month for five years and now you're offering me US$9,000 per month. I was like, what the fuck is going on? So I jumped straight into the job. And when you have a job, your boss is telling you, today I want you to do that. So at the end of the day, once you've done that, you've created the value for the person and it makes you feel like you're worthy. I didn't get any of this in the past, so it really feels like I was useful to someone.",
      "start": 613500,
      "end": 642030
    },
    {
      "speaker": "A",
      "text": "Making more money than he ever had, all while feeling useful to society. Mark starts to question if he was ever meant to become an entrepreneur. And maybe for him, having a regular job is enough to live a fulfilling life.",
      "start": 642270,
      "end": 657630
    },
    {
      "speaker": "B",
      "text": "Those years of entrepreneurship, you aim to create something people want and when nothing is actually working, you're basically creating void. And nobody cares about what you do, nobody needs anything that you're doing. So it feels like you're just useless. It made me question why I was an entrepreneur. Why am I doing all that if I can just get, you know, a sense of like worthiness having a job. I started to have time for me on weekends because I didn't allow myself to take time off in the past. It made me prioritize other parts of my life that I haven't touched previously. From sleep, to reading books, to working out and the overall happiness, everything, like the burst I had previously, everything started to fade away and I started to feel much better. Six months after getting the job, lockdown started to disappear and my wife and I decided to go back to Bali. I started to feel this little desire of Freedom that I didn't crave previously because I had 100% freedom but 0% worthiness. But now the fact that I had to show up from Monday to Friday, within two months, I was already thinking, like, sometimes I don't want to do this meeting. I don't want to go there. I don't want to do that. And I was seeing some tweets from other software engineers who either got fired, who pursue their passion, whatever. And I see that there are some guys who have a totally different approach to entrepreneurship. They don't raise money, they don't work with a team. They do whatever they want. They build tiny projects, they make it fast. Maybe I want that.",
      "start": 657950,
      "end": 735310
    },
    {
      "speaker": "A",
      "text": "A little seed is planted in Mark's mind yet again that maybe he can actually do this. But he remembers all of the failures he's gone through. Plus he's got a great job and he's not ready to quit right away. Then one day he receives a phone call that would change his life.",
      "start": 735470,
      "end": 754840
    },
    {
      "speaker": "B",
      "text": "Around this time in Bali, like a couple months after we're here, I just received a call. They're like, hey, it was nice working with you. Bye. And so when I got fired, it was totally fine because I was already thinking of going back to the entrepreneurship world to get that sense for freedom fulfilled again. The moment I get fired, I build my new identity. I'm going to be an entrepreneur again. But these times, I'll do things differently. I will never spend months on a product. I will never raise money. I never have employees. I'll never do all the things that frustrated me in the past. I started to realize that each failure is not a failure if you don't give up. Each failure is a learning or a frustration for a future success. And unless I quit in the middle, all those failures will bring the success later. It's just making a matter of making small bets. Small bet here, small bet there, and maybe something will work out. I also decided to at the same time I build stuff. I'm going to try to share this publicly so that people can see it. So that if my app goes wrong, if nothing happens, then in the worst case, maybe I'll have created a little following that for the next project. Then I can use to get some some eyeballs and not starting again from zero.",
      "start": 755240,
      "end": 822760
    },
    {
      "speaker": "A",
      "text": "With a reignited passion and a new approach to entrepreneurship, Mark starts to ship.",
      "start": 822920,
      "end": 828680
    },
    {
      "speaker": "B",
      "text": "The first app I built is called Mood to Movie. It's basically an app that match your mood and recommend you movies based on how you feel. And then habits garden. It's Like a little habit tracker. I got around 10,000 users, which I was super proud of because it's like, also, like, it's helping people to get better in life. And I'm so happy. I worked on a tool that ranks productivity tips. I built a landing page generator. So you input some text and it's going to create an entire website for you with text, images and buttons. I created a link in bio tool for entrepreneurs where you can show your entrepreneur resume.",
      "start": 828760,
      "end": 863120
    },
    {
      "speaker": "A",
      "text": "Mark launched six projects in seven months, but he was still facing a big problem income. He was only making $1,000 a month, and he needed to figure out how to crack the code to make more money.",
      "start": 863520,
      "end": 878650
    },
    {
      "speaker": "B",
      "text": "I started to make painkiller apps where it's actually solving a problem. Like, I try to focus on that, and I also try to focus on apps that, that are not free, that, like, users at some point have a paywall. The fact that I was shipping painkillers means something. People know their struggle, they know their pain. So I come up with a solution. So it's much easier to sell than a vitamin. Where, like the habit tracker, for instance, where it's fun, but you don't necessarily need it. I tried to get a new approach of, like, launching viral. I would focus on the launch part, try to get as many ice balls as I can. And I started to make those, like, skits where I would go on a podcast with Joe Rogan or I would be on a movie with Leonardo DiCaprio. And this did really well. Like, people felt that I was having fun. And that's where my revenue went from like, around $1,000 per month to, I think it was around $4,000 in 2023. Mid 2023, I had built somewhere around 10 to 15 products, and I realized I was doing the same thing over. Set up a landing page, deploy it, add a button for people to pay, send them an email, create an account. I was like, what if I just create a little code base that I can reuse for every new project that I create? So whenever I have a new idea, I can make it faster, I can ship it faster. I did that. I built it, I think, in like, less than a week. And I was like, this is super cool. Why not just putting a price tag on it and offering it to other developers if they want to use it? But I removed expectations from anything that I would launch. I told my wife, like, hey, you know, maybe we'll make 100 bucks. That would be nice. I shipped the product, went skating, and I came back home, opened my dashboard My strap dashboard. Like, after two hours of skate, I was like, I made 500 bucks, which is what I would make in like a week on entrepreneurship before. In two hours, I was like, something is going wrong. Like, I really couldn't believe it. And then the next day, I had made somewhere like around 3 to 4000 US dollar and I was like, what the fuck is going on? Like, I would make my best monthly salary in one day. It's just insane. I think the first month, I made around US$40,000. The second month of November, for the Black Friday that day, I made seven, I think 8,000 US dollars. I was very surprised. It was steady around like $50,000 a month. Except in November where there was like a burst at 65. And I realized one thing is product market fit. When it hits is like, it's there. You can. You can feel it. I would receive messages from people that say, like, hey, I cannot pay using your credit cards. Do you accept crypto? Like, you would have people, like, ask me, like, to give me money. It's the first time ever. Usually I'm trying to convince people to give me money for my product. Felt so happy, I couldn't sleep at night. I was awake looking at emails, looking at the stripe dashboard going up. I don't know. It's a pure bliss feeling. It's just insane. And receiving those messages from people who's like, thank you. You changed my life for me. It was. I don't know if I can ever be happier than that. So the launch gave it an initial boost. I also did lots of free tools marketing. So I would build this logo generator, and then on the right side, you would a banner that says, like, are you building a startup? ShipItFast. With ShipFast? And there's obviously the YouTube episode that came a little bit later, added lots of revenue to the product chip fast. So it went from like $50,000 a month to somewhere around $85,000 on the first month, then 135 in the second month, 135 in the third month, and now it's slowing down a little bit to somewhere like around $80,000 a month. Okay. So I do believe there are multiple people living up there, and there is one that's very strong that always thinking is telling you stuff is overthinking. It's blocking you from making the first step. He's gonna find a good excuse for this idea to not work. It's gonna tell you that the idea you're working on is not perfect enough to be launched. So my Advice would be to it's cliche, but it's start anything. Start make the smallest version of your app as fast as you can. And the second part? Learn where you're comfortable sharing your ideas. If it's text, go on Twitter. If you're comfortable with videos, go on TikTok. If you're comfortable with images and you know how to tell beautiful stories with one image, go on Instagram and learn how to blend those two things together and see how things react. I failed 30 startups around that. But if you don't quit, then at some point you'll win. It's just a matter of not quitting before you win.",
      "start": 878810,
      "end": 1137770
    },
    {
      "speaker": "A",
      "text": "Start now and ship fast. That's Mark's formula for being a successful online entrepreneur. But here's the problem. When you're starting out and when you have an idea for something, you don't really know a whole lot about what to do. You don't know necessarily if the idea is good, you don't know how to validate it, and you don't know how to monetize it. Well, the best way to learn is to talk to people or study people who are a few steps ahead of you. That's what Starter Story is for. It's a library and community of inspiration, practical advice and stories that you can apply to your own business. To give you a sneak peek of what that looks like, I'm going to be giving you a free download of 50 plus solo developer ideas just like Mark's that will give you ideas and inspire you for your own thing. It'll give you a bunch of winning ideas, strategies and other cool information to help you go from 0 to 1. Just click the first link in the description and we'll send it to you for free. Also, if you're serious about building your business, come join Starter Story and we will help you do that. I really hope you guys enjoyed this. Underdog. I'll see you in the next one. Peace.",
      "start": 1138730,
      "end": 1202040
    }
  ]
}