{
  "source": "/home/salouri/Projects/starter_story/transcripts/zTKYJWAEl78/zTKYJWAEl78_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "This guy makes over $5 million a year running three different businesses. And the crazy part is he started from nothing. I flew out to Denver, Colorado to ask him exactly how he got started, how he runs all these businesses at the same time, and the marketing strategy he used to go from zero to two and a half million with his first business.",
      "start": 240,
      "end": 20720
    },
    {
      "speaker": "B",
      "text": "We generated and still generate a lot of our leads through.",
      "start": 20960,
      "end": 24000
    },
    {
      "speaker": "A",
      "text": "Tim started out as a solopreneur. He was all in on one business. But this business had a problem. The more it grew, the more hours he had to work every day. Then one day, he stumbles onto an opportunity that would change everything. He decided to become a multipreneur.",
      "start": 24560,
      "end": 44340
    },
    {
      "speaker": "B",
      "text": "The big goal is to build a portfolio of assets that essentially do all the hard work for me.",
      "start": 44420,
      "end": 50820
    },
    {
      "speaker": "A",
      "text": "In this video, Tim will share how he built a team to run his $5 million portfolio of businesses, how to find and close big clients, and the best business model to start.",
      "start": 50820,
      "end": 61400
    },
    {
      "speaker": "B",
      "text": "As a beginner, I still think it's the best business for somebody to start.",
      "start": 61400,
      "end": 65920
    },
    {
      "speaker": "A",
      "text": "I'm Pat Walls, and this is Starter Store.",
      "start": 66080,
      "end": 69440
    },
    {
      "speaker": "B",
      "text": "All right, Tim. What's up, buddy?",
      "start": 70800,
      "end": 72840
    },
    {
      "speaker": "C",
      "text": "Thank you for having me.",
      "start": 72840,
      "end": 73640
    },
    {
      "speaker": "B",
      "text": "Sure.",
      "start": 73640,
      "end": 73920
    },
    {
      "speaker": "C",
      "text": "Thanks for being here in your amazing house in Denver, Colorado. Tell me about who you are and everything you built.",
      "start": 73920,
      "end": 79080
    },
    {
      "speaker": "B",
      "text": "Great. Well, my name is Tim Stoddart. I own an SEO lead generation agency called Staadzi Internet Marketing. This year for Staadzi, we'll do probably like two and a half million, but on the side and more and more throughout the. I find myself running a personal holdings company. My guess is It'll be like 5.2 to 5 and a half million for 2024.",
      "start": 79080,
      "end": 100380
    },
    {
      "speaker": "C",
      "text": "Amazing. Can you break down each of the different businesses that you run within your holding company?",
      "start": 100380,
      "end": 104940
    },
    {
      "speaker": "B",
      "text": "Sure. Stase Internet marketing is the main driver of everything else that generates, like the cash and the revenue to make all the other stuff go subsequently to Staadze is Recovery Local. That's sort of the parent company that owns sobernation.com, yourfirsttep.com, detox local.com and medically assisted.com. then there's copyblogger.com so copyblogger teaches people how to write for the Internet, how to build newsletters, how to do SEO on websites, how to write on LinkedIn. So I've. I've built up equity in like five or six other companies over the last couple of years, but those three are the main ones.",
      "start": 105660,
      "end": 144250
    },
    {
      "speaker": "C",
      "text": "So you have all these different companies. What's the big goal? What's the strategy of running different multiple companies?",
      "start": 144490,
      "end": 149850
    },
    {
      "speaker": "B",
      "text": "Well, the Big goal is to build a portfolio of assets that essentially do all the hard work for me. I had a real like, click moment, like, oh, wow. I don't have to just work for a paycheck every week. I can use the money I make through Stasi, through my agency, reinvest it into cash flowing assets, and eventually build up a portfolio where the businesses, the company themselves just do the hard work for me. I just made up my mind to do it. I've been doing it ever since. Yeah.",
      "start": 150170,
      "end": 176950
    },
    {
      "speaker": "C",
      "text": "Can you give me a timeline of how you got started and how you got into the business of entrepreneurship?",
      "start": 176950,
      "end": 181790
    },
    {
      "speaker": "B",
      "text": "I grew up a blue collar kid. I built houses for most of my childhood. My dad worked at the airport and my mom was a nurse. And so I just thought I'd be working my whole life. Got in trouble a lot when I was younger and I had a bit of a drug problem. So the time came when I needed to change my life and I went to rehab and I got sober. About six months into that journey, a friend, basically a mentor, bought me a subscription to Success magazine, which had this CD in it. And it was this interview and it was this guy named Seth Godin. He said, start a blog, don't tell anybody about it, and write in it every day. And there was something about that message where I thought, like, you know what, I can do that. I don't know why it felt like it was a good direction for me, but I just, I knew I could do that. So I started a blog spot and I would just write random articles about like, my day and what I was feeling and experiences I had. And there was other people that might have been getting sober or might have been going through a journey of themselves, and they were saying, like, oh, I really relate to this, or like, I felt the same way. But I was wondering, how are these people finding my blog? Like, I didn't tell anybody about it. So I started researching and I discovered SEO, I discovered search, and then I would read Copy Blogger every day and just improve my skills of being an online writer. And yeah, eventually that blogspot account turned into Sober Nation, and that's how I got my start.",
      "start": 181790,
      "end": 258090
    },
    {
      "speaker": "C",
      "text": "Yeah, I love that you found this skill of writing, because actually writing was one of my skills that helped me build Starter Story. And what's amazing about Starter Story is there are thousands of case studies on founders who had some sort of skill like writing or coding or design that were able to take that one skill and turn it into a business that changed their lives. If you're looking to Take your skills and passions and turn it into an online business. You should check out our workshop that we're running where I share the story about how I turned my skills, which was actually writing, into a million dollar business. How I found that business idea, how I executed on that and built that business on two hours a day while I had a full time job. If you're curious about learning more about that, you can find the first link in the description and save a seat for yourself. See you there. All right, so you got this blog. People are reading your blog, they're commenting. How do you turn this into a business?",
      "start": 258250,
      "end": 303590
    },
    {
      "speaker": "B",
      "text": "All of a sudden with sober nation treatment centers and behavioral healthcare centers were reaching out to me saying like, how did you build this community? How did you build this? And so we took the traffic that was coming from Server Nation and almost turned it into like a lead generation media outlet. I remember got my first client, it was 2,000 bucks a month. And we just kept doing it and doing it and doing it and it's scaled ever since.",
      "start": 303910,
      "end": 324450
    },
    {
      "speaker": "C",
      "text": "Give me a little bit more of a breakdown about how you built it. So you had your first client, Then what did you do from there?",
      "start": 324530,
      "end": 329410
    },
    {
      "speaker": "B",
      "text": "We generated and still generate a lot of our leads through SEO. It was one keyword in particular that I ranked for. It was just drug rehab marketing. And then we started ranking for drug rehab, SEO, drug rehab, lead generation. So if there's like one message that somebody can get from me, it's that you don't have to build this giant media entity. Like you can tackle it one keyword, one article at a time. The trick is to be methodical about it. That's why I hate the advice like, just make great stuff. Just be yourself. It's just being yourself is like terrible SEO advice. What you want to do is you want to know what people are searching for. You can figure that out just by going to trends.google.com, type in a bunch of keywords, see what keywords are available, and then write an article that best solves the particular problem that that person has. I always think of Google as a problem solving machine. You never go to Google for anything else other than to solve a problem. And so if you can write an article that best solves that person's problem, you can generate leads and then all of a sudden you can build a business. Yeah.",
      "start": 329410,
      "end": 391380
    },
    {
      "speaker": "C",
      "text": "Can you tell me the pros and cons of building and running this agency?",
      "start": 391380,
      "end": 394980
    },
    {
      "speaker": "B",
      "text": "Agencies are great because there's no real upstart capital. You don't have to build anything. You Just need to get a client and then all of a sudden you're a profitable business. They're hard because they're difficult to scale. So like every new client you bring in, you know, you have to do more work. You have to onboard them. You know, every like two or three or four clients, however many you got to hire another employee. Right. But nonetheless, I still think it's the best business for somebody to start because you just need a client. Once you get your first client, all of a sudden you have a profitable business. So, yeah.",
      "start": 394980,
      "end": 423630
    },
    {
      "speaker": "C",
      "text": "Let's talk about sales and closing deals. Do you have any tips on negotiation and how to close a deal?",
      "start": 423630,
      "end": 428630
    },
    {
      "speaker": "B",
      "text": "There's only a couple of things you need to know about closing deals. One is learn how to ask questions so that the person tells you their pain points. You want the person to tell you their problems. When that's happening, I just write down what the person says, I write down the problem and I respond with a solution to that problem. The second most important thing is to get like the, the price out of the way in the very beginning. Because what always happens, you go through this whole pitch and then people say, okay, I'll call you back. Let me think about it. And that's the worst thing that can happen. So I always started conversation by saying like, hey, look, just do me a favor and let me know if you're serious about this. That way you get like a commitment and you actually get the deal closed. And then the last and absolutely most important thing is ask for the deal. Here's my line for this is the best line. It's are you ready to get started? That's all you got to say. You say, are you ready to get started? And the trick is you shut up. And so what I do is I say, are you ready to get started? And then I mute my phone and I put it in front of me and I just sit there. And that's why you close the deal.",
      "start": 428780,
      "end": 485960
    },
    {
      "speaker": "C",
      "text": "So you build this agency, it's profitable, it's generating cash, then you start buying businesses. Can you tell me more about what that looked like?",
      "start": 486530,
      "end": 493250
    },
    {
      "speaker": "B",
      "text": "The first one was a company called Moving Local. Again, like a lead generation site. People buy moving leads a lot. I built another one called Stem Cell Authority, which was lead generation for the stem cell industry. I've recently invested in a company called Cuppa, which is an AI content creation tool. It's mainly for SEO. As an SEO tool, I was one of the founding investors in a company called Sparkloop. It's a way for people to build their Email list. It works with Beehive and It works with ConvertKit. There's a website called Your Boulder which I bought, which is a newsletter that goes out to the people of Boulder, Colorado. There's another SEO agency called Digital Commerce. We saw a big opportunity to do SEO for people that want to build email lists and sell digital products or sell courses or sell ebooks or subscriptions with whatever the case may be. So we have another agency. And then most recently I just invested in a company called hey Creator. So hey Creator is kind of like a creator studio you could call it, of people that are all trying to build these creator driven businesses. And then of course I bought Copy Blogger. That's going really well. But I'm still running Recovery Local and I'm still running my agency. That's really where I spend most of my time.",
      "start": 493250,
      "end": 565270
    },
    {
      "speaker": "C",
      "text": "So you're running and have equity in multiple companies at the same time. What are some of the pros and cons of running multiple companies?",
      "start": 565270,
      "end": 571830
    },
    {
      "speaker": "B",
      "text": "Well, the cons is more mental. Sometimes I think about how much more simple my life would be if I just had one thing to focus on and I didn't have to keep track of so much stuff in my mind. The pros are that I love hearing new ideas, I love researching new opportunities. And so that keeps me really engaged. And I really think that investing in private businesses, especially investing in cash flowing businesses, that's just a great way to make sure your money keeps growing on itself and growing on itself.",
      "start": 572070,
      "end": 600170
    },
    {
      "speaker": "C",
      "text": "All right, let's talk about tools and software that you run multiple businesses on. What are your favorite ones?",
      "start": 600400,
      "end": 605520
    },
    {
      "speaker": "B",
      "text": "Well, slack is a must. It's just a great communication tool. Especially now that we're all over the country underutilized. Is loom like loom is the best. You can just get your idea out one time and people don't have to stop what they're doing to know what it is that you need to tell them. Todoist is great. For me, it's the simplest task management tool. But I write down all the tasks that I need to assign, I record the videos and then I assign them on todoist and then that's it. The rest of the day takes care of itself. Although it's the most expensive, HubSpot in my opinion is definitely the best CRM. It makes it easy to keep track of your leads, to keep track of your network and then click up. I think if you're running a real established agency, Todoist isn't going to be enough. It's just not robust enough. And so Todoist is really where I manage my personal holdings company, but ClickUp is where Stadze runs. That's like our real task management software. So Slack, Todoist, Loom, HubSpot and ClickUp. And then of course, Google Drive. Like sometimes we laugh that basically every tool that anybody makes is just like a modified version of Google Sheets and Google Docs. And so like, yeah, Google Drive is a must.",
      "start": 606080,
      "end": 677890
    },
    {
      "speaker": "C",
      "text": "So your goal is to build these self sustaining businesses and now you have a team. How was it going from just a solopreneur to building a team?",
      "start": 677890,
      "end": 685890
    },
    {
      "speaker": "B",
      "text": "I had access to a lot of young people that were just getting into recovery. I hired them like straight out of halfway houses. And we've all built this together over the last 10 years. So in terms of managing a team, read the E Myth revisited. That book changed my life. I just realized that I am in the way of everything. I am literally the biggest problem in the company and. And the best thing I can do for the company is document processes, be organized about it, teach, and then get the hell out of the way because I don't do anything except mess things up when I get in the middle of it. So read the E Myth and read it again and then read it a third time and take notes on it and just do everything that book says and you'll be fine. Yeah.",
      "start": 685890,
      "end": 724170
    },
    {
      "speaker": "C",
      "text": "So you've invested in tons of businesses and you built tons of businesses. How do you approach finding great business ideas and knowing when to invest and when to not invest in a company?",
      "start": 724170,
      "end": 733420
    },
    {
      "speaker": "B",
      "text": "There's only three things that I really care about. One, do I like the founder? Because if I don't like the person, it doesn't matter how great the idea is. Like, life is too short to deal with people that you don't like. Two, is it cash flowing? I personally am not interested in betting on a thousand companies and hoping that like, one of them turns into Facebook. I want to build a portfolio of assets and then the third one, this is just for me personally, is, is it like evergreen? I want to find something that's going to be around forever. Right. That's why healthcare is appealing to me. Because people are always going to need to take care of themselves. So that's it. Like, is the founder cool? Does it cash flow and is it evergreen? And if it meets those criteria, I'll take it seriously.",
      "start": 733580,
      "end": 771190
    },
    {
      "speaker": "C",
      "text": "All right, let's talk about what a day in the life looks like for you. What are you doing these days?",
      "start": 771270,
      "end": 774950
    },
    {
      "speaker": "B",
      "text": "All my days look exactly the same. I've always woken up very early so I'm usually up at like 4, chug some water, I get a cup of coffee, I sit on my computer, I record my assignments for the day. By that time, my kids usually wake up, I play with them, I take my to school around 8 and then my wife and I go to the gym. I'm in the gym every day from 8:30 to 10. Come back, I eat and then I work. The afternoon is usually deal making. So the mornings for me is like logistics and task assignment and the afternoon is deal making. So I follow up with my leads, make phone calls, I write proposals, I write contracts. If I close a deal, I do all the onboarding. And then my kids get home at like 5. We hang out down here and we play and we eat dinner and I watch fucking Drew Detective. Like I do the same thing every day. Every day. My life is super boring.",
      "start": 775030,
      "end": 821470
    },
    {
      "speaker": "C",
      "text": "Throughout your journey building businesses, you've been doing this for a while now. What have been some of the struggles or have there anything that's been hard in your journey?",
      "start": 822990,
      "end": 830390
    },
    {
      "speaker": "B",
      "text": "The hardest part about being an entrepreneur is that I worry all the time. Most of my time is just spent, like, what's about to go wrong? What's a fire that's about to happen? Like, where can I see something coming so that I'm not blindsided and my life doesn't fall to pieces because of some problem that I couldn't control? So like, yeah, I worry a lot. Every morning as soon as I wake up, I'm thinking like, what's wrong, what's wrong, what's wrong? It's just, it's really difficult to make that go away. Yeah.",
      "start": 830390,
      "end": 855030
    },
    {
      "speaker": "C",
      "text": "If you could sit on the shoulder of yourself when you're just getting started, just getting started with that blog, what would be your advice to young Tim?",
      "start": 855030,
      "end": 861750
    },
    {
      "speaker": "B",
      "text": "When I was getting sober, basically the fear is always, how am I ever gonna have fun for the rest of my life? Or like, what am I gonna do when I'm at a wedding? And then somebody told me, all you ever have to do is get through the day. So you make it till midnight. And then what do you do when midnight comes? You just make it to midnight again and like, it never ever ends. The solution to every problem in my life is always like, I'm just going to get through the day. I'm just going to make it till midnight. So I really, really, truly live my life like one day at a time. I don't think too far into the future. I have no idea what's coming next. I just, I make it till midnight. One day at a time.",
      "start": 861990,
      "end": 896900
    },
    {
      "speaker": "C",
      "text": "That's great advice.",
      "start": 897130,
      "end": 897850
    },
    {
      "speaker": "B",
      "text": "Thanks.",
      "start": 898010,
      "end": 898490
    },
    {
      "speaker": "A",
      "text": "Thank you.",
      "start": 898650,
      "end": 899210
    },
    {
      "speaker": "C",
      "text": "Thank you for having us. Of course. Follow this advice and you will have five companies making $5 million a year.",
      "start": 899770,
      "end": 905770
    },
    {
      "speaker": "A",
      "text": "Hey guys, I hope you enjoyed the breakdown of all of Tim's businesses. It's amazing story, right? If you want to do something similar but you're struggling to find the right idea or the time to build it. Well, I have something that might help you. I'm hosting a free workshop this week to show you exactly how I validated my own million dollar business and then exactly how I built that business on just two hours a day while I had a full time job. Because I know from personal experience there's nothing worse than wanting to start a business but not feeling 100% confident that you're on the right track. So if you're interested, click the first link in the description to save your seat and I'll see you in there. Otherwise, see you in the next video. Peace.",
      "start": 905770,
      "end": 944130
    }
  ]
}