{
  "source": "/home/salouri/Projects/starter_story/transcripts/ZEIPj7QbZeI/ZEIPj7QbZeI_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "All right, Guillaume, what's your story?",
      "start": 160,
      "end": 2000
    },
    {
      "speaker": "B",
      "text": "I come from a background with, like, literally zero money going, like, from shitty job to shitty job, and I had only, like, $1,000 left. It was like, all my savings at that time. I just felt okay, like, I need to be my own boss.",
      "start": 3680,
      "end": 16640
    },
    {
      "speaker": "A",
      "text": "This is Guillaume Mubesh, a guy who set out on a mission to become an entrepreneur and make millions online.",
      "start": 16800,
      "end": 24160
    },
    {
      "speaker": "B",
      "text": "I've been at it for now, like, if you combine all experiences, close to 10 years.",
      "start": 24560,
      "end": 28320
    },
    {
      "speaker": "A",
      "text": "And in the beginning, things were tough.",
      "start": 28680,
      "end": 31800
    },
    {
      "speaker": "B",
      "text": "After launching the project, creating the whole website and putting it online, it was a massive fail. But I didn't give up. I think deep inside I had a voice that wanted to prove everyone wrong.",
      "start": 32040,
      "end": 43880
    },
    {
      "speaker": "A",
      "text": "After years of failure, Guillaume finally came across an idea that would make his dreams come true.",
      "start": 43960,
      "end": 50760
    },
    {
      "speaker": "B",
      "text": "There is no way to describe how it feels when you have a true product market fit. It's like poetry. It's like magic. Everything you do works. You're in a state of bliss. You feel like a superhero, and you feel like nothing can destroy you. Until half of our customers were just saying, like, what the fuck? They were like, public messages on the community. Like, yesterday, I love Lemlist. Today I fucking hate it. It was the month where we went from 40% month over month growth rate to 0%. So that was really hard. And it was very intense for me. Like, I pushed myself close to the limits.",
      "start": 50920,
      "end": 91840
    },
    {
      "speaker": "A",
      "text": "This is the story of how Guillaume Mubesh went from his last $1,000 to a company valued at over $150 million in just four years. Welcome to the underdog.",
      "start": 92160,
      "end": 104800
    },
    {
      "speaker": "B",
      "text": "I grew up in Paris. Two of my parents are not entrepreneurs. Like, they grew up on a farm in the southwest of France. They never had, like, a lot of money, so they sacrificed quite a lot so we could get a good education. After high school, I went to, like, a university. I needed to work on the side so I could pay for life. I was going, like, from shitty job to shitty job. And I applied, like, to the McDonald's where all my friends, you know, like, got accepted and they declined. And at that time, I really, really, like, felt like, you know, like, everyone can work at McDonald's and not you. You really, like, the worst shit ever. You're doing, like, a uni where you don't even know if you're gonna get a job afterwards. So you start, like, questioning everything.",
      "start": 112730,
      "end": 159270
    },
    {
      "speaker": "A",
      "text": "After struggling to land basic jobs during university, Guillaume realized that the usual path from school to a 9 to 5 job was. Wasn't for him. So he starts looking for something better.",
      "start": 159750,
      "end": 171270
    },
    {
      "speaker": "B",
      "text": "At that time, I just felt okay, like, I need to be my own boss. I need to live following the rules. I want to establish. I don't want to have someone, you know, who tells me what to do. Working in a, like, normal company. I feel like your creativity is often very, like, limited. And I've always been someone creative. I've always felt like I don't belong in a specific category. So I just felt like launching a company was the coolest thing to do. And I've also loved money, to be honest, I've always loved money. I've seen how people, you know, have been treated my dad because he didn't have enough money. And I think it's like a great tool that can be used, you know, to also do, like, good things with it. I just decided to grind hard and make this thing work. So I switched to do a master in marketing. During that master, I just thought that I could give back to my dad by launching a business with him because I felt like, okay, now that I know marketing, I'm going to be super rich and make money online. I was just thinking, let's do like, T shirt business. It doesn't require a lot of money and you don't have money, so it's perfect. You know how to print on fabric and I know how to sell.",
      "start": 171750,
      "end": 239930
    },
    {
      "speaker": "A",
      "text": "With his master's in marketing, Guillaume is convinced that his T shirt business is how he's going to give back to his dad and make it big, big. He's finally ready to leave the minimum wage jobs behind and become a successful entrepreneur. And after months of blood, sweat and tears, everything was ready.",
      "start": 240090,
      "end": 258020
    },
    {
      "speaker": "B",
      "text": "After launching the project, creating the whole website and putting it online, it was a massive fail. We only sold like six T shirts. And my plan, which seemed to be perfect, which was build a community, create a website, sell the T shirt to the community, have tons of word of mouth and become super famous. Was totally crushed. My dad was disappointed because the business was not going, you know, as planned. And I feel like I was ashamed. I couldn't really, like, help him out, you know. I was also mad at first at my dad because we couldn't invest more money. But in reality, it was my own fault. I was mad at him, but the version of me that was mad at him was a version that was also mad at myself. And I didn't really realize it after that, you know, like we did. We didn't talk for almost like a year and a half. So that was really hard. Especially because my parents, you know, like, they love you a Lot you need to do like family stuff, like on Sunday. It's very important. And the fact that we didn't really talk, it meant also that I kind of like put my hand down and I was saying like, I'm busy with work, busy with work. And that became kind of like my go to excuse.",
      "start": 258180,
      "end": 330520
    },
    {
      "speaker": "A",
      "text": "Guillaume realizes that making millions online isn't as easy as it seems. His dream of becoming an entrepreneur led to a ruined relationship with his family. But he isn't the one to give up this easily. So he starts looking for his next venture.",
      "start": 331160,
      "end": 348670
    },
    {
      "speaker": "B",
      "text": "One of my friend who was launching a lead generation agency, he asked me like, hey, I saw you were grinding on your project, so maybe you want to join forces and help me out. At that time I did not know what the lead generation agency was. So I was like, okay, what it is? And it's like, okay, basically I'm helping like businesses find their dream customers. So I was like, okay, that's intriguing. Let me know like how you do it. So this is when I really started getting into like growth hacking, marketing and sales prospecting. So I did that for about a year. I close customers all over the world and I really became like an expert at sales prospecting because I was booking meetings for tens of different companies in different industries. I was kind of a mad scientist, testing like tons of different approaches. After sometimes I was like, okay, I don't want to do like a Legion agency. Like, I'd rather have like my own software because I think as an engineer I love to have like something that was scalable.",
      "start": 348910,
      "end": 404180
    },
    {
      "speaker": "A",
      "text": "Guillaume was craving more than just an agency business. His ambitions were much larger. He wanted to build the next billion dollar startup and make a bunch of money doing it. So he left the agency and after long nights of searching, he found his next idea.",
      "start": 404340,
      "end": 421980
    },
    {
      "speaker": "B",
      "text": "I saw that whenever someone visits your LinkedIn profile, you can see who that person is. So at that time I was like, okay, that's crazy because it means that you can basically do the same on any website. I really thought it was going to change the Internet, to be honest. My ambition was to personalize the Internet. I went to Russia where I had hired a few developers. I didn't have a lot of money, so the developer I had hired, they were kind of like junior. I think in total I have paid maybe like 4 or 5000 back in the days. It was like all my savings. But eventually like LinkedIn changed one line of code, so the entire project went to trash. And then I was like, oh, fuck it.",
      "start": 422300,
      "end": 468850
    },
    {
      "speaker": "A",
      "text": "After moving to Russia, spending all of his Savings. And having his dream idea crushed by one line of code, Guillaume went back home to France to look for another idea, but this time with no money in his bank account.",
      "start": 469010,
      "end": 484940
    },
    {
      "speaker": "B",
      "text": "I had only, like $1,000 left, and I didn't want to go work on, like, shitty jobs like I did for, I don't know, six or seven years to pay, like, for everything else. My girlfriend, I remember she was paying the rent. She didn't believe in me anymore. Like, she was asking me, like, to take a job. My friends, you know, like, they would ask me, you know, like, to go to the restaurant, and I would lie. I would say, like, that I was busy, that I already had plans. The plans was basically like me cooking pasta for myself because it's cheap. You know, everyone is thinking, like, why are you doing this? You have degrees. Just take a job and you'll see later if you can become an entrepreneur. But I don't know why. I think deep inside I had a voice that wanted to prove everyone wrong. You know, we talk a lot about Blue Ocean and Red Ocean. So I started with, like, this Blue Ocean idea because no one went on it. I thought I had, like, an incredible tech that was going to change the world. In the end, it was, like, too complex and it didn't work out. We got blocked, et cetera. So now I was like, okay, Red Ocean, we have tons of competitors, but if we have competitors, it means that there is always a product market fit. These guys are making shit, tons of money. So all you have to do is to be better. So instead of doing the same as all the platforms, I started focusing, you know, with Lemlist, with a key differentiator that was how to make sales more human and how to add extra layers on personalization that no other platform could offer. So even though at first I knew all the features that our competitors had were 100 times better than ours, I focused on something that was really tied to a key problem from our ideal customer profile, but also that was tied to a real return on investment for them, which is how many meetings can they book. If you can tie any of your software or product or service to the revenue people are going to make, your product becomes associated with success.",
      "start": 485260,
      "end": 602230
    },
    {
      "speaker": "A",
      "text": "This is Guillaume's aha moment. He realizes that a good business idea is simply taking a proven idea and just making it better. If you're looking for a similar idea, then just do what Guillaume did. Research proven businesses that are making money right now. And you can start doing that by checking out our 52 micro SaaS ideas. Deep dive in this database you'll get 52 proven micro SaaS businesses, how much money they make, how they found their idea, how they got customers, and tons of other details you'd want to know. Just click the first link in the description and we'll send it to you over for free. Now back to the story. With $1,000 to his name and the right idea in mind, Guillaume got down to building. And this time he was doing it fast.",
      "start": 602790,
      "end": 651120
    },
    {
      "speaker": "B",
      "text": "Our first MVP. It was just two weeks of work. I closed basically the first 100 customers doing live demos and outbound. I did only this on top of it, the first customers I was onboarding, I would tell them, you know what, like buy the software subscription and I will myself write the campaigns for you. And in exchange I would also ask them if they want to be part of the content I create as success stories. An unfair advantage I would say that you can have when you launch a company is if you're among the target audience of what you're building. Because if you're using your product daily and you're using it so much that it drives you crazy to see all these bugs and the fucked up things happening, because this is software and that happens a lot in the beginning, then I can guarantee that the pace at which you improve the product is a hundred times better. And the growth group for me was simple. It's like I use my own products, I help people with their campaigns, I create like the best content ever. I push the content into a community. From there I get insights from people who complain about sports, specific things. I improve the product, I restart using the product, but with the improvements, making success stories about it with new templates, etc. And so on and so forth. And this is a growth loop we've used to really like skyrocket.",
      "start": 651600,
      "end": 723630
    },
    {
      "speaker": "A",
      "text": "The growth Leml made 600 in its first month and was growing 40% month over month. Guillaume thought he finally cracked the code to building a successful business until he looked closer and noticed something was off.",
      "start": 723630,
      "end": 738680
    },
    {
      "speaker": "B",
      "text": "I was like, we can't have such a low activation rate. So the activation rate for me was when someone sign up, whether or not do they launch a campaign. And that conversion rate, I think it was like at 15%. So I decided to change entirely the product. I redone like all the wireframes we restarted from scratch. When we put it live, half of our customers were just saying like, what the fuck? They were like public messages on the community. Like yesterday, I love Lemlist, today I fucking hate it. And at the time I was like, holy Shit, like, what do you do? Do you revert? Or do you wait and see whether or not it's gonna give you, like, a higher activation rate?",
      "start": 739000,
      "end": 778530
    },
    {
      "speaker": "A",
      "text": "Guillaume was starting to have doubts about his decision to change the business overnight. And with his inbox flooded with angry customers, he was starting to get scared. But instead of backing down, he decides to handle the problem head on.",
      "start": 778530,
      "end": 793210
    },
    {
      "speaker": "B",
      "text": "I took all the users, you know, who were like, unhappy. I asked them to come directly, like on Zoom calls. I started working until like 4am So I had chat with everyone to understand what they were lacking. I saw that we had removed stuff that we shouldn't have been removed. So we fixed like a lot the product during that time. It was the months where we went from 40% month over month grant growth rate to 0%. But at the end of the month, our activation rate was at like 35 instead of 15. So the next month we grew, I think this time by like 60 because all the unhappy people wanted to turn churns. But eventually, like the new one converted at a much higher pace.",
      "start": 793450,
      "end": 833400
    },
    {
      "speaker": "A",
      "text": "After winning a risky bet to change the business completely, Guillaume and the team were starting to see the results pay off big time.",
      "start": 833560,
      "end": 840850
    },
    {
      "speaker": "B",
      "text": "I think it took us one year to go from 0 to $250,000 ARR annual recurring revenue. Year two, it was, we reached 1 million. Year three, we were like at 8ish. And then three and a half years, we're at 10. When you go from 1 to 10 in, let's say a year and a half, it means that you're growing anywhere between 15 to 25% month over month, every month, you're like, it's not possible that it's going to happen. But after like six, seven, eight months of happening all the time, it becomes like the norm for you. There is no way to describe how it feels when you have a true product market fit. It's like poetry. It's like magic. Everything you do works. You're in a state of flow where everything is so easy that you feel like you've understood everything about life, that it was a game all along. And you know, you're in a state of bliss. You feel like a superhero and you feel like nothing can destroy you until you reach a plateau. And this is where you realize, or at least this is where I realized that I hadn't been a great entrepreneur. I learned like, the biggest lesson, I think, of growing a company. Growing a company is never an exponential curve. It's always an S curve that can look like an exponential curve, but there is always a plateau. And the only companies that have like a proper exponential curve are the one who are planning for the next S curve.",
      "start": 840930,
      "end": 934250
    },
    {
      "speaker": "A",
      "text": "After a rapid growth period, Lemlis plateaued at around $10 million ARR. On top of that, Guillaume was now on his own after two of his co founders exited the company.",
      "start": 934410,
      "end": 946090
    },
    {
      "speaker": "B",
      "text": "When your co founder lives, it's definitely weird because, you know, you trusted people for a long time and now I had to handle like all the technical side of things, which is definitely like not my job. I started having like tech support, product sales, marketing, having to manage basically like all of it. So that was really hard and it was very intense for me. Like I pushed myself close to the limits. It's. It's hard, you know, when you have like this thing happening and you feel really like on your own.",
      "start": 946570,
      "end": 976900
    },
    {
      "speaker": "A",
      "text": "Guillaume was now by himself and faced with an overwhelming amount of new challenges. But he still believed Lemless could be more and he wasn't going to abandon it. After getting this far with his back against the wall, he was left with one choice. To make things work, rebuild the company from scratch.",
      "start": 977060,
      "end": 998100
    },
    {
      "speaker": "B",
      "text": "So we had coded the product really quickly to ship a lot of features, and then you realize that the way it's been developed doesn't match the amount of users you have and the scale. So we had to rebuild entirely our architecture. And I think it took me like a year and a half to deal with all the technical shits and then be sure that I would become irrelevant to the growth of the business. That was intense.",
      "start": 998420,
      "end": 1023570
    },
    {
      "speaker": "A",
      "text": "Guillaume spent a year and a half rebuilding the company and trying to get through that plateau. Then he finally came across a strategy that would change the business forever.",
      "start": 1024760,
      "end": 1035240
    },
    {
      "speaker": "B",
      "text": "When you're doing like a software as a service business, the name of the game is your retention, meaning how long do people stay when they start paying your service? So we spent a lot of time looking at, okay, who are the people who, when they join Lemlist, they never churn. I called it like the magnet Persona. The magnet Persona is a Persona that's going to attract a lot more customers. And if you take for example Apple, their only focus for years was designers. And why designers are a great Persona. Because designers are cool. So if you have a product that makes people feel like they are amongst this magnet Persona, then it's awesome. And for us in our space, the magnet Persona, it's really the sales rep. It's the sales reps because we're a tool that drives more revenue and who drives revenue in a company sales. So for us to have like this magnet Persona was just like game changer because in people's mind we became like the sales tools for sales teams. So anyone who has a company who wants to drive more sales know that they use, they should use them as the magnet Persona.",
      "start": 1035240,
      "end": 1103560
    },
    {
      "speaker": "A",
      "text": "Strategy allowed Lemlist to break through the plateau. But more importantly, it turned Guillaume into the successful entrepreneur he had always dreamed of becoming.",
      "start": 1103560,
      "end": 1113520
    },
    {
      "speaker": "B",
      "text": "Yeah, so right now we're at 30 million dollar ARR and 10 million dollars in EBITDA. We're about like a hundred people. We have customers in more than 100 countries. For me, when I reached that state, it was weird because I don't like fancy watches, I'm a terrible driver. My holiday, it's like going in the mountain and put my tents, be in the nature. I just felt like money would open so many new doors, it would be different, etc. And then you realize like you should focus more on the substance, like who you become, will you help your values? And that's I think when the relationship also changed with my parents because even though I didn't grow up with, with money, like they taught me, like things that are so much more important, they taught me about hard work, respect, being a good person in, in this world. I owe them a lot. And when you know, like you help them financially and they realize that they don't have to work, they don't have to worry and that everything is under control. I think this is the best feeling in the world, to be honest right now. You know, we are discussing it live on a video, but the reality is like it's been, I've been at it for now, like if we combine all experiences close to 10 years, so it's an overnight success story that took 10 years for me. It's like you got to be patient with the results, but you got to be impatient with your action. Put yourself out there, do as much thing as possible. Don't be afraid to document. Never give up, believe in yourself and always invest in yourself. Whether it's a new job, a new experience, a conference you want to go to, an event you need to attend, a webinar, a video or whatever. Always optimize it for the learning you're going to get. Because the outcome, you will never control it. And the only thing you can control is how you work on yourself. So if you work on yourself harder than you work on anything else, I can guarantee that in this life, especially right now with distraction we have, with social media, etc. I can guarantee that you will have success. Think of the journey, think of the adventure. Because it's all worth it when you tell it 10 years later.",
      "start": 1116640,
      "end": 1252040
    },
    {
      "speaker": "A",
      "text": "Take action, invest in yourself and enjoy the journey. That's Guillaume's formula for winning as an entrepreneur. The truth is, your idea will never be perfect, your skills will never be perfect, and the moment will never be perfect. You just have to start. Because if you don't start, then all the dreams you have in your head will have a 0% chance of coming to life. I hope you guys are all inspired after watching Guillaume's story. And I hope it's enough for you to just take one step of action today. And if you're ready to take that first step today, then you should definitely do that with the Starter Story Academy, our program to help you find an idea, validate that idea, and launch it into the real world. But first, I'd love to show you some examples of really cool SaaS, businesses like Guillaume, started by regular people just like you making over $10,000 a month. Just head to the first link in the description and we're going to send over our free deep dive of 52 different micro SaaS business ideas that are making money today. Today, this is the type of stuff that gets built in the Academy, and I want to see you do something similar. Thanks for watching and I'll see you in the next one. Peace.",
      "start": 1253640,
      "end": 1319370
    }
  ]
}