{
  "source": "/home/salouri/Projects/starter_story/transcripts/WuzxmeUP6ro/WuzxmeUP6ro_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "I just spent 6 days working on it, creating like a small MVP, and now we are close to 37k of monthly working revenue.",
      "start": 80,
      "end": 7760
    },
    {
      "speaker": "B",
      "text": "How does this Guy make over $400,000 a year with an app he built in just six days? Well, turns out he really knows how to find customers.",
      "start": 7760,
      "end": 17040
    },
    {
      "speaker": "A",
      "text": "Obviously there is, which is always a big one for these kind of products. I was able to get quite a lot of users pretty fast thanks to this.",
      "start": 17120,
      "end": 23920
    },
    {
      "speaker": "B",
      "text": "Julian Nahum started his journey while working a 9 to 5 as a software engineer.",
      "start": 23920,
      "end": 28400
    },
    {
      "speaker": "A",
      "text": "I was commuting three hours per day. I was spending all of this commute time on my computer working on the side projects.",
      "start": 28650,
      "end": 34170
    },
    {
      "speaker": "B",
      "text": "After years of experimenting with different side projects, Julian finally found an idea that worked. And now he's a solopreneur making a doctor's salary while working on multiple passion projects. So I gave Julian a call to ask him exactly how he did it and how anyone else can do something similar. Luckily, he shared a ton of good stuff. How to find and validate ideas, the best places to market a new product, and the viral loop strategy that got Julian to over $400,000 a year. All right, let's get into it. I'm Pat Walls and this is Starter Story. All right, welcome, Julian. It's nice to have you. Tell me a little about who you are and what you built.",
      "start": 34410,
      "end": 76750
    },
    {
      "speaker": "A",
      "text": "Okay. I'm Julian, I'm 28. I'm the founder of NotForms, which is a form builder for Notion users. We have close to 100k registered users and now we are close to 37k of monthly working revenue.",
      "start": 76750,
      "end": 90600
    },
    {
      "speaker": "B",
      "text": "Got it. Can you tell us a little bit more about the story of how you found the idea for Note forms?",
      "start": 90760,
      "end": 95280
    },
    {
      "speaker": "A",
      "text": "Yeah, definitely. I was a Notion user for maybe two or three years. I really loved the product and one day Notion finally released their API, which meant that anyone could build integrations and product around Notion. And I just decided to copy a feature that another database like product named airtable had, which were forms. So, you know, I just spent six days working on it, creating like a small mvp. Timing was important and it really helped growing the project. It's fine to start small. As soon as you get some users and some feedback, you're able to iterate much faster and to focus on the core value of whatever you're building.",
      "start": 95280,
      "end": 133070
    },
    {
      "speaker": "B",
      "text": "So you built your SaaS around an already existing platform, Notion. Why do you like this approach better than doing a traditional standalone SaaS?",
      "start": 133630,
      "end": 141630
    },
    {
      "speaker": "A",
      "text": "Building around the platform is easier. You don't have to build the community around it. You can kind of cannibalize part of it and try to solve a sub issue, which is kind of what I did with nodeforms. Right. Notion already had a huge community. People were really fond of the products. They had like a huge subreddit, tons of Facebook group. Of course, it comes with its own set of issues. You have the platform risk, but I think finding this kind of platforms, it's really a good way to. To start.",
      "start": 142830,
      "end": 169720
    },
    {
      "speaker": "B",
      "text": "Okay, so you've already built a couple profitable projects. Now, are there any other methods you have to finding winning ideas?",
      "start": 170200,
      "end": 177400
    },
    {
      "speaker": "A",
      "text": "Yeah, I think the easiest way to find ideas is try to solve your own problems. If you're your own user, then it's definitely easier to build a great product. If you use it, you get to see the flaws and the issues and improve on them. The drawback of this is that sometimes you can have a problem and think it's great to build a tool for this, but then you realize you're the only person with that problem. And because of that, I think it's important to ship fast and try and put it in front of other people to get some feedback early. Other ways to get some ideas, I guess, is just to be curious, talk to people. For instance, I really love, you know, talking with my friends that have totally different career paths and talk about, like, the way they work, their process, their daily lives. And it's always amazing to me with a technical background to hear that, you know, sometimes they spend one to three hours every day doing something that could easily be automated. Also, being on social media like Twitter, I think is really a great way. You hear about new tech, you hear about new opportunities, you discover new things that later you can apply to new problems. I think that's also a great way.",
      "start": 177800,
      "end": 238030
    },
    {
      "speaker": "B",
      "text": "All right, so once you have an idea in mind, what's your process for validating the idea and know that it's something that's actually worth building.",
      "start": 238270,
      "end": 246590
    },
    {
      "speaker": "A",
      "text": "Yeah, so my way of doing things is just to actually build a product, or at least an MVP for it, and then share it to as many people as I can and get instantly some feedback from the users. Focusing on a project for a small, short amount of time really helps you get a sense of whether this is valuable or not. Of course, it's hard to apply to many projects. You know, like, there are things that you cannot just build in one week. As I'm a solopreneur, you know, like, I try to avoid this and focus on things that I can build by myself and quickly. The more you build, I think the faster it is to build now, you know, like every time I. I'm starting a new project, I can just copy the code base from the previous project, keep all the UI and that kind of things, and I can just focus on the core logic and the value that I want to bring to the users so you get faster every time.",
      "start": 247070,
      "end": 291990
    },
    {
      "speaker": "B",
      "text": "My favorite part about Julian's story is he was building side projects while he kept his full time job. And just like Julian, I actually did the same thing. I started a million dollar business while I was working in 9 to 5 and it wasn't easy. It required working on the right idea, getting tons of feedback, and actually figuring out how to monetize so I could replace my 9 to 5 income. But the hardest part, above all, consistency. Actually showing up every day and doing the work. That's why we created the Academy. It's a five week program where you'll find an idea, build it, launch it, validate it, all while working just two hours a day. It's the same framework I use to build a million dollar business. And, and it's what I've seen thousands of successful founders actually use. It's what actually works because it's all about taking action and actually building, which is what I want to see you really take a shot at. So if you're curious about building a profitable side project like Julian and me, and you still feel like you don't have the time to work on it or work on your ideas, well, head to the first link in the description if you want to learn more. Okay, so you believe in shipping fast, but do you have any frameworks on how to build MVPs really quickly?",
      "start": 292070,
      "end": 364420
    },
    {
      "speaker": "A",
      "text": "The best way of doing that as a technical person is to focus on the product and not on the technology. I've been using the exact same stack for the past 10 years, pretty much since I started coding. I'm actually using php, which a lot of developer likes to make fun of with this PHP framework called Laravel. And now I'm super proficient with it. I have ton of, you know, small piece of code I can reuse from one project to the other and that really saves ton of time. So yeah, you can spend some time if you have fun learning about technologies, but if you want to build projects, just do it as fast as you can, use what you know and focus on that.",
      "start": 364900,
      "end": 397980
    },
    {
      "speaker": "B",
      "text": "Okay, cool. Now let's talk about marketing.",
      "start": 398220,
      "end": 400700
    },
    {
      "speaker": "A",
      "text": "Yeah.",
      "start": 400700,
      "end": 401060
    },
    {
      "speaker": "B",
      "text": "How did you get users for your app and what are the best places right now for people to find customers?",
      "start": 401060,
      "end": 406540
    },
    {
      "speaker": "A",
      "text": "I published the projects and then I just spam all the notion related communities I could Find online. Obviously there is Reddit, which is always a big one for this kind of products. Usually they have, you know, like a subreddit dedicated to it with people that are really of the product, so they're curious about discovering new things around it. Usually people on Reddit and this kind of communities that really don't like people putting links there, trying to get some users. But because it was so new and because the product was entirely free, there's not even monetization in it, I feel like they were kind of okay with me doing that, and that really helped. You know, like, I was able to get quite a lot of users pretty fast thanks to this. But also another platform I found to be super useful are Facebook groups. There are many people using Facebook and Facebook groups are super alive. There are Facebook groups for everything, like for your city, for sports, for apps, for whatever, and that was super useful as well. Twitter, I mean, is great. The only thing with Twitter is there is a cold start issue. When you start tweeting, you're basically on your own. Something really important into getting started on Twitter is to find the people that you relate to. So people that inspire you and to try and interact with them genuinely. With times they're gonna start, you know, recognizing your face, they will interact with you as well. You gain some more followers and, you know, that's how you get started. Product hunt, I think, is a nice way of advertising your product, but I think it's a bit overrated. I see some people spending weeks preparing for product launch, while in the end you just get a bit of traffic, a nice backlink, and that's pretty much it. Like when I did the launch for noteforms and I got, you know, like, of course, more eyes on the products, but I think I didn't get a single sale from the. From the launch. You know, that's my experience with it.",
      "start": 407020,
      "end": 509470
    },
    {
      "speaker": "B",
      "text": "I see. Okay, tell us now about your special growth strategy and how someone can implement it in their business to get more users.",
      "start": 509470,
      "end": 516270
    },
    {
      "speaker": "A",
      "text": "Today, as people started using it, they were building forms with notion forms and they were sharing the forms because, you know, that's the purpose of a form builder. You build a form and then you share it. You embed it on your website, and because of this, people that are supposed to fill the form, they get to see what you built. It's easy for you to just add a link back to your product or do some kind of advertisement and that becomes viral because the more users you have, the more people see your product and then the more users you have. So I think if you have a product for almost every product, you can find a way of incentivizing your users to share your product or piece of your product. So it could be just a small widget that you can put on your website. That's exactly what does Product Hunt, by the way. You know, like, they give you this little badge to say, hey, I was product of the day. And then you put this on your website, and then it's a. It's a backlink for Product Hunt. So if you can find a smart way of doing this or make it valuable for your users to share what they did on your platform, then you can create a viral loop. And I think that's super important to try and build something like this.",
      "start": 516270,
      "end": 577390
    },
    {
      "speaker": "B",
      "text": "Awesome. But with all these users coming in, how do you manage customer support or all these customer inquiries?",
      "start": 577790,
      "end": 584030
    },
    {
      "speaker": "A",
      "text": "So for the first year working on it, I was entirely alone on the project. So I was doing everything myself. I was receiving messages, like all the time at night. So sometimes I would forget to turn off notifications and then it would wake me up later on. I hired someone to help me with this, and that was really relief. But that being said, I really don't regret doing this that way. It really helped me build a better product, understand the user needs, but also identify issues within the product. So even today, we still have the operator, like an agent that's working with me that's always on it. And we also have an AI chatbot that we train on all the product docs and all the past conversations and really incentivize people to talk to us. So within the product, we have tons of buttons they can click to report a bug, leave us some feedback, suggest a feature, or just talk to us. Really since the beginning, I've only built what people ask me to build.",
      "start": 585080,
      "end": 637460
    },
    {
      "speaker": "B",
      "text": "Nice. So actively talking to customers is how you actually find the features to add. Let's now talk about monetization. How did you start making money from note forms? How did you make your first dollar?",
      "start": 638030,
      "end": 649150
    },
    {
      "speaker": "A",
      "text": "Yeah, it started taking off slowly. I think at some point I reached 1000 users. I had tons of feature requests. All of these features that I was adding, I was adding, you know, a little pro tag. And when you clicked on it, it says, hey, this is free for now because it's the beta, but whenever it will launch, it will become a paid feature. And then one day I built all the subscription system and I just flipped the switch and I told all the users, hey, now this part of the product is paid. Since you were there since the beginning here's a 40% discount code that you can use for life. And it was a long day. I remember I was just, you know, like refreshing the stripe page to try and get a new subscription, but nothing came. And then later during the night, one guy took a yearly subscription even, and I was so happy. Like I made $90. And then the day after maybe I got two and then three and then I didn't get any subscription for like three days, started to panic and then I got another one and just went on from there.",
      "start": 649390,
      "end": 704710
    },
    {
      "speaker": "B",
      "text": "Okay, now let's talk about pricing. How did you decide on the pricing for your product?",
      "start": 704950,
      "end": 709750
    },
    {
      "speaker": "A",
      "text": "Yeah, pricing is super hard. You don't want to be too expensive, but of course you want to make as much money as you can. So I didn't know what to do. So I just looked at all the other phone builders out there and I thought, you know, hey, like this is a new product. I have one tenth of all the features they offer, so I need to be cheaper than all of them. And then over time I just experimented a bit. I tried, you know, increasing the price slightly. I saw that it didn't really have any impact on the conversion, so I did it again. And then later on I also added some more expensive plans that also helped, you know, increasing a bit revenue and further.",
      "start": 710230,
      "end": 743890
    },
    {
      "speaker": "B",
      "text": "But let's talk about business model. How did you choose between a one time payment and a subscription model?",
      "start": 744390,
      "end": 749590
    },
    {
      "speaker": "A",
      "text": "If it makes sense for a product to have a subscription, then it's definitely a good idea because getting working revenue is amazing because you can acquire a customer and then for the next X months you will get money for it. And I found that selling something for $50 per month is much easier than selling one thing for five, five hundred dollars one time.",
      "start": 749750,
      "end": 771870
    },
    {
      "speaker": "B",
      "text": "Okay, let's talk about AI. Are you currently using it in your business?",
      "start": 772430,
      "end": 775950
    },
    {
      "speaker": "A",
      "text": "Overall, I'm super excited about it. There was very recently a hype about a new developer tool called Cursor, which is kind of an AI powered ide. And I recently started using it and honestly I'm amazed. And it's literally like speeding up by maybe 2 my work nowadays with all the content you can find online with tools like AI, I think it's easier than ever to build a product on your own and you know, to start working on something. So that's amazing and I'm so glad, you know, I'm living in this period of time because there are just so many possibilities and I'm super excited about all of this.",
      "start": 776510,
      "end": 810720
    },
    {
      "speaker": "B",
      "text": "Okay, that's awesome. On the topic of technology, what are some other software tools you're using to profitably run your business for the tech stack.",
      "start": 810880,
      "end": 819480
    },
    {
      "speaker": "A",
      "text": "So the backend framework is a PHP framework named Laravel. The frontend is built with a VUE framework named Nuxt. It's all the pages and makes sure that everything loads fast. The database is PostgreSQL. We host everything on AWS. So of course, you know, since I worked there for a bit, it's just easier for me that way. Now we use Stripe for subscription billing. We use Amplitude to track product analytics, you know, like the user behavior on the platform, what they use, that kind of things. We use Crisp for the support chat. We use Sentry, you know, to track the errors that happens on the app so that we can, you know, like learn about them and fix them. We use a product called Feature Base for a roadmap, like a public roadmap where people can see, you know, what's going to be built next. And of course, feature request and bug reports with three people full time and one person that's part time. So the total salary for them is 5k, so that excludes me. Then there is 1k that we pay for servers and all the SaaS tools that I mentioned earlier. We spend around 3k per month on ads, so we only do Google Ads mostly because I don't know how to do anything else. And then usually we spend probably like around 2k per month with random freelancers. So it could be like UI designers, copywriters, sometimes some external developers, that kind of things.",
      "start": 819480,
      "end": 899180
    },
    {
      "speaker": "B",
      "text": "Okay, now last question that we ask all founders we interview. If you could sit on younger Julian's shoulder and, and give him some advice when he was just starting out, what would you say?",
      "start": 899660,
      "end": 909370
    },
    {
      "speaker": "A",
      "text": "Amazon has a set of leadership principles. One of them is bias for action, and I think that's a really good one. The most important thing you can do is start. If you spend too much time thinking about it and not doing anything, then at some point you just get demotivated and nothing's going to happen, the project's going to die. But as soon as you know, you start working on it and you get to see the first wizards, get the first users. It really fuels your motivation and of course it helps you shape the product better because you get feedback and so on. So the first thing would definitely be launch as soon as you as you can. Don't overthink it, don't build too many features, just build a simple MVP and then put it in front of the eyes of your customers. The other thing is not to be Shy. So that took me a bit of time as well. But try to talk about it to as many people as you can. You can only know if it's a good idea or if it's valuable or if it's actually useful by getting the opinion of other people. No one is going to stop everything they do in their life just to build what you describe them, right? If that happens, that means that, you know, one guy was more motivated than you by your own idea and that's on you, right? You should have done it. In the end, you're not risking that much. I think if you know you can find a job, especially like if you're a software engineer, think months off working on a project, it's. It's nothing. The risk seems huge, but I think it's not that big.",
      "start": 910570,
      "end": 991640
    },
    {
      "speaker": "B",
      "text": "All right, Julian, thank you. Thanks for coming on and sharing your story. I love the business that you built and wishing you luck in the future. Keep sharing your story.",
      "start": 991880,
      "end": 1000120
    },
    {
      "speaker": "A",
      "text": "Awesome. Cool. Thanks man.",
      "start": 1000280,
      "end": 1001960
    },
    {
      "speaker": "B",
      "text": "Yo guys. I really hope you all enjoyed the video and wrote down some good takeaways that Julian shared. But I do want to say something real quick. At the end of the day, the point of these videos is to inspire you and show you how other people just like you found ideas and built them. Hopefully this inspires you to go out and do this thing on your own. While learning is important, taking action is the thing that's actually going to get you that dream outcome. If you still feel like you're struggling to take action no matter what, then I highly recommend you check out the Starter Story Academy. It's a five week program where you'll come up with an idea, you'll build it, you'll launch it, you'll validate it, and you'll get it in front of customers. What's even more amazing is you'll do this alongside hundreds of other people doing the same thing. Building something that will change their life. And we will hold you accountable every single day to showing up and doing the work. The Academy is what I wish I had when I was getting started and I still had a full time job. And it's designed for you to actually build something that changes your life. Just head to the first link in the description and I'll give you a bunch of more info about it. I hope to see you in there. Otherwise I'll see you in the next one. Peace.",
      "start": 1002280,
      "end": 1068979
    },
    {
      "speaker": "A",
      "text": "Sam.",
      "start": 1069630,
      "end": 1079430
    }
  ]
}