{
  "source": "/home/salouri/Projects/starter_story/transcripts/8xgnm6SynH4/8xgnm6SynH4_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "This is Cole. These are his two best friends. They all live in the same apartment and they claim to make millions off roblox. Yes, this game. But before we get into all that, we gotta go back. It all started with a tweet. Is there anybody actually making money with video games? Hundreds of people slid into my DMs, but one of them really stood out. His name was Cole. And when he told me how much money he was making, I just couldn't believe it. And I had a lot of questions. Is this actually real? Is this something that's actually going to last? And how much are you really profiting from this? The only way to find out. Well, I decided to fly out to Austin, Texas, knock on his door and have him show me proof. Come join me as I spend 24 hours with Roblox millionaires. I'm Pat Walls, and this is Starter Story. So after landing in Austin, Texas, we grabbed a couple crappy airport sandwiches and got ourselves a taxi to Cole's. At this point, I was still pretty skeptical on if this was actually going to be real. And I had a lot of questions to ask these kids, which is why the ride felt like an eternity. Finally, we arrived. Okay, I think that's his apartment right there. What if this is all fake? Like he's not even there right now? Or what if this is some sort of like rented apartment or something like that and this is all a big sham? All right, let's check it out. Let's see what's gonna happen.",
      "start": 320,
      "end": 88040
    },
    {
      "speaker": "B",
      "text": "Hello.",
      "start": 92430,
      "end": 92830
    },
    {
      "speaker": "C",
      "text": "Nice to meet you.",
      "start": 93070,
      "end": 94030
    },
    {
      "speaker": "D",
      "text": "What's up, man?",
      "start": 95070,
      "end": 95750
    },
    {
      "speaker": "C",
      "text": "What's up?",
      "start": 95750,
      "end": 96270
    },
    {
      "speaker": "A",
      "text": "Come on, let's do this. Let's check this out. Nice house.",
      "start": 96430,
      "end": 99150
    },
    {
      "speaker": "C",
      "text": "Thank you. Thank you.",
      "start": 99470,
      "end": 100590
    },
    {
      "speaker": "A",
      "text": "Nice to meet you, man.",
      "start": 102910,
      "end": 103710
    },
    {
      "speaker": "C",
      "text": "Nice to meet you too.",
      "start": 103710,
      "end": 104310
    },
    {
      "speaker": "A",
      "text": "Thanks for having me in your house.",
      "start": 104310,
      "end": 105270
    },
    {
      "speaker": "C",
      "text": "Of course.",
      "start": 105270,
      "end": 105749
    },
    {
      "speaker": "A",
      "text": "Dude, tell me about what you do.",
      "start": 105749,
      "end": 107390
    },
    {
      "speaker": "C",
      "text": "I make Roblox games. I'm one of the top, like 50 biggest Roblox developers in the world right now. I have 1 million daily active users across all my games.",
      "start": 107790,
      "end": 115550
    },
    {
      "speaker": "A",
      "text": "Wow.",
      "start": 115550,
      "end": 115870
    },
    {
      "speaker": "C",
      "text": "It's mainly kids, mainly in the U.S. mainly in Canada.",
      "start": 115870,
      "end": 118590
    },
    {
      "speaker": "A",
      "text": "And when did you start playing Roblox?",
      "start": 119540,
      "end": 121140
    },
    {
      "speaker": "C",
      "text": "I started playing Roblox 2013. So I think I was about 8 or 9 years old. But I guess I didn't start making like bringing the money outside of Roblox until I was 16 and I just skipped college. So as soon as I turned 18, I moved to Austin and I just started going like full in on my journey.",
      "start": 121380,
      "end": 135300
    },
    {
      "speaker": "A",
      "text": "Nice. Cool. And I understand that you have a brother who also develops Roblox games.",
      "start": 135300,
      "end": 140380
    },
    {
      "speaker": "C",
      "text": "Is he your younger Brother, older brother, twin brother. He lives with me. He lives here. He lives right here.",
      "start": 140380,
      "end": 144540
    },
    {
      "speaker": "A",
      "text": "He's here right now?",
      "start": 144540,
      "end": 145220
    },
    {
      "speaker": "C",
      "text": "He's here right now. Probably in his room.",
      "start": 145220,
      "end": 146660
    },
    {
      "speaker": "D",
      "text": "What's up?",
      "start": 146980,
      "end": 147620
    },
    {
      "speaker": "A",
      "text": "So you also make Roblox games?",
      "start": 149060,
      "end": 151670
    },
    {
      "speaker": "D",
      "text": "I do, yes. Yes.",
      "start": 151670,
      "end": 152670
    },
    {
      "speaker": "C",
      "text": "Okay.",
      "start": 152670,
      "end": 153070
    },
    {
      "speaker": "D",
      "text": "I made a game during winter break when I was in college and blew up.",
      "start": 153070,
      "end": 156030
    },
    {
      "speaker": "C",
      "text": "And then I had enough money to.",
      "start": 156030,
      "end": 156870
    },
    {
      "speaker": "D",
      "text": "Drop out of college, so.",
      "start": 156870,
      "end": 157790
    },
    {
      "speaker": "A",
      "text": "Okay.",
      "start": 157790,
      "end": 158230
    },
    {
      "speaker": "B",
      "text": "Wow.",
      "start": 158230,
      "end": 158550
    },
    {
      "speaker": "C",
      "text": "Yeah.",
      "start": 158550,
      "end": 158950
    },
    {
      "speaker": "A",
      "text": "And tell me a little bit about your game.",
      "start": 158950,
      "end": 160550
    },
    {
      "speaker": "D",
      "text": "It used to be called Baked a Baby.",
      "start": 160630,
      "end": 162190
    },
    {
      "speaker": "C",
      "text": "And there was a game where you.",
      "start": 162190,
      "end": 163190
    },
    {
      "speaker": "D",
      "text": "Would bake babies and it went very viral because of that reason.",
      "start": 163190,
      "end": 166389
    },
    {
      "speaker": "A",
      "text": "Yeah.",
      "start": 166389,
      "end": 166670
    },
    {
      "speaker": "D",
      "text": "So we got a lot of publicity, like Ishowspeed played it. All the big Roblox YouTubers played it.",
      "start": 166670,
      "end": 170310
    },
    {
      "speaker": "C",
      "text": "Oh, wow.",
      "start": 170310,
      "end": 170750
    },
    {
      "speaker": "D",
      "text": "I'd probably say around like 100 million views total during the release of the game. Yeah.",
      "start": 170750,
      "end": 175230
    },
    {
      "speaker": "A",
      "text": "Cool, cool. And where are you guys from?",
      "start": 175230,
      "end": 176790
    },
    {
      "speaker": "C",
      "text": "Ohio.",
      "start": 177370,
      "end": 177810
    },
    {
      "speaker": "A",
      "text": "And what brought you to Austin, Texas?",
      "start": 177810,
      "end": 179370
    },
    {
      "speaker": "C",
      "text": "A few years ago, I met my friend Jake in person. Eventually we ended up talking a lot online, like once a week. And then eventually he's like, I wanna move to Austin. And so he ended up moving down. He lives two doors down from us.",
      "start": 179770,
      "end": 189410
    },
    {
      "speaker": "A",
      "text": "So is he making money on Roblox too?",
      "start": 189410,
      "end": 191370
    },
    {
      "speaker": "C",
      "text": "Yeah, yeah, he's making money off of Roblox.",
      "start": 191370,
      "end": 193010
    },
    {
      "speaker": "A",
      "text": "Okay. Yeah, let's get him in here too.",
      "start": 193010,
      "end": 194490
    },
    {
      "speaker": "C",
      "text": "All right, sounds good.",
      "start": 194490,
      "end": 195170
    },
    {
      "speaker": "A",
      "text": "Can you give him a call?",
      "start": 195170,
      "end": 195890
    },
    {
      "speaker": "C",
      "text": "Yeah, yeah.",
      "start": 195890,
      "end": 196570
    },
    {
      "speaker": "B",
      "text": "Yo, what's up?",
      "start": 197370,
      "end": 198170
    },
    {
      "speaker": "C",
      "text": "Yo, Jake, I'm doing this, like, podcast thing. You wanna come over?",
      "start": 198170,
      "end": 201210
    },
    {
      "speaker": "B",
      "text": "Oh, hell yeah.",
      "start": 202250,
      "end": 203170
    },
    {
      "speaker": "C",
      "text": "Hold up.",
      "start": 203170,
      "end": 203690
    },
    {
      "speaker": "A",
      "text": "Yo, what's up?",
      "start": 204970,
      "end": 206010
    },
    {
      "speaker": "C",
      "text": "What's up, Jake?",
      "start": 206010,
      "end": 206730
    },
    {
      "speaker": "B",
      "text": "Good to see you guys.",
      "start": 206730,
      "end": 207410
    },
    {
      "speaker": "C",
      "text": "Good to see you, bro. Good to.",
      "start": 207410,
      "end": 208570
    },
    {
      "speaker": "A",
      "text": "Good to see you, man.",
      "start": 209430,
      "end": 210150
    },
    {
      "speaker": "B",
      "text": "Nice to meet you too.",
      "start": 210230,
      "end": 211590
    },
    {
      "speaker": "A",
      "text": "Tell me about your Roblox business.",
      "start": 211910,
      "end": 213350
    },
    {
      "speaker": "B",
      "text": "Yeah, so I run a marketing agency for brands that come to Roblox. We worked with Nicki Minaj and spongebob when they came to Roblox. And we built basically all the video content around that, like these trailers for it, social media campaigns and all that, you know, we've made 450 videos, probably now done like well over 100 million views.",
      "start": 213430,
      "end": 231910
    },
    {
      "speaker": "A",
      "text": "Okay, we're going to talk all about your guys, businesses, but first I want you guys to break down the Roblox economy and really the opportunity here for anyone that's watching. So let's go to the whiteboard and let's do some math.",
      "start": 232070,
      "end": 245010
    },
    {
      "speaker": "C",
      "text": "Let's do it.",
      "start": 245170,
      "end": 245770
    },
    {
      "speaker": "D",
      "text": "Let's do it.",
      "start": 245770,
      "end": 246410
    },
    {
      "speaker": "A",
      "text": "I'd love you. Explain to me, what is Roblox? Like, how does the whole thing work?",
      "start": 246410,
      "end": 250610
    },
    {
      "speaker": "B",
      "text": "Yeah, so Roblox is basically just YouTube for video games. Anyone can make a video game on this platform, the same way that anyone can put out a YouTube video. So when you go on a Roblox, you basically just have this page with a ton of different games that you scroll through and play. When someone plays a Roblox game, they basically have this currency called Robux. And this can be used to just buy anything in the game, like power ups or skins that a developer can create and add to their game. As the developer of the game, then I receive those Robux, and then you turn your Robux into real money. Then like, newer way that games are also making a ton of money is brands sponsoring them. So instead of just going out and, you know, putting a YouTube sponsor like before this video, for example, example, they can build something that's interactive in Roblox. And that's the new way to make people into kind of lifelong fans.",
      "start": 250610,
      "end": 306730
    },
    {
      "speaker": "A",
      "text": "Yeah. Before we get into guys businesses, I just want to let anyone watching know how big Roblox is, because I think it's almost kind of unfathomable how big these numbers are. So if you walk me through that.",
      "start": 306730,
      "end": 317050
    },
    {
      "speaker": "C",
      "text": "I think it's pretty crazy.",
      "start": 317050,
      "end": 317930
    },
    {
      "speaker": "B",
      "text": "Yeah. So one in two kids under 16 years old in the US are playing Roblox every day. That equates to there being 400 million monthly active users. So 400 million unique people playing this game every month. And the kids that are playing Roblox are spending two times more time on Roblox than TikTok. And half the time these kids are on TikTok, they're literally using it to find their next Roblox game to play.",
      "start": 317930,
      "end": 349540
    },
    {
      "speaker": "A",
      "text": "All right, so it sounds like a lot of kids are playing Roblox, but what does that mean for the future?",
      "start": 349940,
      "end": 354900
    },
    {
      "speaker": "B",
      "text": "Yeah, it means that as big as Roblox, is this literally the tip of the iceberg. Like, we're not anywhere near the peak because we have all of these kids in the US that are growing up on Roblox that as they grow up, continue to be able to play. And then this just keeps growing. And every time the base gets larger and larger as more kids come to the platform, then there's also this concept of like, unlocking demographics. So for a while on Roblox, girls didn't really play, especially like older girls, until this game called Dress to Impress comes out. It's this massive fashion game to the point of over a million people have played it at one time. And it's been played well over a billion times. So now we have this huge demographic being unlocked by a new game. And what we'll see is this will happen with the older male demographic eventually. This will continue to happen with different groups and eventually Roblox will cover all bases and be the largest platform.",
      "start": 355140,
      "end": 404860
    },
    {
      "speaker": "C",
      "text": "You even mentioned that Mr. Beast is not coming onto Roblox. Oh yeah, this is like a big thing. He's making a massive entrance. He had a meeting with the CEO, he made his own game. And so he's realizing this opportunity as, oh crap, this is the next YouTube. I gotta be the first person here.",
      "start": 405100,
      "end": 416820
    },
    {
      "speaker": "D",
      "text": "Yeah.",
      "start": 416820,
      "end": 417140
    },
    {
      "speaker": "B",
      "text": "For someone like him to come on the platform is huge because. Because he's really up to date on where things are going. And to know that he endorses Roblox as a whole, I think is a huge sign of what's to come for us.",
      "start": 417140,
      "end": 426600
    },
    {
      "speaker": "A",
      "text": "Hey guys, it's Pat here. I'm just putting the final touches on this video right now. But first I gotta show you something. So these Roblox guys are just killing it with their games, right? But I wanted to find out if there are other games in the Starter Story database that are making money. Real quick. I found these three examples. This guy's making $200,000 a year with an online solitaire game. This dude is making $20,000 a month with his Mexican train game. How funny is that? And my buddy Peter Lovells is making $50,000 with his plane game simulator. And it got me thinking, what if anyone could build this? What if anyone can turn an idea into a real working app on the Internet? Well, what if I told you you could? AI coding tools are making building games like this entirely possible. In fact, Peter Lovells built his game with 100% AI coding tools. And this is why we've been low key working on our new product, Starter Story Build. In Starter Story Build, we teach you how to use AI coding tools to turn an idea into a real life production app. You'll start by learning the basics of an AI coding tool called Lovable. And our in house Lovable expert will guide you through 14 different modules that teach you how to Vibe code. Each module builds on the other and in just 12 days you'll go from an idea to a real working app on the Internet. We've had hundreds of people enroll and some of the stuff people are building is amazing. I believe that AI coding is going to change the world, is going to give tools to people who didn't know how to code before to build apps that could potentially make thousands of dollars and change your life. And I'm super pumped on all this. So if you're ready to start Vibe Coding and Actually take that idea and bring it to life. Click the first link in the description to check out starter story build. All right, back to the video.",
      "start": 427320,
      "end": 542440
    },
    {
      "speaker": "C",
      "text": "Okay.",
      "start": 542680,
      "end": 543200
    },
    {
      "speaker": "A",
      "text": "Personally, now I'm convinced that Roblox is the real deal. The only thing that's not clear yet is how to actually build a successful business around it. So I decided to have each of the boys dive deep into their respective Roblox business and explain how it works and how much money it actually makes. Let's start off with Cole. I'd love if you could actually pull up your game, pull up some of the money that you're making so that people can see. I'd love to just see what you do specifically.",
      "start": 543200,
      "end": 571250
    },
    {
      "speaker": "C",
      "text": "Yeah, man, I can definitely join. Yeah. My game is a game called Hot or Die. I think it's like the top 100 game on Roblox. So the active users is about a million.",
      "start": 571250,
      "end": 578290
    },
    {
      "speaker": "A",
      "text": "Oh my God.",
      "start": 578450,
      "end": 579330
    },
    {
      "speaker": "C",
      "text": "So you can see every single day like so you have.",
      "start": 579330,
      "end": 581090
    },
    {
      "speaker": "A",
      "text": "Show me up in there. It says you have 13,000 people playing, right?",
      "start": 581330,
      "end": 583650
    },
    {
      "speaker": "C",
      "text": "Yeah, 13,000 people playing right now. But you can see these are like real kids playing. And the rounds starting in 10 seconds. The kids are voting for what map they want.",
      "start": 583650,
      "end": 592690
    },
    {
      "speaker": "A",
      "text": "Show me how you actually coded this. Are you writing in a code editor or is it like. If you could pull up the development stuff, I'd love to see that.",
      "start": 592850,
      "end": 600850
    },
    {
      "speaker": "C",
      "text": "Yeah. There's like Roblox Studio so I can press edit in Studio where I can edit anything in the game. These are all models. There's a bunch of different folders and scripts in here where it maps out code.",
      "start": 600850,
      "end": 611890
    },
    {
      "speaker": "A",
      "text": "Nice.",
      "start": 611890,
      "end": 612230
    },
    {
      "speaker": "C",
      "text": "I actually, I'm not a programmer. I do everything but program. So I like to all the UI and all the building and all that stuff. I like a business partner who does all the programming for all my games, basically. So, you know, man, it's endless. Code is probably thousands of scripts in here.",
      "start": 612380,
      "end": 623820
    },
    {
      "speaker": "A",
      "text": "Yeah. If you could break down how much money you generally make per month, what channels those come from, and then you did say you have like some split and profits or anything like that.",
      "start": 623820,
      "end": 632380
    },
    {
      "speaker": "C",
      "text": "Yeah. So it's kind of confusing. It's going to be in Robux.",
      "start": 632540,
      "end": 635340
    },
    {
      "speaker": "A",
      "text": "Yeah.",
      "start": 635340,
      "end": 635820
    },
    {
      "speaker": "C",
      "text": "But I have like six million Robux right now. For every one million Robux, it's three and a half grand. We're looking at like 15 grand right now. So far this month we've got in the group. How to Die is a fairly new success. About like 6 months ago we launched it and right now it's sitting at about like 45k a month. Just hide or Die that one game before, I actually spent like half a million dollars on two projects that both failed. One of them was a Roblox game that I spent a bunch of money and time on that just didn't end up blowing up, and it destroyed me. And then this other company where you could hire, like, YouTubers and content creators to make videos on your game, I spent three years on these projects. So all my money on these projects, I was like, super burnt out. And I was like, man, I just want to. I just want to make a game quick. And that's what we made. Had or die.",
      "start": 635820,
      "end": 675740
    },
    {
      "speaker": "A",
      "text": "Yeah.",
      "start": 675740,
      "end": 676060
    },
    {
      "speaker": "C",
      "text": "And then we've started to, like, help out other developers with their game. We're taking, like, splits of that too. This month alone, we're on try to make like 70 grand this month. Wow. And then I split with my programmer, slash business partner. He has half of it.",
      "start": 676060,
      "end": 686740
    },
    {
      "speaker": "A",
      "text": "Okay, cool.",
      "start": 686740,
      "end": 687260
    },
    {
      "speaker": "C",
      "text": "And then I have an accountant and lawyer and a bunch of miscellaneous things too. We don't do any ads, so, like, it's kind of like YouTube or something. You don't really need to advertise. YouTube video just kind of gets shown people. But I do have, like, modelers and people who make graphics for us and things like that. So I blow through like 5k a month just paying people for contract work. Yeah, sure.",
      "start": 687260,
      "end": 703200
    },
    {
      "speaker": "A",
      "text": "Cool. You mentioned that you had a few games that flopped, and then you created this one with less expectations and then it went crazy.",
      "start": 703280,
      "end": 710000
    },
    {
      "speaker": "C",
      "text": "Yeah.",
      "start": 710000,
      "end": 710480
    },
    {
      "speaker": "A",
      "text": "Tell me a little bit more about that.",
      "start": 710480,
      "end": 711760
    },
    {
      "speaker": "C",
      "text": "Yeah, so, I mean, I spent basically all my high school years and like 300 grand on this game. I basically was trying to, like, remake all these best games and combine it into this, like, grand thing. And within that time frame, I saw Ian over would you break, make, bake the baby? And the game blew up. And so I think I kind of looked at Ian and I'm like, Ian had so much fun with his game. He did so quickly. Now he's super. You know, he's making a lot of money. I spent three years and all this money in my game and my game failed. I ended up calling my programmer. I'm like, let's make a game in two weeks. And I think they taught me a valuable lesson about test first and then build, don't build, then test.",
      "start": 712080,
      "end": 741450
    },
    {
      "speaker": "A",
      "text": "Yeah.",
      "start": 741450,
      "end": 741810
    },
    {
      "speaker": "C",
      "text": "You can waste years building a startup or a game and then it ends up being worth nothing. But if you build it and somewhat works to begin with, you know you have something.",
      "start": 741810,
      "end": 749740
    },
    {
      "speaker": "A",
      "text": "Yeah. Now that you had this game that has 13,000 active users right now, is there any sort of like, framework of what it takes to get to the top with a Roblox game.",
      "start": 749740,
      "end": 758740
    },
    {
      "speaker": "C",
      "text": "Yeah. So I always focus on clickability. Is the game clickable? Because if it's not, no one's going to play it. Bake the Baby, for example, was like, that was a crazy title and that's why it worked. And how to die, Hide or die, that's pretty dramatic. So I think being dramatic or unique in some way always works out. Then another important thing is it's like social. So Roblox is all about playing with friends. Making a game that's playable with friends or against friends or whatever is, like, super important. The final thing is it needs to be replayable. And so when I play your game, if I play it for 10 minutes and know everything that the game has to offer, I'm going to leave.",
      "start": 758900,
      "end": 787790
    },
    {
      "speaker": "A",
      "text": "Yeah.",
      "start": 787790,
      "end": 788110
    },
    {
      "speaker": "C",
      "text": "But if I play the game and I'm level 10 and I got to be level 100 to see the next thing, then I'm like, well, maybe I'll play again to see what was behind that door. So you got to build the curiosity in the users. Same way for YouTube video. So, yeah, clickable, social, and replayable. That's a good formula I could give you, but it's probably going to take you a few attempts anyway to get a hit game. If you want to make a hit game.",
      "start": 788110,
      "end": 806110
    },
    {
      "speaker": "A",
      "text": "Cool. Ian, do you want to show off your game?",
      "start": 806110,
      "end": 807950
    },
    {
      "speaker": "D",
      "text": "Sure, sure. My game is called Bathe the Baby. It was formerly called Bake the Baby. Basically, it's a game where players will step in this pad and we make all of our money from this, like, daily shop. So we sell like a pigeon skin, cow skin. And we make money from selling coins as well. So you can use these coins right here to buy skins. And then you can also buy abilities as well. So like, shoot a meteor at somebody or turn into a ghost and be invisible. But as you can see, our average revenue for paying user is pretty crazy.",
      "start": 808350,
      "end": 835800
    },
    {
      "speaker": "A",
      "text": "That's high.",
      "start": 836040,
      "end": 836680
    },
    {
      "speaker": "D",
      "text": "That's very high. That's incredibly high.",
      "start": 836760,
      "end": 838880
    },
    {
      "speaker": "A",
      "text": "What's the dollar amount on that?",
      "start": 838880,
      "end": 840040
    },
    {
      "speaker": "C",
      "text": "It's about $1.50.",
      "start": 840040,
      "end": 841480
    },
    {
      "speaker": "A",
      "text": "Yeah.",
      "start": 841480,
      "end": 841760
    },
    {
      "speaker": "D",
      "text": "And we have around 150,000 daily active users.",
      "start": 841760,
      "end": 844159
    },
    {
      "speaker": "A",
      "text": "Wow.",
      "start": 844159,
      "end": 844560
    },
    {
      "speaker": "D",
      "text": "Which is close to a top 200 game on Roblox.",
      "start": 844560,
      "end": 847160
    },
    {
      "speaker": "A",
      "text": "All right, so how much does your Roblox game make? And also go over some of the costs involved with it.",
      "start": 847480,
      "end": 852800
    },
    {
      "speaker": "D",
      "text": "Okay. Mine makes around 25 grand a month. And I also have a business partner, and we put it at 50. 50. Basically the exact same process as Cole. We also have brand deals as well that come in. But my Brand deals are probably closer to like five grand. We also have a few modelers, a few people who make graphics for us at the thumbnails and icons. But it's still a pretty small team. Like only four or five people are really contributing to the game.",
      "start": 852800,
      "end": 872440
    },
    {
      "speaker": "A",
      "text": "Yeah.",
      "start": 872440,
      "end": 872800
    },
    {
      "speaker": "C",
      "text": "Cool.",
      "start": 872800,
      "end": 873200
    },
    {
      "speaker": "A",
      "text": "All right, Jake, tell me about the business you built around Roblox and how it's a little bit different.",
      "start": 873840,
      "end": 878080
    },
    {
      "speaker": "B",
      "text": "Yeah, so I built a company called Vector 3. So anytime like a brand comes to Roblox, there's a pretty good chance that we're creating the media around it. So, you know, a bunch of TikTok videos on the game have it go viral and that would bring in players. So like a new form of marketing.",
      "start": 878240,
      "end": 892620
    },
    {
      "speaker": "A",
      "text": "Cool. I want to take a step back. So how did you even get into Roblox and then this kind of business idea that's adjacent to it?",
      "start": 892860,
      "end": 900460
    },
    {
      "speaker": "B",
      "text": "Yeah, so I started playing Roblox in 2011, so 14 years ago for me, I always just like moved around between different interests. You know, one week I was a graphic designer and then I would move and spend a week working in a Roblox cafe as like a barista and just like literally make virtual copies, other ways of like program for people. And then when middle school hit, I would make these montage edits and I spent years doing that. And that's where I learned that I really, really liked video production, that whole aspect. And with that mentality, I went into kind of video production for brands on Roblox and started building out these trailers and social campaigns. All of the editors that I knew from middle school that we would make these phantom forces montages with actually worked at my company now.",
      "start": 900700,
      "end": 943860
    },
    {
      "speaker": "A",
      "text": "Yeah, you're running your company remotely, is that right? Yeah, walk me through that a little bit. How does, how do you do business?",
      "start": 943860,
      "end": 949800
    },
    {
      "speaker": "B",
      "text": "Yeah, so we run Discord in just a group chat where we have stuff that we're working on. And then our bread and butter is our content management system. I nerd over this like all the time in terms of like how things get done. Let's say we are hired by Nike to make a trailer. Our head of content, Ryan, will go into this templated project plan where there's a 45 step system of how to do the trailer. So every little step in each one of these steps has an SOP that then has a video that I've recorded on how to do it. The way we get about 95% of our clients is LinkedIn. So I basically built a LinkedIn account where I was putting out, you know, a lot of Educational content as well as our work over time when people were like, hey, I need to either figure out a strategy for coming to Roblox or I need someone to make video content. We were the people that they followed. Yeah, I don't do cold outreach. I don't do cold calls. I also use consulting as a really big way of getting clients. So you do a paid consulting call at the end, they also need someone to execute. That's where we also come in. So it's like, I'm not paying, I'm getting paid for the lead.",
      "start": 950040,
      "end": 1016420
    },
    {
      "speaker": "A",
      "text": "Yeah, yeah, yeah. Cool. Damn. If you could pull up some of your numbers here, that'd be really cool.",
      "start": 1016420,
      "end": 1021300
    },
    {
      "speaker": "B",
      "text": "Yeah. So this month we have, you know, $36,150 coming in so far, 20 to 25,000. That just comes from our retainers. But on top of that we'll have like our per project payments.",
      "start": 1021460,
      "end": 1032260
    },
    {
      "speaker": "A",
      "text": "Yeah.",
      "start": 1032260,
      "end": 1032730
    },
    {
      "speaker": "B",
      "text": "Basically it cost me about 10 to $15,000 a month to run it. I have two full time guys getting a total of like $10,000 a month. And then there's probably an additional 5,000 that's going out for like animation contractors. Anyone doing motion graphics, Actors that are participating, like volunteering.",
      "start": 1032960,
      "end": 1048640
    },
    {
      "speaker": "A",
      "text": "Yeah. Cool. If you have a framework or something on how to build a company at your age without having to go to college and take that path.",
      "start": 1048720,
      "end": 1055600
    },
    {
      "speaker": "B",
      "text": "Yeah, My framework was take everything that interests you and just put your head.",
      "start": 1055600,
      "end": 1059480
    },
    {
      "speaker": "D",
      "text": "Down for a little bit.",
      "start": 1059480,
      "end": 1060160
    },
    {
      "speaker": "B",
      "text": "See if you can get a little bit better than average. If you enjoy that, keep doing that. Work as a freelancer. Just do the thing for a while until you build up expertise. Don't even think about it. From the approach of like wanting to build this business. If you can do that, you put yourself onto a path for success no matter what. Right. And it might not be the thing you started out doing. I bounced around between 100 different skills. The difference was that because I did them all, I know what I like and how to be good at it and scale it.",
      "start": 1060160,
      "end": 1085280
    },
    {
      "speaker": "A",
      "text": "Yeah, that's great advice. All right, boys, tell me what a day in the life looks like for you guys. Building million dollar businesses while you're not even going to college. Just tell me about what's life like.",
      "start": 1085660,
      "end": 1098140
    },
    {
      "speaker": "B",
      "text": "Probably way less exciting than anyone would expect.",
      "start": 1098460,
      "end": 1101100
    },
    {
      "speaker": "C",
      "text": "Yeah, I think you'd imagine like the craziest things ever. And I think it's funny because like we have crazy moments, but most of our life is just super boring or like just super normal.",
      "start": 1101259,
      "end": 1109020
    },
    {
      "speaker": "B",
      "text": "I'll wake up at like 10:59 usually for my meeting at 11 with my team. I'll take it in my bed on my phone, and then I'll have a really slow morning. And then it's. You just sit at your desk, you put on your headphones, put your phone in your other room, sit like that for usually four or five hours. We're really big about, like, you're either working or you're, like, resting. There's not like that in between. So we'll just kind of work. And then usually around like 5 o' clock or when sun's starting to set, we just sit out there and no phones kind of hang out.",
      "start": 1109020,
      "end": 1134100
    },
    {
      "speaker": "C",
      "text": "Yeah, I think I want to. I want to add to that. I think it's like you hear about stories about startups or businesses. It's like you got to work 24 hours every single day, no sleep, sacrifice everything. While that's true, maybe to learn a skill or become really good at something, it's not necessarily true. Like, after that, creating the space for you to have thoughts will make you, like, a 10x better entrepreneur because you all, like, you have more actionable steps, what to do next.",
      "start": 1134340,
      "end": 1154720
    },
    {
      "speaker": "A",
      "text": "Yeah, I think it's cool that you guys found your people. I think a lot of people may be watching this, feeling like, I'm kind of passionate about this thing, but I don't have, like, friends. Like, you guys are all friends. You say you can bounce ideas off each other. Maybe you can retell the story of how you all got together and then also advice for people who are looking to find other people across the Internet to live and work with.",
      "start": 1154720,
      "end": 1175400
    },
    {
      "speaker": "B",
      "text": "It takes awkwardness. I think that's one of the best ways to put it. The start of our friendship was a Google Calendar weekly call just to talk, literally, like scheduling a conversation with each other. But if you can embrace that and do that at scale and keep trying, it'll lead to finding your circle. And it's. It's so, so worth it.",
      "start": 1175560,
      "end": 1194200
    },
    {
      "speaker": "A",
      "text": "Yeah.",
      "start": 1194200,
      "end": 1194640
    },
    {
      "speaker": "B",
      "text": "It's also important when you own a business and you do anything to. To build a real relationship, you have to make sure it's not transactional. And you have to set the clear boundary of, like, these are my friends. These are not people I'm selling to. These are people I'm doing, like, a quid pro quo for. Like, these are like, my people, my friends that I would do anything for and vice versa.",
      "start": 1194640,
      "end": 1212980
    },
    {
      "speaker": "A",
      "text": "Yeah, yeah, yeah. Damn. All right, guys. Well, you got a good head on your shoulders. I mean, what you guys built is amazing. It was great to meet you guys. So thank you all pound here.",
      "start": 1213060,
      "end": 1224020
    },
    {
      "speaker": "C",
      "text": "Yeah.",
      "start": 1224100,
      "end": 1224580
    },
    {
      "speaker": "A",
      "text": "Follow this advice and you'll be Roblox millionaires. Good luck, guys.",
      "start": 1225600,
      "end": 1229520
    }
  ]
}