{
  "source": "/home/salouri/Projects/starter_story/transcripts/dphK9rh2F5U/dphK9rh2F5U_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "This guy made $1 million a month selling bedsheets online. And the crazy part is he literally does it from bed.",
      "start": 320,
      "end": 8600
    },
    {
      "speaker": "B",
      "text": "I work from bed all the time actually. This is definitely the office.",
      "start": 8600,
      "end": 11440
    },
    {
      "speaker": "A",
      "text": "I flew out to Denver, Colorado to ask him exactly how he got started and the unconventional marketing strategy he uses to make millions of dollars a year.",
      "start": 11760,
      "end": 20240
    },
    {
      "speaker": "B",
      "text": "I sponsor that I love and I sponsor that I watch.",
      "start": 20400,
      "end": 24640
    },
    {
      "speaker": "A",
      "text": "Before the money, Colin worked three different full time jobs, but he couldn't keep any of them. So he decided to start his own company and in the process found a special hack to make $284,000 in his first 30 days.",
      "start": 25040,
      "end": 40930
    },
    {
      "speaker": "B",
      "text": "We got 450 customers at $100 AOD, did $45,000 on day one and that snowballed into a $284,000 campaign.",
      "start": 41170,
      "end": 49570
    },
    {
      "speaker": "A",
      "text": "In this video, Colin shares his exact blueprints on how to build a million dollar per month brand, how to name a million dol, and how to find and validate a million dollar business idea.",
      "start": 49730,
      "end": 61540
    },
    {
      "speaker": "B",
      "text": "The easiest way to do it is to build so they can really visualize and understand the company they're building.",
      "start": 61700,
      "end": 67700
    },
    {
      "speaker": "A",
      "text": "I'm Pat Walls and this is Starter Story.",
      "start": 67700,
      "end": 70580
    },
    {
      "speaker": "B",
      "text": "Colin, great to meet you in person after all these years. So it's awesome to see the growth of Starter Story.",
      "start": 71460,
      "end": 77020
    },
    {
      "speaker": "A",
      "text": "Thank you, man.",
      "start": 77020,
      "end": 77500
    },
    {
      "speaker": "C",
      "text": "Thank you for having me. Tell me about yourself and what you built.",
      "start": 77500,
      "end": 79940
    },
    {
      "speaker": "B",
      "text": "I am founder and CEO of Sheets and Giggles. And if you haven't heard of us, we sell bed sheets. I incorporated the company October 2017, shipped our first box in October 2018, and then about 25 months later in November 2020, we had our first million dollar month at about $1.2 million in sales. So it was pretty meteoric at the beginning. Yeah. That's awesome. Yeah.",
      "start": 79940,
      "end": 102530
    },
    {
      "speaker": "C",
      "text": "All right, can you tell me a little bit more about your business and how it works?",
      "start": 102530,
      "end": 105570
    },
    {
      "speaker": "B",
      "text": "Sure. So we're a direct to consumer brand. We sell mostly through our website, sheetsgiggles.com which is a Shopify back end. And then we also sell on Amazon@Amazon.com sheets we do about 9010 or 8020 shopify versus Amazon in terms of sales. We started in 2018 with just sheets, comforters and duvet covers and pillowcases. Since then we've added throw blankets, pillows, crib sheets, mattress protectors and all stuff. And we actually launched a Mattress in late 2022. We started with five colors and five sizes and now we have seven sizes and 17 colors and hundreds of and shipping 100 pound mattresses every day. So it's crazy. Yeah.",
      "start": 105730,
      "end": 146500
    },
    {
      "speaker": "C",
      "text": "All right, Colin, tell me A little bit more about your backstory. How did you come to the point where you wanted to start your own company?",
      "start": 146500,
      "end": 151900
    },
    {
      "speaker": "B",
      "text": "I have been fired twice and I've been laid off once, and it sucks every time. No, last week's pay. Have to buy back your laptop, lose your health care. I was like, shit, man. Like, all my friends in New York working at banks. Like, I can't believe I was just done with it. I was super done working for other people. I was so tired of having to take orders that I disagreed with. And my friend g a phone call. It changed my life. She said, hey, we're doing a Kickstarter for my wearable tech idea that I have. Do you want to help with it? I said, yeah, sure. I threw a launch party for her in Seattle. That changed my life. Because the mentorship I got there is completely life changing for someone, especially in their 20s, who's kind of directionless or feels like they're directionless. My best advice I can give people is, do you think someone's going to be a good mentor? Say, hey, do you have an hour a week that I can maybe spend with you and buy you lunch every week and ask you questions? And that's exactly what I did. I had three people that I bought lunch every week, and I asked them as many questions as I could. I've been working for myself for six and a half years, and it's the best gift I've ever given myself.",
      "start": 151980,
      "end": 211230
    },
    {
      "speaker": "C",
      "text": "How did you find the idea? How did you come up with the idea for Sheets and Giggles, and why did you decide to build it?",
      "start": 211390,
      "end": 216430
    },
    {
      "speaker": "B",
      "text": "After working in direct to consumer company and wearable technology, I really wanted something that was a direct to consumer brand. And I really wanted something I'd be proud of, Something that was in a big space I could carve my own niche in. So I actually started to, like, write my business model before I knew what the product was. For people who are thinking about starting a business, if you have a problem, other people have that problem too. I think that logic is great and I think it's fine. The question is whether or not they're willing to pay for a solution to that problem. And so I really encourage people to build a business model first that they really feel strongly about. That makes sense for them, their skill set, what they're best at in the world. I think business model first, product second. Or at least tweak your product to make sure it fits really well into the business model. Yeah, yeah.",
      "start": 216750,
      "end": 256410
    },
    {
      "speaker": "C",
      "text": "Instead of finding a problem, find what I call founder market fit, which is the business that fits the best within your existing skill sets. And that's actually something we talk about on our workshop that we run about how to find a million dollar business idea which you should join if you go to the link in the description. We talk about how to look at your own skills and your own passions to identify a potential problem that you can solve that you can turn into a million dollar business.",
      "start": 256490,
      "end": 281280
    },
    {
      "speaker": "B",
      "text": "It's really that simple. I think that people think that they have to have some like door buster, like blisteringly intelligent, novel, never before seen idea to start a business. And that's just not true. If people ask themselves what am I best in the world at? It's a great place start for like what business they should start.",
      "start": 282000,
      "end": 297900
    },
    {
      "speaker": "C",
      "text": "Yeah, that's what I always say too. Yeah, let's talk about that period of trying to figure things out. You had this idea for sheets and giggles. How did you validate the idea?",
      "start": 298140,
      "end": 306780
    },
    {
      "speaker": "B",
      "text": "The easiest way to do it is to build a brand identity map. That should be the first thing that everybody does actually is a brand identity map so they can really visualize and understand the company they're building. It's also a great foundation for everything that follows. So those are the three things. Brand identity map, financial model, business model. Then take those three things, or especially the financial model, send it to people you respect and say, hey, like, does this make sense? Am I forgetting about a cost somewhere? Am I charging too much? And if the people that you respect are like, hey, I looked at your financial model and yeah, it makes sense. Like I think you could, you could do this. Once you get that first validation, then you move on to trying to validate with actual customers. And my advice to everyone is to sell before you build. You can sell a wireframe, you can sell an idea, you can sell a signup form, an email capture. The simple steps are like build a tactile something that you can really promise them like a, like a, you know, sign up now and on May 1st when we launch, you'll get the best price that you'll ever lock into for the best set of sheets you'll ever have. For us, we were selling a set for $100, but if they signed up first, they get them for 69 bucks. And we ended up capturing 11,000 emails, 46% email capture. Then you send them surveys. What colors do you want? How much would you pay for this? You get them involved and if you get people feeling like they're building a product with you, they become emotionally invested in it. And if they're not going to buy it. They might share it with someone and be like, check out this cool new product company launched. That's the ultimate validation. So, yeah, then once you get those sales, you know people will pay for it. Yeah, yeah. Okay.",
      "start": 306940,
      "end": 393530
    },
    {
      "speaker": "C",
      "text": "So you have this validation.",
      "start": 393530,
      "end": 395970
    },
    {
      "speaker": "B",
      "text": "Yep.",
      "start": 396050,
      "end": 396610
    },
    {
      "speaker": "C",
      "text": "You have these people that are ready to buy. They're ready to buy. Then you parlay that into massive sales. Tell me about those moments and how you did that.",
      "start": 396610,
      "end": 404530
    },
    {
      "speaker": "B",
      "text": "If you want to do $100,000 campaign, for example, you need 30% of your total that you want your goal on day one. That's how the crowdfunding math works. Spikes, plateaus, little spike at the end. You then need on day one, $30,000, 300 customers at 100 bucks. Where do you get those customers from? You get them from an email list. You need 10,000 emails because an email list reasonably converts at about 3%. 2% if you're doing something wrong, 4% if you're doing something right. I did the calculations. I was like, all right, great. We're going to do $70 price on day one. One and a half units per order. I assumed so about $100. AOV and I assumed that if our 10,000 person email was converted to 3%, we get 300 customers, $30,000. We were on our way to 100,000. What ended up happening is our email was converted at 4.5%. We got 450 customers at $100. AOV did $45,000 on day one, and that snowballed into a $284,000 campaign. And I attribute a lot of that to, like, the content that we were sending out. It was so different than any email they'd ever gotten. I'll advise this to any founder listening is I had a one on one connection with thousands of people. I answered every single social media comment myself. I responded to every customer care email myself. I wrote every email, I wrote every word of copy for years. I can't recommend enough that founders take the time to engage with people extremely personally on a granular level. Yeah, yeah.",
      "start": 404610,
      "end": 487190
    },
    {
      "speaker": "C",
      "text": "So you launch, you have this massive launch. Then how do you get to 1 million a month? What's the special sauce of marketing?",
      "start": 487270,
      "end": 493350
    },
    {
      "speaker": "B",
      "text": "Things that work are like, I think everyone's gonna know works, right? Facebook, Instagram, Google, Amazon ads, all that has worked for years and it continues to work. And then the ones that have worked that have surprised me have been the podcast channels. I sponsor podcasts that I love, and I sponsor YouTube channels that I watch. If you are the founder of your company, and you love something. You love a radio station, you love a podcast, you love a YouTuber. Odds are the people who also like them are like you. They're going to resonate with your personality, and a lot of your personality is going to come out in your brand. So it all lines up. You have viewers of people who are like you, who are going to resonate with the brand that's like them, that watch a channel that you speak the language of that you can make inside jokes for that, you can write compelling copies. You with that, you can build a whole landing page in that brand voice. The conversion rate on that is insane versus every other page on our website. And same with the content. Make sure the content makes you laugh. Make sure the content's interesting to you. Betting is a crowded space and very boring.",
      "start": 493350,
      "end": 551100
    },
    {
      "speaker": "C",
      "text": "How do you differentiate?",
      "start": 551820,
      "end": 553059
    },
    {
      "speaker": "A",
      "text": "Yeah, exactly.",
      "start": 553059,
      "end": 553700
    },
    {
      "speaker": "C",
      "text": "How have you differentiated your brand and why has it made it successful?",
      "start": 553700,
      "end": 557100
    },
    {
      "speaker": "B",
      "text": "I use my friends as models not just because they're cheaper, which they are, but also because I don't think that you can fake friendship and chemistry. And so I always try to get stuff like that bleeds off the screen that just feels like you're in the room with us. And overall, the ideology is you can't be everything for everyone. So make sure that you're like, at least something for someone. If you're not pissing, like at least 20% of people off, you're probably not doing it right. For example, one rule we have is we never iron the sheets. The long and short of it is, if it's been done before, I don't want it, I don't want to do it. Yeah, yeah.",
      "start": 557100,
      "end": 590790
    },
    {
      "speaker": "C",
      "text": "Let's talk about how you came up with the name for Sheets and Giggles. How'd you come up with that?",
      "start": 590790,
      "end": 595700
    },
    {
      "speaker": "B",
      "text": "Well, so I have four rules to a good brand name. It has to be spellable, shareable, and memorable. That's one rule. Spellable, shareable, and memorable. Rule number two, it has to connote or denote what you do. Sheets and Giggles, we denote. We do. We sell bed sheets. Rule number three is that you have to have good SEO around it. Try not to pick words or combinations of words where they find not you or worse, a competitor. And rule number four is that if you're going to sell to Americans, you gotta have a dot com, because Americans don't buy from anything that's not a dot com. Those are my four rules. And if you have four for four, you're a bullseye. And if you're three for four, go forward. If you're two for Four, two and a half? Nope. Try again.",
      "start": 595780,
      "end": 633390
    },
    {
      "speaker": "C",
      "text": "That's epic.",
      "start": 633470,
      "end": 634150
    },
    {
      "speaker": "B",
      "text": "So yeah, Pat, very important question. Would you like to get in the bed with me?",
      "start": 634150,
      "end": 638030
    },
    {
      "speaker": "C",
      "text": "I don't know, man.",
      "start": 639070,
      "end": 640030
    },
    {
      "speaker": "B",
      "text": "We've been in bed together for five years.",
      "start": 640030,
      "end": 641630
    },
    {
      "speaker": "C",
      "text": "All right, interview from bed. First time for everything.",
      "start": 642430,
      "end": 645070
    },
    {
      "speaker": "B",
      "text": "I love it.",
      "start": 645470,
      "end": 646110
    },
    {
      "speaker": "C",
      "text": "Let's talk about the most bed thing you can imagine. What tools do you use for your business?",
      "start": 646110,
      "end": 649870
    },
    {
      "speaker": "B",
      "text": "So Shopify, big one of course. Google Analytics, Google AdWords. I love rebuy for in cart upsells. I love after sale for post purchase upsells. I really like Okendo for our reviews so I use Akendo. We use a lot of Shopify apps tracking more for order tracking site GPT, which is a chatbot for with AI that you can train on your website. I really like this kid that built this. He's one a solopreneur. You should interview him.",
      "start": 650190,
      "end": 676270
    },
    {
      "speaker": "C",
      "text": "Actually we have actually.",
      "start": 676270,
      "end": 677230
    },
    {
      "speaker": "B",
      "text": "Wait, the psychpt guy? Yeah. Oh, he's so nice. He's in our community, dude, he's super nice. Okay. He's like some 20 year old kid. Like just like dude, he really nailed it with that and I'm really happy for him. It's like 50 bucks a month and it cut down our customer care tickets by like 30%. It's also our best salesman because we tell the AI bot if you have a great conversation with people and it's able to judge if it's a good conversation, offer them code AI for 10% off. And it's one of our best little discount codes that we use. Yeah, it's great. Pays for itself. And then I use stock image for image creation as well as dall e. Use a little bit of chatgpt for blank page problem. I really obsess over copy so I try not to use ChatGPT for like copy copy. But as someone with ADHD, like the blank page problem can be really overwhelming sometimes and so it's really nice to solve that problem. Yeah, yeah. I usually just tear it up anyway. But yeah.",
      "start": 677230,
      "end": 727150
    },
    {
      "speaker": "C",
      "text": "Let's talk about team. What does your team look like?",
      "start": 727550,
      "end": 729870
    },
    {
      "speaker": "B",
      "text": "Well, we have on a daily basis about 40 people who touch the business. And that's everyone from logistics and warehousing to Amazon ad agencies to performance marketing agencies, affiliate agencies, full time folks in marketing and product and operations and customer care. We work with tons of folks. I think my favorite people that are part of our team are the folks at Mile High Workshop here in Denver. It helps lower our local recidivism rates and our local homelessness rates. And it's one of my favorite things that we do on our team is have those folks a part of it.",
      "start": 730110,
      "end": 760650
    },
    {
      "speaker": "C",
      "text": "Cool.",
      "start": 760650,
      "end": 761050
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 761050,
      "end": 761490
    },
    {
      "speaker": "C",
      "text": "Tell me about the day in the life of Colin. Day in the life of someone building multimillion dollar business from home.",
      "start": 761890,
      "end": 768930
    },
    {
      "speaker": "B",
      "text": "I work from bed all the time actually. This is definitely the office. But I think everyone can tell you four walls start closing in after a while when you're in the same space. So I love working from the river. I go out there with Harvey, my little Jack Russell. I sit right in the water up to my chest and I put my laptop on a rock. I set up hotspot and I just work from the river. And I do that probably like three days a week in the summer. Wow. And it is the best. It's the most healing, mental wellness thing that I can recommend from someone is to spend more time outdoors. Look, man, I'm slacking. I'm sending emails and I'm on the phone whether I'm in the water or I'm in my bed or I'm in the office, you know. So my job is mostly at this point, meetings, coordination, follow ups, analytics and reporting and then you know, content creation as well, which really helps to get into a new environment to be more creative.",
      "start": 769410,
      "end": 818920
    },
    {
      "speaker": "C",
      "text": "Last question. If you could sit on Colin's shoulder when you were working that full time job, when you were laid off, what advice would you give to him? What advice would you give to someone like that?",
      "start": 818920,
      "end": 827720
    },
    {
      "speaker": "B",
      "text": "It's not fun, shouldn't be glorified. But I would tell myself as a 25, 26, 27 year old, kindness plus hard work plus intelligence leads to good things and you're kind and smart. So keep fucking working hard and eventually it'll, it'll pay off. Stay with it. Yeah.",
      "start": 828030,
      "end": 846350
    },
    {
      "speaker": "C",
      "text": "Thank you, man.",
      "start": 846750,
      "end": 847430
    },
    {
      "speaker": "B",
      "text": "Dude, thank you for inviting me. This is super fun.",
      "start": 847430,
      "end": 849310
    },
    {
      "speaker": "C",
      "text": "This is amazing the company you built.",
      "start": 849310,
      "end": 850830
    },
    {
      "speaker": "B",
      "text": "Thank you.",
      "start": 850830,
      "end": 851390
    },
    {
      "speaker": "C",
      "text": "Follow this advice and you will have a multimillion dollar bed sheet eucalyptus company.",
      "start": 851790,
      "end": 856540
    },
    {
      "speaker": "B",
      "text": "It's very easy. Don't, don't let anybody tell you different. Super, super easy.",
      "start": 857340,
      "end": 861500
    },
    {
      "speaker": "A",
      "text": "All right guys, I hope you got some good nuggets from Colin's story that you can apply to your own business. But if you're feeling a bit stuck and maybe you don't have an idea yet or you just want to go deeper on how to actually make your first dollar. Well, I got something special for you. I'm hosting a free workshop for all of our subscribers where I'll be sharing how I built million dollar business on just two hours a day. I'll walk you through exactly how to find your own million dollar business idea, how to execute on it, and how to make your first dollar from it. It's all frameworks coming from personal experience because it's the exact path I took to build starter story and eventually quit my 9 to 5 just a few months after I started. So head to the first link in the description to save yourself a seat. I hope to see you guys in there. Much love and I'll see you in the next one. Peace.",
      "start": 861900,
      "end": 910200
    }
  ]
}