{
  "source": "/home/salouri/Projects/starter_story/transcripts/WctFUP4w0sc/WctFUP4w0sc_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "This guy built a million dollar SaaS in just 87 days. And the crazy part is he did it using a strategy that nobody is talking about. The productized SaaS.",
      "start": 320,
      "end": 11520
    },
    {
      "speaker": "B",
      "text": "The way we built SaaS is the way I think everyone should build a SaaS.",
      "start": 11920,
      "end": 15200
    },
    {
      "speaker": "A",
      "text": "Andre invited us into his house in Tampa, Florida to show us exactly how it works, how he got his first customer, and how he grew it to millions in ARR. But this story is not an overnight success.",
      "start": 15200,
      "end": 27200
    },
    {
      "speaker": "B",
      "text": "I was pretty much at the point of giving up.",
      "start": 27980,
      "end": 32220
    },
    {
      "speaker": "A",
      "text": "For months, Andre struggled to make any progress, burning through tens of thousands of dollars of his own money on developers and designers who couldn't deliver. Then, on the brink of shutting down the business, he discovered something that would change everything. So he relaunched the business and three months later, it was doing over a million dollars a year.",
      "start": 32300,
      "end": 53260
    },
    {
      "speaker": "B",
      "text": "The biggest secret to all this success is my.",
      "start": 53340,
      "end": 55580
    },
    {
      "speaker": "A",
      "text": "In this video, Andre will share his exact BluePR how to build, launch and grow a $2.4 million SaaS company from scratch. I'm Pat Walls and this is Starter Story.",
      "start": 56300,
      "end": 69720
    },
    {
      "speaker": "C",
      "text": "Thank you for having me, Andre.",
      "start": 72600,
      "end": 73960
    },
    {
      "speaker": "B",
      "text": "Absolutely, Pat, thanks for having me.",
      "start": 74120,
      "end": 75879
    },
    {
      "speaker": "C",
      "text": "Yeah. Tell me about who you are and what you built.",
      "start": 75879,
      "end": 77600
    },
    {
      "speaker": "B",
      "text": "Absolutely. So my name is Andre Heckel Jr. I've been an entrepreneur for the last seven years and most recently I've built an app called ListKit or SaaS. In 87 days, we grew it to a million dollars. ARR. Zero to a million from the launch of the actual SaaS. Yeah.",
      "start": 77600,
      "end": 91320
    },
    {
      "speaker": "A",
      "text": "Wow.",
      "start": 91320,
      "end": 91680
    },
    {
      "speaker": "B",
      "text": "First 87 days.",
      "start": 91920,
      "end": 92880
    },
    {
      "speaker": "C",
      "text": "Can you break down this business a little bit more? How does it work?",
      "start": 93280,
      "end": 96080
    },
    {
      "speaker": "B",
      "text": "Yes. So it revolves around cold email. And so cold email is you find someone's email address online and you send them a pitch either to sell your service or to get them on a podcast or a show like this. The type of people that use it are either salespeople or business owners themselves. We also have a lot of freelancers and solopreneurs on there that want to again reach out and make pitches to potential clients for their own business or agenc. Just within the first six months, we had our first 1,000 paying customers. And as of right now, almost a year into the business, we have over 1500 paying customers. And the pricing is really simple. It's $97 a month to get started and we have pricing that goes up obviously a couple hundred dollars for our more enterprise users.",
      "start": 96240,
      "end": 135340
    },
    {
      "speaker": "C",
      "text": "Yeah, let's dive a little bit deeper into the numbers behind this SaaS business. What are the numbers look like here?",
      "start": 135340,
      "end": 140340
    },
    {
      "speaker": "B",
      "text": "So, yeah, we started the business last July. Right now is June 2024. And we're about to just surpass $200,000 in MRR. The biggest secret to all the success, Co founders. I have four other co founders, I have a cto, I have a head of sales, and I have two guys that focus on marketing and ads. And then what the team, beyond the team of co founders looks like is we have 20 people in CS and in sales and then the rest of the team is on the developer team. The team cost is over $100,000. Total cost to grow the business, including ads and marketing and acquisition is anywhere from 150 to $175,000 a month.",
      "start": 140420,
      "end": 176760
    },
    {
      "speaker": "C",
      "text": "To maintain, you build this amazing SaaS business. But what's the timeline here? How do you get there?",
      "start": 176760,
      "end": 181580
    },
    {
      "speaker": "B",
      "text": "So I hit entrepreneurship as early as I possibly could, around the age of 16 or 17. And just like anyone else getting started with entrepreneurship and no money, you go with the service rep. And I built an agency business around that. We were primarily doing lead generation services for a really long time. That was myself, my cousin Dan, who's still a co founder at the businesses we run now, and Christian, who's also a co founder in List Kit and everything else we do. And we grew that business to 100k a month. To us, that was a massive success. But the problem we ran into is we couldn't scale it really past that. And that's when we partnered up with Cold Email wizard or Daniel Fazio, as everyone knows, and started Client Ascension. That helped people do the same things we did to go from 0 to $100,000 a month with our agency by using Cold email lead generation tactics that we used.",
      "start": 181580,
      "end": 226450
    },
    {
      "speaker": "C",
      "text": "You launched this agency and then you launched this coaching program. How does that lead you to building a SaaS business?",
      "start": 226530,
      "end": 231890
    },
    {
      "speaker": "B",
      "text": "Yeah, so SaaS is really interesting, right, because again, it take a lot of startup capital to start. So I think the approach is the only way to go about it. If you don't have startup capital and if you don't want to go the venture capital route, and what that is is starting with a product service. So on the front end it looks and feels like a SaaS where you go on the website and you order something and on the back end it's fulfilled manually by people. When we were selling a product service, you had to go through a manual onboarding process. So you just tell us how many leads you're looking for. 100 leads, 1,000 leads, 10,000 leads, and that submits an onboarding form to our team, then within 24 hours is being fulfilled behind the scenes and then it gets manually delivered to the customers. Because again, it's low cost. We didn't have to have any development fees. All we had to do was single out what we were already doing within our agency to build leads lists for our agency clients and just do that with a really fast turnaround time for our SaaS customers. And number two, it allows you to prove your idea out. We didn't necessarily know that if we built a SaaS that someone could go to and self serve that they'd actually want it that way or how they would want it or if the turnaround time mattered or if the cost mattered as much. So we gathered market research through that time and then number three, build cash flow. Right again, SaaS is expensive and rather than having to guess at what the product should look like, we knew exactly what it should look like. So we were able to build it a lot cheaper than most people would have to spend to build a SaaS that actually works.",
      "start": 232290,
      "end": 317370
    },
    {
      "speaker": "A",
      "text": "Yeah, guys, Andre is proof that you can build $1 million business idea with $0. Especially with this unique model of the product. Andre's business comes from the foundation of having a solid idea and solving the right problem. Now imagine there was a place where you could find this, the problems to solve, the blueprints to solve them, and real data from million dollar businesses started by regular people like you and me. Well, I made something cool for you. If you're actually serious about this, you can go to the first link in the description and you'll be able to download our free report of 50 solo developer business ideas that are making money right now. All right, let's get back to the interview and see how Andre actually built this business.",
      "start": 317370,
      "end": 357070
    },
    {
      "speaker": "C",
      "text": "Tell me the story about actually building this and hiring people to build it and your experience with that in the beginning.",
      "start": 357230,
      "end": 362490
    },
    {
      "speaker": "B",
      "text": "Yeah, we were doing the productized service and reinvesting the five to $10,000 we were making from that every month in the product development. But we've never developed the product. And so all that money was reinvested into developers and designers to build an app that never saw the light of day. It was very demotivating. Like I was pretty much at the point of giving up like this list kit thing. It's not working out. I know this idea can work, I just can't find someone to execute on the idea. And so funny enough, at the same time we're building client Ascension, which is our really nicely cash flowing business in the coaching space. And one of our students flew out to Tampa himself, Oliver. Shout out to Oliver was like, I Have the exact understanding that you need to see this thing through and actually build it. And within six months, that's when we launched. And as you've heard already, after 87 days of launching, we grew the thing a million dollars.",
      "start": 362490,
      "end": 414560
    },
    {
      "speaker": "A",
      "text": "ARR.",
      "start": 414560,
      "end": 414880
    },
    {
      "speaker": "C",
      "text": "Let's talk about that. That launch, that relaunch of list kit where you went from zero to a million in 87 days.",
      "start": 415820,
      "end": 421620
    },
    {
      "speaker": "B",
      "text": "Yes.",
      "start": 421620,
      "end": 422060
    },
    {
      "speaker": "C",
      "text": "What happened? How did that happen?",
      "start": 422140,
      "end": 423420
    },
    {
      "speaker": "B",
      "text": "We had a list of paying customers from coaching from our agency and from again the productized service. In talking to those customers, asking them, hey, what would you like to see in this final version of our SaaS? We've tweeted about it, we just told our story the entire time from when we started it as a product test service up to the point where we spent so much money and it failed and we were ready to quit to when we rebuilt it and relaunched. And so they, they've been around for the rollercoaster of a ride we had with the company and we had a product that they have been specifically asking for. So by the time we launched, we just sent a couple of emails, did a couple of live calls, put some tweets out, and everyone rushed to support us.",
      "start": 423740,
      "end": 461070
    },
    {
      "speaker": "C",
      "text": "Yeah, let's talk pricing. Pricing and SaaS. What's been your, what's been your approach or strategy around pricing?",
      "start": 461070,
      "end": 466910
    },
    {
      "speaker": "B",
      "text": "Yeah, so first, I mean, you're running a business that has to have some profit at the end of the day. So first you have to figure out your cost. We take the cost and then we go to look at what of our competitors charging. And then we're asking our customers, what do you about their pricing? What don't you like about their pricing? Because the other thing about SaaS is you're not starting from scratch. You're following other competitors and making small tweaks and changes to improve upon what someone else has already built. So with Liskit, it's just how many credits do you want? And we'll put a price per credit behind that. That's reasonable to you and your business.",
      "start": 466990,
      "end": 497290
    },
    {
      "speaker": "A",
      "text": "Yeah.",
      "start": 497370,
      "end": 497810
    },
    {
      "speaker": "C",
      "text": "Let's talk about growth. How did you go from zero to a million to over 2 million now, how did you grow this business?",
      "start": 497810,
      "end": 503610
    },
    {
      "speaker": "B",
      "text": "Yes. So I mean primarily through cold email, which is what our target market wants and that's what we provide leads for. And then number, number two, we've primarily grown now through ads. Ads really help you scale past a certain point in business. And number three, we've scaled through content marketing, affiliates, and through our existing product ecosystem that I've talked about before with our coaching Program and with our agency business.",
      "start": 503850,
      "end": 525750
    },
    {
      "speaker": "C",
      "text": "Yeah, let's dive a little bit into that cold email strategy. What did that look like for you when you were starting out?",
      "start": 525830,
      "end": 531630
    },
    {
      "speaker": "B",
      "text": "Yeah, so we were already good at cold email because that was our bread and butter. The problem is cold email really works if you're selling a high ticket agency service. And so what we were doing was instead of selling people on the product itself, we're selling them on 50 free leads and said, hey, if you respond to this email and tell us who you want leads of, we'll send you 50 leads from list Kit. And if they're good, let's talk about how you can get more. And that lead magnet in our cold email campaigns took off. And now you see all of our competitors doing the same thing.",
      "start": 531630,
      "end": 561290
    },
    {
      "speaker": "C",
      "text": "Let's talk about ads. You guys run ads. How does that look?",
      "start": 561530,
      "end": 564570
    },
    {
      "speaker": "B",
      "text": "So the problem with ads and running a sales team for SaaS is again, you're selling something that's low ticket. So what we did is we realized that people signing up for List Kit, not all of them knew how to use it properly. And so we came up with a setup offer where we would come into your business, set up a cold email system the same way we've set up our own system and give you the leads on a reoccurring basis. But the thing with ads is the creatives don't last very long as you start to scale. Like once you get past 300, $400 a day and spend, you really have to create new creatives. And so it's a mix of videos speaking direct to camera, talking about how this software can help with your cool email campaigns, or it can help you generate more leads. But a lot of them are just static images as well. So we're testing almost 20 new creatives every week. 10 different static images, 10 different variations of videos with different headlines, different copy, different people in the videos. Right. So we're always testing.",
      "start": 564570,
      "end": 618830
    },
    {
      "speaker": "C",
      "text": "Let's talk about free trials. You mentioned that you don't have a free trial. What's your approach and why?",
      "start": 618990,
      "end": 622670
    },
    {
      "speaker": "B",
      "text": "I just think it attracts the wrong buyer or person because they're not a buyer attracting freebie seekers. We knew people coming to our website, it's low ticket enough to buy and it's low commitment enough. And instead of a free trial, what we did is we added a money back guarantee. And so we could still frame it like a free trial, but collect money right away. I will say, however, with a free trial, it does make sense for some SaaS tools that monetize how many users they have on the platform, whether they can serve them ads, whether they can get data for more people. Right. But it didn't make sense for this kit.",
      "start": 622670,
      "end": 651730
    },
    {
      "speaker": "A",
      "text": "Yeah.",
      "start": 651730,
      "end": 651940
    },
    {
      "speaker": "C",
      "text": "You run this pretty big B2B SaaS business now. It started small, but now there's 40 people on the team. How are we able to hire 40 people and keep this profitable?",
      "start": 652170,
      "end": 660570
    },
    {
      "speaker": "B",
      "text": "Yeah. So when people hear 40 team members are thinking full time US employees that are getting anywhere from 50 to $100,000 a year. Right. For us, that would not be sustainable by any means. And so a majority of our team are either developers that are in countries like the Ukraine or customer success representatives that are in countries like Lebanon. They're the hardest workers I've ever come across. They're really good at speaking English compared to some other VAs, and it's cheap labor. You're paying anywhere from 1,000 to $2,000 a month to get someone full time from Lebanon who's as good as or better in my opinion than someone in the US that you might have to pay anywhere from five to $8,000 a month.",
      "start": 660650,
      "end": 699700
    },
    {
      "speaker": "C",
      "text": "Let's talk about competition. Clearly you're not the first business to be doing helping with cold email and lists and all that. What does the competition look like for list kit?",
      "start": 699700,
      "end": 708160
    },
    {
      "speaker": "B",
      "text": "Yeah. So first I have to say we love our competition. The way we built SaaS is the way I think everyone should build a SaaS is find something that's already proven. Proven in the fact that they have either a ton of users, they're a publicly traded company that's doing very well with billions of dollars in revenue like ZoomInfo, and find out what do people like about them, but what don't they like about them? Where are the bottlenecks? And because I was a user of Apollo already, the one thing I knew that I did not like and other people also did not like after speaking to them was the fact that Apollo leads were not verified. And so that presented an opportunity to say, okay, we can build exactly what Apollo has, but change this one thing that people really care about and that's how we built this kit.",
      "start": 708550,
      "end": 749450
    },
    {
      "speaker": "C",
      "text": "Yeah. As I know you mainly operate this business, but you have four other co founders. Can you explain that?",
      "start": 749450,
      "end": 754410
    },
    {
      "speaker": "B",
      "text": "Yeah. This is like I was saying earlier, probably our biggest secret on how Liskit has been so successful is because we have the best team of co founders. So I'm technically CEO. I'm more of the team leader, essentially. But I have Daniel and Christian who operate as CMOs of the business. They're marketing geniuses. They do the Funnels, they do the ads, they do all the content, which I want no part of. Not just because I don't want to do it, but because I'm not the best in the world at doing it. And I think they're the best in the world at doing it. We have the best salesperson as a co founder. I've never been on a sales call, but we have Dan who crushes at sales and he leads the sales team better than I've seen anyone lead a sales team. And then Oliver, who again is the person that came into this business when we were at the lowest of lows and actually made it work. And so if you're looking to put a team together of co founders, make sure before anything else, you guys have complementary skill sets to line this up with a business, especially a SaaS, you need marketing, you need sales, you need technology like cto, developer type work, and then you need a team leader to bring it all together. And that's exactly how we built our co founder team. But it's not always pretty. I mean, there's always debates and things that come up amongst co founder teams that you just have to sort out, just like any relationship. But in regards to finding a team of co founders, first you need to know that you need a co founder. What's your goal at the end of the day? Is it to build a massive company or to stay small and to. And that's something that people are content with, which is cool. And then figure out what skills you have and what skills you need to fill the gap with and find people who have those skills. If you need people with marketing skills, go to communities or places on the Internet that are full of good marketers and start to connect with people. So I'm really an introvert at the end of the day, but you have to in this situation, be an extrovert, meet everyone and see if your core values align. And most importantly, like I was talking about earlier, make sure your vision for whatever it is you're building aligns. Because if they can't see the same vision that you're seeing, that it's not going to work out because you're going in different directions.",
      "start": 754490,
      "end": 871850
    },
    {
      "speaker": "C",
      "text": "So we talked about competition. How do you not only build something as good as a competition, but beat the competition.",
      "start": 871930,
      "end": 877290
    },
    {
      "speaker": "B",
      "text": "One of the things that we do really well at List Kit is every single customer that purchases Liskit, we offer them to get on a one on one onboarding call. When I talk to a customer, I simply ask, why did you sign up for this what were you hoping to use this to achieve? And are they getting that or are they not getting that? And if they're not getting that, figure out what you can build either on the product side or what you can do better on the customer support side to make sure that they get that not just one time, but consistently over time. Right. Because SaaS is a game of keeping churn low. So we're always talking to our customers, I think more than any other SaaS company out there, by offering to get on a one on one call with them right in the beginning. And that's how we stay ahead of the competitors.",
      "start": 877690,
      "end": 918720
    },
    {
      "speaker": "C",
      "text": "What does a day in the life look like for you? Just like a normal day in the life.",
      "start": 918880,
      "end": 922160
    },
    {
      "speaker": "B",
      "text": "Yeah. So I'm big on routine and so every day when I wake up, I go for my morning walk, specifically to Starbucks and back, and that's about a mile walk. And I think just getting outside, listening to the Bible, getting my black coffee, really meditating on what the day is going to look like is so important. And once I get back, I'm pretty much locked into meetings or deep work up until lunch. And then I like to go out to lunch with some of my co founders that live here in Tampa. I think it's nice to have that in person connection and interactions with either team members or co founders. It's so important. I'll work out either at my apartment gym, or I'll either go play basketball or pickleball. And on weekends I like to play a lot of golf. And then for the rest of the night, I'm either continuing to work or spending time with my girlfriend or talking to family members and pretty just simmering down and getting ready for the next day.",
      "start": 922160,
      "end": 970500
    },
    {
      "speaker": "C",
      "text": "Do you have any advice for young Andre or for young entrepreneurs out there?",
      "start": 970500,
      "end": 975940
    },
    {
      "speaker": "B",
      "text": "I think it's a patience game. Right. I told you guys, I've been in this entrepreneurship game for seven years and the first four or five years I would not call it success by any means. The biggest piece of advice I'd have for my younger self is it's a game of staying very consistent over a long period of time. And when times are not good, get even more consistent and get even more intentional about your action items. But when times are working out and things are going well, double down even more. Because I think it's really easy for entrepreneurs who struggled for a really long time to as soon as they start seeing success, kind of back off and stop doing the things that got them there in the first place. And if you do that, you're going to fall right back into where you were before. You have to stay consistent and you have to do it over a long period of time, whether the results are good or whether they're not. It's an inputs game. I like to say over an outputs because you can control the inputs. You can't always control the outputs. And so do what you can control and let, I always say, God take care of the rest.",
      "start": 976100,
      "end": 1034050
    },
    {
      "speaker": "C",
      "text": "What do you think is one of the, you know, the biggest secrets to be able to unlock success or unlock getting to that next level?",
      "start": 1034290,
      "end": 1040600
    },
    {
      "speaker": "B",
      "text": "Yeah. So I think it's really important to always be investing in yourself, whether it be through personal development or coaching. And I know this is like a cliche thing to say and I run a coaching program, but I really do believe in this business model. So some of the guys that I'm constantly learning from are Patrick Bet, David, Gary, Vee, Taylor Welch, Cole Gordon. All the guys I've mentioned to you already at Mylet. I only know so much. So why not go to the guys that have already figured it out themselves and ask for their advice on ways about doing things. And so I always hold myself very accountable to improving and learning something new every single day that I can then take to my team and pass it down.",
      "start": 1041069,
      "end": 1077390
    },
    {
      "speaker": "A",
      "text": "Yeah.",
      "start": 1077470,
      "end": 1077950
    },
    {
      "speaker": "C",
      "text": "All right, man. Thank you for having me. It's amazing what you built.",
      "start": 1078270,
      "end": 1082350
    },
    {
      "speaker": "B",
      "text": "Appreciate you, man. Yeah, I'm proud about it and it's just got to keep it going now.",
      "start": 1082430,
      "end": 1086150
    },
    {
      "speaker": "C",
      "text": "Yeah, man. Follow this advice and you will have a multimillion dollar SaaS business. Good luck, guys.",
      "start": 1086150,
      "end": 1092170
    },
    {
      "speaker": "A",
      "text": "Hey, guys, Pat here. I hope you enjoyed this story and I hope it inspires you and shows you that you could start something similar. I think the coolest part about his story is this kind of productized idea that he did. He had clients that he was serving and then he found a business idea that he could productize from those services. If you're curious about doing something similar but you're still looking for an idea, well, you can go to the first link in the description and download our solo developer, Deep Dive for free. It breaks down 50 different solo developers making money right now. Their business models, how they price their products and how they grew those to millions in revenue. Just click the first link in the description and I'll see you guys in the next one. Peace.",
      "start": 1092640,
      "end": 1131310
    }
  ]
}