{
  "source": "/home/salouri/Projects/starter_story/transcripts/vedkm3ZmHIE/vedkm3ZmHIE_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "This guy is the highest paid solopreneur on the Internet. Meet Brett Williams, a dude who went from working a normal job to making over $2 million a year with a side project. He has zero employees, zero contractors, and only works six hours a day. When I first came across his story, I thought he might be lying. But then I did some more digging, studied his business, and even flew out to Arizona to meet him in person. What I learned blew my mind. Brett's nearly $2 million business is no accident. It has nothing to do with luck, but rather decisions he made while building his business. And today, in less than 12 minutes, I'm going to break down the five key steps that took Brett from an average business idea to a $1.8 million per year solopreneur. Welcome to the playbook. So Brett starts out like any normal guy, working an average 9 to 5 for years. He's a graphic designer working on landing pages, logos, brand designs. Simple work that pays the bill. Any aspiring entrepreneur. Deep down, he's thirsty for something more, Something he can truly own. Then one day, everything changes when he comes across a peculiar website. It's a subscription service offering, quote, unlimited graphic design for businesses. Instead of charging by the project or by the hour, this agency charges a recurring flat subscription fee for unlimited graphic designs. And by the looks of it, they're doing really well. They even have a brick and mortar location with a few employees. And this is the moment that Brett gets his business idea. He decides he'll do the same thing. He'll start his own agency. But instead of getting on sales calls with clients, they can just purchase his services directly on his website. But most importantly, instead of building a whole team, he'll just do it himself as a side project to earn a little extra income. Twelve hours and $29 later, Brett puts up a simple landing page and calls it design Joy. And within 24 hours, he gets his first paying client. That's pretty fast, right? Well, that's the first key step in Brett's genius playbook. Step number one, demand based pricing. The hardest thing to do in business is get your first paying customer. For most people, it takes months to finally get that one person to hand their money over to you. And honestly, most people quit before they even get their first customer. But Brett skips this whole problem by making one key decision. He grossly undercharges for his service. See, when he throws up that landing page, he sets his price at $449 a month. Yes, you heard that right. Unlimited Design requests for 449 bucks. This price is too good to be true. But guess what? It gets him. His first customer in less than 24 hours. And that's the genius behind it. Of course, this business is not scalable at that price point. But Brett understands the power of speed and momentum. When you're starting a business, instead of waiting around for months for someone to pay him $5,000 a month, he just throws himself into the fire. And this is where Brett succeeds. Where most others fail. He's willing to put his ego aside so he can put in thousands of reps, even though he's basically working for free. And these reps are the ones that eventually turn Brett into a world class designer. His niche starts to notice, and then his services become more in demand. And when the demand increases, he raises his prices. He goes from 449 to 1000dol, then to $3000 a month, then to $5000 a month, and now he even charges $8000 a month per client. Today he only needs 16 clients paying $5000 a month to make about a million dollars a year. And this is all because he was willing to undercharge for his service and willing to do the work. And that brings us to step two of the playbook Boundaries. So at this point, Brett's put in the reps, he's raising his prices, and now he has customers coming out of his ears. But this is actually a problem because Brett is a one man band. He finds himself working 16 hour days on the verge of burnout. The solution? Hire more people. Right, But Brett doesn't want to hire people. He wants to be a solopreneur. So he comes up with a creative solution. He decides to break the rules by creating two boundaries. Number one, clients must submit design requests asynchronously via a Trello board. And number two, clients can only have one design request at a time. No calls, no meetings. All client requests must be defined in writing. And once the client has submitted an active request, they're not allowed to change it or submit another one. This gives Brett a few days to deliver the work, and once completed, then the client can submit another request. Because of this, clients spend more time making sure their requests are fully fleshed out and complete, which actually leads them to sending less requests. And it saves both of them countless hours of meetings. This is what I call boundaries. He doesn't do this because he's an asshole. He does it because he has to. Brett creates these boundaries to protect his precious time so that he can spend his time doing the Thing. He loves creating designs. Without these boundaries, he wouldn't be able to make over a million dollars with zero employees and he'd probably lose his sanity and completely burn out. I imagine some clients don't like these boundaries, but that's fine. There are many that actually do, and those are the ones that he works with. And that brings us to the next key move in Brett's playbook. Step number three, the $500 client. There are two types of clients. $500 clients and $5,000 clients. $500 clients are cheap. They'll nagging requests, ask for refunds, and they don't make much money themselves. $5,000 clients are rich. As long as you deliver, they won't bother you much. You'll always get paid, and they won't churn after one month. When Brett starts his business, yes, he attracts $500 clients. But once he pays his dues, he quickly moves to $5,000 clients. And you're probably wondering, who are these clients that are paying him $5,000 a month? The answer is businesses that wouldn't blink twice if they saw a $5,000 per month invoice. See the clients DesignJoy attracts see Brett's service as a steal. Here's why. When looking for graphic design talent, these companies have a few Options. Option number one is hire a $200,000 per year graphic designer on payroll. It'll take months to hire them and they might turn out to be lazy. Option number two is spend a bunch of money on a fancy agency that will charge a per project fee that might be in the range of 30 to $40,000 and take weeks, if not months to implement. Option number three, sort through hundreds or thousands of cheap web designers on platforms like Upwork or Fiverr and find a needle in a haystack. Or they could hire Brett, a proven graphic designer who will turn around work in 48 hours, all with the simple click of a button. At $5,000, this is a no brainer. Plus they can cancel the service whenever they want, just like a Netflix subscription. Hiring a great designer is an annoying problem for companies. And Brett provides a simple are clearly willing to pay for. But it's not just about the client's Brett attracts. And that brings us to our next step. Step number four, High demand, low touch. Productized services are amazing, right? You get paid for your output rather than your time. Because of this, everyone and their grandma is starting one. But the truth is, productized services will not work for every kind of service. And this is the reason why Brett makes millions when most other people make nothing. And it has to do with one word, profit. As you know, the profit equation is revenue minus expenses equals profit. But let's double click on what these look like for DesignJoy. On the revenue side, Brett's doing great. And that's because Brett provides a service that is high impact. A website is often the first impression that a customer will get of a startup. And a really beautiful website might be the difference between success and failure. For example, a high or a low conversion rate. Companies must make sure they get this right, and that's why they're willing to pay Brett a ton of money for his service. On the expenses side, Bret is also crushing it. Bret has almost zero actual dollar expenses because he's a solopreneur. His only real expense is his time. But Brett only works six hours a day, which isn't bad considering he has over 16 clients at any given time. And that's because website design and branding is relatively low touch. Brett can turn around a world class landing page in a couple hours. That's mostly thanks to his years of experience, but also because website design is one of those things that you build once and you don't really have to touch it for a while. That is the reason DesignJoy is so profitable. Brett picked a service that is both high demand and low touch. Honestly, I don't think this will work as well for other services. For example, a productized bookkeeping or video editing service would definitely not be as profitable because these services are less in demand and also more costly and time consuming to fulfill. And that brings us to the final piece of the playbook. Step number five. Build once, sell forever. The only problem with a productized service is that no matter what, you're still essentially trading your hours for dollars. And if you want to truly get rich, you need to find a way to scale those dollars with out scaling your time. And this is the final key move of Brett's playbook. In 2019, he spends six hours putting together a product called Scribbles. It's a downloadable collection of templates that other designers can use to spice up their projects. He prices it at $4.99 and it gets downloaded over 25,000 times. But why is this a genius move? Well, Brett's been spending years building up his bank of knowledge and experience, both on how to design amazing websites and how to build a great productized service along the way. And Brett finds a way to monetize this. He turns his knowledge into a purchasable product that other designers can use to improve their own business. Then a few years later, he takes it to the next level. He creates a course called Productize Yourself that helps other designers start their own productized services. And he charges a lot more than five bucks for this one. Today, these info products make up 29% of his income, and he doesn't have to trade his hours for these dollars because he's already put in the work. This has not only diversified his income, but it's allowed him to work less and probably sleep better at night. But what I love about Brett is that he doesn't just sell courses. He continues to build his business, serve clients, and put in the reps on design Joy. It's not luck or coincidence that Brett is one of the highest paid solopreneurs in the world. Whether he realizes it or not, this is a genius playbook that I think anyone doing any kind of business should study. I spent hours researching Brett's business. I flew out to Arizona to meet him and I just really love his business and really wanted to share it with you guys. I hope you learned something from this that you can apply to your own business or helps you pick the right business idea that you want to work on. Thanks for watching the playbook. I'll see you in the next one.",
      "start": 160,
      "end": 693710
    }
  ]
}