{
  "source": "/home/salouri/Projects/starter_story/transcripts/6iqo7lNR_m0/6iqo7lNR_m0_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "This is Jeremy, a guy who makes over $5 million a year selling toothpaste online. And the crazy part is he started this business from a van.",
      "start": 240,
      "end": 10400
    },
    {
      "speaker": "B",
      "text": "I was just kind of down on my luck, like wanted to reset my life, sold all my belongings, quit my job, bought this like $2,000 van on Craigslist.",
      "start": 10720,
      "end": 17680
    },
    {
      "speaker": "A",
      "text": "I flew out to his warehouse in California to get his story and ask him how he got his first sale and the marketing strategy he used to go from $5,000 a month to $500,000 a month.",
      "start": 17680,
      "end": 29360
    },
    {
      "speaker": "B",
      "text": "Getting good at marketing, Just go nuts.",
      "start": 29440,
      "end": 32660
    },
    {
      "speaker": "A",
      "text": "Jeremy started his journey trying tons of different business ideas, but none of them made any money. Then one day he discovered a secret that led him to making $5,000 in a single day.",
      "start": 32660,
      "end": 45340
    },
    {
      "speaker": "B",
      "text": "What we've always strived for is, and that's where you could start to like make more money than E Comm.",
      "start": 45340,
      "end": 50140
    },
    {
      "speaker": "A",
      "text": "In this video, the van man breaks down how to find new million dollar product ideas. His simple blueprint to generate a million dollars a month and the number one platform he would choose if he had to start all over, I think is.",
      "start": 50140,
      "end": 62910
    },
    {
      "speaker": "B",
      "text": "The best place to start.",
      "start": 62910,
      "end": 63830
    },
    {
      "speaker": "A",
      "text": "I'm Pat Walls and this is starter story.",
      "start": 63910,
      "end": 67110
    },
    {
      "speaker": "C",
      "text": "Jeremy, right?",
      "start": 69590,
      "end": 70230
    },
    {
      "speaker": "B",
      "text": "Jeremy.",
      "start": 70230,
      "end": 70670
    },
    {
      "speaker": "C",
      "text": "Yeah, yeah, thanks for having me, man.",
      "start": 70670,
      "end": 71990
    },
    {
      "speaker": "B",
      "text": "Tell me a little bit about what.",
      "start": 72070,
      "end": 73550
    },
    {
      "speaker": "C",
      "text": "You built and who you are.",
      "start": 73550,
      "end": 75110
    },
    {
      "speaker": "B",
      "text": "My name's Jeremy, also known as Van man online. In 2021 we started a natural alternatives business with toothpaste and balms. We try to make natural alternatives to everyday products like a simplified van life version of a product. We started just like a $5,000 month, I think our first month and then we've had like our first million dollar month. We did over 5 million last year.",
      "start": 75110,
      "end": 95000
    },
    {
      "speaker": "C",
      "text": "So you started the Van man while you're working a full time job. Can you tell me more about that?",
      "start": 95240,
      "end": 99480
    },
    {
      "speaker": "B",
      "text": "So it started just kind of down on my luck, like wanted to reset my life, sold all my belongings, quit my job, bought this like $2,000 van on Craigslist. Only spend time working, trying to like really get my energy back that I lost from these startups. I had an account called Van man on Twitter so I would post about random things, like health things. Sometimes I got big into like anti fluoride. So I bought some fluoride toothpaste on accident. I just wanted to like swear off toothpaste. So instead of like making my own, I just bought a box of baking sod and like dip my toothbrush in and just brush with baking soda. Baking soda is like harsh. It's super salty. So after a while I just started adding stuff to it. And like, all the while I was documenting this on Twitter, people are like, well, I'll try that, I'll try that. And then, oh, I have like a product here.",
      "start": 99800,
      "end": 137980
    },
    {
      "speaker": "C",
      "text": "So you're living at a van and building an audience. How do you come up with the idea to build this?",
      "start": 137980,
      "end": 142340
    },
    {
      "speaker": "B",
      "text": "I was just scrolling on Twitter and I saw like Arnold Schwarzenegger video where he puts the egg in the protein shake. I started tweeting about that, like, maybe eggshells are good for your teeth. Found eggshell powder, started putting that in the tooth powder. I really like that. I launched it and we sold like a couple hundred dollars. Hour from there. Was just trying to take each part of, like, product that I use, that I use myself and just replace it with something well thought out that's like made with animal products.",
      "start": 142420,
      "end": 166000
    },
    {
      "speaker": "C",
      "text": "What would be your like, number one and number two, biggest products?",
      "start": 166080,
      "end": 169280
    },
    {
      "speaker": "B",
      "text": "Number one is a talent Honey balm for sure. That was like the one that set it off. I was just blown away. But it just like kept coming, kept coming. The reviews are going nuts and people just keep sharing it for no money. Like they're just showing it because they loved it so much. And like, that was huge. But the second product, I think mint bone toothpaste. That's like our second best seller now. But yeah, we're trying to get soap out soon. I think that'll be like a top seller.",
      "start": 169520,
      "end": 189110
    },
    {
      "speaker": "A",
      "text": "Jeremy is proof that a simple idea can turn into millions of dollars. But his success has nothing to do with luck. It came from having the right information and knowing what problems were worth solving. Well, imagine there was a place that helped you find this. The problems to solve, the blueprints to solve them, and the strategies that turn simple ideas into million dollar online businesses. At Starter Story, we have a library of over 4,000 case studies and business idea breakdowns, all backed by data from real entrepreneurs. So if you're serious about building a profitable side project, head to the first link in the description. And we're going to give you $99 million problems worth solving so you can find an idea and get started on your journey. Much love and hope you guys enjoy the rest of the interview. Peace.",
      "start": 189820,
      "end": 236460
    },
    {
      "speaker": "C",
      "text": "All right, tell me about where we are right now.",
      "start": 236700,
      "end": 238860
    },
    {
      "speaker": "B",
      "text": "This is where all the products get made. This is Van man headquarters in San Diego.",
      "start": 238860,
      "end": 242780
    },
    {
      "speaker": "C",
      "text": "So you actually create all the product and package it and ship it all from here?",
      "start": 242860,
      "end": 247820
    },
    {
      "speaker": "B",
      "text": "Yes, everything's handmade here. The tallow is like scooped in by hand with a spoo. It has been since like day one. And then I don't See any change because we just gotta do it by hand. I think we'll just keep doing it by hand for forever. But yeah, everything's made here and ships out of the same building.",
      "start": 247820,
      "end": 261960
    },
    {
      "speaker": "C",
      "text": "On a given average day. How much product are you creating and shipping outta here?",
      "start": 262040,
      "end": 266080
    },
    {
      "speaker": "B",
      "text": "We ship about 500, 600 orders a day. When it's going good, could be there's spikes and then downturns too. But yeah, it's 5, 600. Yeah.",
      "start": 266080,
      "end": 274360
    },
    {
      "speaker": "C",
      "text": "So you have this toothpowder, you put it together. How do you get your first customer?",
      "start": 274520,
      "end": 277760
    },
    {
      "speaker": "B",
      "text": "It kind of happened accidentally. It was like more tweeting along the way, building the product. As soon as I launched it, it was in 20min. It was like mostly sold out. People were already in a community that I was a part of. So it was like selling to that community that all kind of lived in that same paradigm. Like, of course eggshells are good for you. Cause we're already in this animal based paradigm. So it was like the customers taught me this knowledge and then I gave them this product almost.",
      "start": 277760,
      "end": 298580
    },
    {
      "speaker": "C",
      "text": "Do you remember how many sales you did that first day you put it up on Shopify?",
      "start": 298580,
      "end": 302660
    },
    {
      "speaker": "B",
      "text": "I think it was less than 100 tooth powders. I just made a big batch. I thought I was gonna sell like 5, 10, 15. I think we sold about 100 of them. Something like that.",
      "start": 302660,
      "end": 311320
    },
    {
      "speaker": "C",
      "text": "Yeah. What was your schedule like? How hard were you working during those days?",
      "start": 311320,
      "end": 314360
    },
    {
      "speaker": "B",
      "text": "Try to get up as early as I can. Like sometimes I'll get up at like 7, 6. Just melting it all down, getting it like spinning. Because we have to spin it for a long time to get the honey in before it's too cold. Some days would be like 12 hours and then the next day would be nothing, another 12 hour day. So it was like definitely haphazard. But my hands were just from holding the spoon and like putting it in there. Like it just like, yeah, excruciating after a while, doing the same thing.",
      "start": 314360,
      "end": 335520
    },
    {
      "speaker": "C",
      "text": "Controversial marketing.",
      "start": 335600,
      "end": 336800
    },
    {
      "speaker": "B",
      "text": "Yeah, so it was like it's kind of just viral posts. Like I found like the most divisive posts on Instagram are the ones that like generate comments and traction in Instagram. Then it gets shared, it gets serviced, everybody Instagram posts and emails. Like, I didn't think email marketing would do much, but email seems to be a lot better than I thought. And then I tried to do like meme marketing. Like a picture of Mel Gibson talking to Mark Wahlberg. And then I just like write what the voice would be. That got a lot of traction. So like saying what I want to Say, but with a recognizable face, with a meme that makes it relatable and shareable.",
      "start": 336960,
      "end": 366100
    },
    {
      "speaker": "C",
      "text": "Yeah, meme marketing.",
      "start": 366100,
      "end": 367380
    },
    {
      "speaker": "B",
      "text": "Yeah. It's kind of everything nowadays.",
      "start": 367380,
      "end": 369500
    },
    {
      "speaker": "C",
      "text": "And, you know, it's a big uptick in sales when something does well there.",
      "start": 369500,
      "end": 372350
    },
    {
      "speaker": "B",
      "text": "Yeah. Like, you could see it on Instagram. Like, I'll post something, and then, like, yeah, the sales just go nuts. It's crazy because it's just, like, five minutes of work. But, like, sometimes you're browsing for three or four days to try to find a good thing to put on getting good at. Like, me. Marketing isn't just, like, thinking of a meme for 20 minutes a day. It's like being perpetually online. That picture of Mel Gibson and Mark Wahlberg was like, a big UFC fight. Getting that the next day, when it's fresh in people's mind, I think that's big. Is like getting current events and turning them into memes and then relating it back to a product. Probably the three things that I try to do. I guess if I was to break it down.",
      "start": 372350,
      "end": 401460
    },
    {
      "speaker": "C",
      "text": "All right, let's talk about product expansion. You start with this toothpaste. What do you build after that? And then what are all the products that you've created?",
      "start": 401460,
      "end": 408060
    },
    {
      "speaker": "B",
      "text": "So now we're just, like, in the bathroom, focus kind of on hygiene products. So we have deodorant, mouthwash, hair oil, and then we're coming out with soap soon. And just kind of, like, finish out, like, the hygiene products, then go into, like, I want to release, like, food. Sell our own tallow, get our own bee farm, sell our own honey. Sort of, like, bridge the gap to fixing, like, restaurants, like, where you could actually go out to eat and get, like, a good meal. Every product we've had is, like, done pretty well, so we haven't, like, had to discontinue or anything. And it's now, like, I'm just trying to focus on what's. What's next and how we can get there faster.",
      "start": 408060,
      "end": 436760
    },
    {
      "speaker": "C",
      "text": "And have you noticed that new products have expanded your revenue? Like, your existing customers want to buy all your products?",
      "start": 436920,
      "end": 442920
    },
    {
      "speaker": "B",
      "text": "Yeah. So, like, that's the thing. Like, the average order goes up. Like, when you get. Most people are buying, like, the toothpowder is, like, under 20 bucks. Mouthwash is under 20 bucks. But then when you get five or six products that are under 20 bucks, then you get the bigger orders, and that's where you could start to, like, make more money than Ecom. Because you get higher average orders. Your shipping is going down, the processing is going down to ship the Order getting to that point was when like we actually started to have free cash flow. Like in the beginning it was just like you're not making much money because you're making these things so slowly. You're buying ingredients in very small amounts and then it just kind of like grows. Where you're buying in bulk, you have other people making it. You get some little tools that help you make it faster.",
      "start": 442920,
      "end": 476150
    },
    {
      "speaker": "C",
      "text": "What's the vision for Van Man? Where do you see this going in 5, 10, 20?",
      "start": 476230,
      "end": 480550
    },
    {
      "speaker": "B",
      "text": "Yeah, 40 years. So I think we have like a unique position where we strive for like lifetime value, but we get like almost 40% of the customers that buy something come back. That's like what we've always strived for is like customer service. Like, if you have any problem at all, we're going to try to make it go away 100%, like immediately. And then we sell a lot of bison fat and we sell a lot of cow fat where we can turn that into going backwards. Like owning our own cows, owning our own bison, and starting to like offshoot more products from those animals themselves, like starting to sell milk or starting to sell like meat. We can make more money per animal. We take way better care of the animals. And the final, like, product of meat, we could almost sell it for nothing because we've made enough money to not even have to worry about what we get for the meat. That's sort of like the goal is delivering premium products, allowing for premium care of the animal. Premium cuts of meat for like Walmart prices is like kind of. The goal is extremely affordable, high quality meat and eggs and dairy and everything.",
      "start": 480630,
      "end": 531259
    },
    {
      "speaker": "C",
      "text": "So what does a day in the life look like for you nowadays?",
      "start": 531419,
      "end": 533819
    },
    {
      "speaker": "B",
      "text": "In the morning you just come in, try to make sure there's no like fires that you got to put out. Just kind of do a roundabout of like the ingredients, make sure we're not like running out of anything. And then a lot of time is just being online, commenting, answering DM's emails, trying to come up with different posts that I think resonate as soon as I put the post up, then just kind of being there in the comments for the next few hours. I think that's a huge portal. You don't want to delegate that. Like any time, that's when you're getting the pulse of what everyone thinks of everything that you're doing. Basically, yeah.",
      "start": 534059,
      "end": 560940
    },
    {
      "speaker": "C",
      "text": "If you could sit on Jeremy's shoulder when you were starting out, when you're in the van when you were broke, what would be your advice?",
      "start": 561020,
      "end": 568140
    },
    {
      "speaker": "B",
      "text": "I think Etsy is the best place to start. You could browse on Etsy for product ideas, put your own spin on it and sell it right back on Etsy if you got a couple dollars like test ads. I think you should just always be testing ads on different products and then you find that one winning ad that could float your next month and then yeah, just never stop because I think some people get a couple of failures and then they finally give up or they get like a wife and then they just accept their job. But like this is for me like just never, never accept that life and just try anything to get out. And then once you get out you have like your whole life to live. I feel like.",
      "start": 568300,
      "end": 598770
    },
    {
      "speaker": "C",
      "text": "All right man, thank you so much. That was great.",
      "start": 598770,
      "end": 601650
    },
    {
      "speaker": "B",
      "text": "Yeah, that was fun.",
      "start": 601730,
      "end": 602770
    },
    {
      "speaker": "C",
      "text": "Follow this advice and you will have a multi million dollar company selling tallow powder. Peace Talabom.",
      "start": 603110,
      "end": 611190
    },
    {
      "speaker": "B",
      "text": "Yeah.",
      "start": 611190,
      "end": 611670
    }
  ]
}