{
  "source": "/home/salouri/Projects/starter_story/transcripts/BaWUPamqWlA/BaWUPamqWlA_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "I built a 17k MRR SaaS with less than 100 followers on X.",
      "start": 240,
      "end": 4480
    },
    {
      "speaker": "B",
      "text": "A few weeks back, I got a cold DM from a guy named Diego. He said, hey, I got a story for you. He told me about his successful app and how fast it grew, but when I checked his X account, he only had 70 followers.",
      "start": 4880,
      "end": 19120
    },
    {
      "speaker": "A",
      "text": "I think anyone can build a successful business without an audience.",
      "start": 19280,
      "end": 22560
    },
    {
      "speaker": "B",
      "text": "I couldn't find him on YouTube or TikTok or Instagram, so I asked, hey, how did you do it? And what he shared blew me away.",
      "start": 22720,
      "end": 31490
    },
    {
      "speaker": "A",
      "text": "I call it the Reddit Marketing Playbook.",
      "start": 31810,
      "end": 34050
    },
    {
      "speaker": "B",
      "text": "And I just had to know more. So today I brought him onto the channel to break down how you can use Reddit to validate, market and make money from any idea. All right, let's dive in. I'm Pat Walls and this is Starter. All right, Diego, welcome to the channel. Tell me about what you built and what's your story.",
      "start": 34210,
      "end": 58250
    },
    {
      "speaker": "A",
      "text": "My name is Diego, and I built an AI SaaS that makes me around 17k per month. I started it 4 months ago, and just by using Reddit alone, I've been able to get over 1 million eyes on my product while spending $0 in marketing.",
      "start": 58570,
      "end": 71890
    },
    {
      "speaker": "B",
      "text": "All right, amazing. I'm really excited to talk about the Reddit stuff, but first, let's talk a little bit more about the app that you built. What exactly is the app and what does it do?",
      "start": 71890,
      "end": 80490
    },
    {
      "speaker": "A",
      "text": "My app is called App Akamai, and it allows you to build mobile app designs very fast using AI. It's like Cursor, but for designing mobile apps.",
      "start": 80770,
      "end": 90010
    },
    {
      "speaker": "B",
      "text": "Okay, cool. So we're doing stuff in AI. How did you come up with the idea for this?",
      "start": 90010,
      "end": 93730
    },
    {
      "speaker": "A",
      "text": "A few months ago, I actually wanted to build my own mobile app, and I paid a designer on Upwork for a decent design, and it was hundreds of dollars. And every time I wanted to make, like, a little change, I had to pay him extra. I thought that if I could build an AI tool around this, I could save people a lot of time and money.",
      "start": 93730,
      "end": 113590
    },
    {
      "speaker": "B",
      "text": "Sick. I love it. So once you had kind of found the idea for this, you started building it. How did you validate that this was something that you wanted to, you know, take all the way and actually launch?",
      "start": 113750,
      "end": 124550
    },
    {
      "speaker": "A",
      "text": "So it was a problem. I myself had experience, so I knew there was something there. So I built the simplest mvp. I ended up building the MVP in about two weeks, and I started marketing right away. On Reddit, I got my first gay mrr. And even more purely off Reddit.",
      "start": 124790,
      "end": 141930
    },
    {
      "speaker": "B",
      "text": "All right, two weeks to build. This is insane. Would you have any Tips for people watching on how to build apps quickly with AI.",
      "start": 141930,
      "end": 148370
    },
    {
      "speaker": "A",
      "text": "Yeah, so I don't use the newest libraries or frameworks because AI is always going to be a lot better at the libraries that are the most used on the web. And something else that I do is that I use a lot of UI component libraries like Chakra UI or Antesign. And this allows you to prototype a lot faster and and to make your website look nicer too.",
      "start": 148450,
      "end": 170310
    },
    {
      "speaker": "B",
      "text": "Okay, before we finish Diego's story, I did want to point something out. Diego builds really fast. He doesn't waste time overthinking, he just goes for it. I talk to a lot of successful founders and this is one of the most common themes I see. Build fast so you can validate faster. And that's exactly why I want to put 10Web on your radar. 10Web is an AI powered platform that generates complete, ready to launch websites just from a single prompt. And what's Even cooler is 10Web. 10Web just launched their brand new AI website builder API. With just one API call, it can generate a fully functional hosted WordPress website from just a single text prompt. 10Web is way more than just a typical template builder. It helps you build a real production ready site fast. With 10Web, your users get a website that is SEO optimized and mobile friendly, drag and drop editable, fully E Commerce ready with WooCommerce and built on WordPress but completely white labeled under your brand. This tool tool can literally save months of work and 10 web handles everything so you can focus on what makes your product unique. Just click the first link in the description to book a strategy call and see how it works. Thanks to 10Web for sponsoring the channel. Now back to Diego's story. Okay, cool. So let's, let's go into the numbers a little bit on the business. Can you just share some of the numbers behind what you built?",
      "start": 170310,
      "end": 253550
    },
    {
      "speaker": "A",
      "text": "Right now there are more than 1k paying customers. I've got it around 3 20k or more signups on my product purely from Reddit and the traffic per month is about 20k.",
      "start": 253550,
      "end": 266190
    },
    {
      "speaker": "B",
      "text": "Okay, so one of the reasons why I wanted to bring you on the channel and what I love about your story is that you did this with basically zero audience. At the time of recording this, you have less than 100 followers on X, no YouTube channel and just friends and family on your Instagram. But my big question and why I wanted to bring you on the channel is how did you do it?",
      "start": 266270,
      "end": 284670
    },
    {
      "speaker": "A",
      "text": "So a lot of people think that you need a big audience to grow a SaaS nowadays I got my first K MRR and even more purely off Reddit. I would say that Reddit is probably the most underrated marketing channels for two different reasons. One, you can get a lot of reach for no cost. The other reason is that compared to all the other platforms, you can get very precise targeting. In Reddit, there is a subreddit or think a community for pretty much everything. So you can choose a lot of different communities or subreddits that are related to the product you're selling and target the actual users that are interested in what you're building.",
      "start": 284670,
      "end": 325660
    },
    {
      "speaker": "B",
      "text": "All right, so we know the power of Reddit. Let's actually dive into the specifics, into this whole Reddit marketing playbook. Can you give me your playbook for getting users and making money from Reddit?",
      "start": 325980,
      "end": 336140
    },
    {
      "speaker": "A",
      "text": "Absolutely. So the first step is actually becoming an active Reddit user. If you're not using Reddit already, start using it daily. This has two different purposes. The first one is becoming familiar with the platform and seeing what kind of posts do well. The second one is warming up your account because any posts that come from a newly created account will be automatically filtered out by Reddit. So step two is creating a list of subreddits. And this one is very important because you need volume for this to work. The more the better and you can go broad and narrow. So there are a lot of different ways to find subreddits related to your post product. But the one I recommend the most is using a Reddit ads tool. And you don't need to pay for any ads for this. You just go to the Reddit ads page, you create a new campaign here. When you go to the targeting section, you can look for communities. If I look for, for example, no code which is related to my own product, I'll get a lot of different communities that are related to this one and I can keep adding more and I'll keep getting more recommendations. So the third step is creating a killer organic post. The reason that most people fell on Reddit is that their posts don't feel natural, they feel very pushy and they make it completely around their own product. What you want to do instead is provide a little bit of value in your niche and then you can block or link your product in the middle of the post. The good thing about Reddit is that most successful posts have actually the same structure. Here I have a post of mine that did very well for app Akeemi. And as you can see here, every successful post starts with a catchy attention grabbing headline. What most people do here instead is that they mention their new product or they announce it like they announced a launch. And this is not what you want to do. After the catchy headline, you still don't want to mention the product immediately. You want to provide some value in your niche first. In this specific post, I did a case study on a very successful mobile app. This one, I actually found it on Twitter and I summarize it and then I plugged my product at the end. If you link your product directly, you're going to get a lot more traffic to your website instead of just like mentioning it. Although many subreddits don't allow you to link directly or is prohibited, if you actually provide some value first and you're not just like pushing your product, they will actually be okay with it. For more stricter subreddits that don't allow you to link your product, I would recommend linking an extra product beside yours plug like a complementary product. So for example for mine is like a design tool, so like cursor complements it very well because it's for development. So I usually plug that one after mine and that way your chances of getting banned or your post being removed for self advertisement is a lot lower. So on the other hand I want to give an example as well of what not to do. So as you can see in this example right here, the founder blocks the product right away, like mentioning it in the headline. He immediately starts talking about the product, all the features, everything about it. He even links to Discord. And as you can see from the engagement, this post didn't do very well because people don't care. They want to get some value first. They want to read something interesting and then if your product is related to that, yeah, you can plug it and then they might be interested in it. So step four is grabbing the post we did on the last step and posting it on multiple subreddits. And volume here is super important because that increases the chances of one of your posts getting to the Reddit front page and that is going to give you like a lot of traffic. Even if that doesn't end up happening, let's say that you post on 10 different subreddits and each of the posts gets on average, let's say around 10k views. That's a total of like 100k views already, which is really good. So it's still worth it. So the last step of the playbook is to repeat this process. You should be trying different type of posts to see what does better in your niche, you can try videos, you can try case studies, and you can try other type of posts as well. A good rule of thumb is, is posting two to three times per week. I think that anything more than that will probably get you banned, so you should probably stick to that rule.",
      "start": 336220,
      "end": 611840
    },
    {
      "speaker": "B",
      "text": "All right, cool. Well, Diego, that playbook was amazing. Let's switch gears a little bit. Could you just break down your tech stack? How did you build these products, what tools did you use, and what's your stack?",
      "start": 611840,
      "end": 622000
    },
    {
      "speaker": "A",
      "text": "Yeah, so I use Cursor for development and for building. I use Next JS and React as my main frameworks, and I use Firebase for authentication and for database stuff.",
      "start": 622080,
      "end": 632920
    },
    {
      "speaker": "B",
      "text": "And okay, so you're doing about 17k mrr. What are the actual costs to run this business? What do the profits look like?",
      "start": 632920,
      "end": 639000
    },
    {
      "speaker": "A",
      "text": "So the overall margins are about 70%. Cursor is 20 per month. Vercel hosting is about 40 per month. And then my most expensive costs, the AI API backends, which are about 2.5k per month.",
      "start": 639000,
      "end": 653200
    },
    {
      "speaker": "B",
      "text": "Okay, so you, I mean, you crushed it in the last four months. You've found this whole Reddit strategy. You're making money online. What had been the biggest lessons learned in your journey so far?",
      "start": 653200,
      "end": 663900
    },
    {
      "speaker": "A",
      "text": "I would say that when it comes to building a SaaS, you should be solving a problem in a growing market. And a good example I can give is building a SaaS tool for newspaper owners, for example, which, like newspapers are in decline. Or you can build a tool for like vibe coding, which only in the last months has been exploding and it's going to keep growing. Something else that I would recommend to everyone is that like in any other business model, in SaaS, marketing and distribution are actually very important. So even at the start, you should be spending a lot of your time marketing instead of like, adding more features no one asked for. And lastly, as a solo founder or small company, speed is one of your major advantages. So take advantage of that whenever possible.",
      "start": 663900,
      "end": 712160
    },
    {
      "speaker": "B",
      "text": "Okay, those are awesome. The last question that we ask to everyone who comes on starter story, if you could sit on Diego's shoulder before you cracked Reddit, before you were making any money online, what would be your.",
      "start": 712400,
      "end": 722120
    },
    {
      "speaker": "A",
      "text": "Advice right now is the best time to build? I would say that if you have an idea, get a simple MVP out there and start marketing it as soon as possible.",
      "start": 722120,
      "end": 730620
    },
    {
      "speaker": "B",
      "text": "All right, well, that's the best advice I heard all month. Thank you, Diego, for coming on the channel. I love the Reddit stuff. That's why I really wanted to have you on this channel. It reminds me of when I first started. So thank you for coming on. I imagine you're going to keep growing and we'll have you on when you're doing a million. So thanks for coming on, man.",
      "start": 730860,
      "end": 745060
    },
    {
      "speaker": "A",
      "text": "Thanks for having me.",
      "start": 745060,
      "end": 746020
    },
    {
      "speaker": "B",
      "text": "I love Diego's story because it's proof that you do not need an audience to be successful. He did it all just by having a great working product and, of course, a killer marketing strategy. I really think that anybody can do this, put this into practice, and create something that changes their life. But of course, you actually have to build something. If you never build it, you'll never know. And this is why I created Starter Story Build, our flagship program to help you build anything with AI. In less than two weeks, you go from just an idea in your head to a fully working app ready to ship to the world. And more importantly, you'll learn the skills to build whatever you want to forever. If you're interested, head to the link in the description to check out Starter Story Build. Thank you guys again for watching. I'll see you in the next one. Peace.",
      "start": 746020,
      "end": 792580
    }
  ]
}