{
  "source": "/home/salouri/Projects/starter_story/transcripts/En34iY-rQc0/En34iY-rQc0_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "My name is John Rush and I run 20 different projects doing 3 million ARR.",
      "start": 160,
      "end": 4720
    },
    {
      "speaker": "B",
      "text": "John Rush started his career working for huge VC backed startups. But after feeling unhappy and a bit bored with the VC life, he decided to throw it all out the window and instead launch his own apps as a solo founder. And over the past three years, he's built, launched and now runs over 26 different apps.",
      "start": 5120,
      "end": 24640
    },
    {
      "speaker": "A",
      "text": "I built in VC for 10 years until I realized this one thing.",
      "start": 24640,
      "end": 28880
    },
    {
      "speaker": "B",
      "text": "In this video, we'll take you behind the scenes of John's exact process for building a portfolio of profitable apps. We'll dive into the exact steps he uses to come up with every single idea how he gets paying customers before building anything, and a full breakdown of all the different apps he runs.",
      "start": 29260,
      "end": 47820
    },
    {
      "speaker": "A",
      "text": "The secret of running 26 startups is.",
      "start": 47900,
      "end": 50780
    },
    {
      "speaker": "B",
      "text": "All right, let's get into it. I'm Pat Walls and this is Starter Story. Welcome John Rush to Starter Story. Thanks for coming on. Tell me about the businesses that you built and what's your story?",
      "start": 50780,
      "end": 64380
    },
    {
      "speaker": "A",
      "text": "My name is John Rush and I'm running 26 startups at the same time. After quitting the VC world and joining the bootstrap movement, all my businesses have combined around 1 million users in B2B and combined 3 million ARR where seven products bring most of the revenue and the other products are bringing the audience and the add channel to the paid products. The most popular tool I have is called Unicorn Platform. It's a website builder that helps busy founders to build their landing pages, wait lists and directories.",
      "start": 64460,
      "end": 97550
    },
    {
      "speaker": "B",
      "text": "Okay, so let's move to a little bit about your background, how you got started as an entrepreneur and what your story looks like.",
      "start": 97630,
      "end": 104510
    },
    {
      "speaker": "A",
      "text": "Yeah, so it all started when I was little. So my father was entrepreneur, he would involve me into everything he was doing just for fun. And by 2020 I was 10 years in to building VC backed startups and that's when I kind of felt it was something against my nature. So I was so obsessed with users, I was so obsessed with the products and love from the users for my products. But in the VC backed world, I felt like the whole obsession was kind of different. In 2022 I decided to enter the bootstrap scene. I found the one tool that I like the most called Unicorn Platform. And I reached out to the founder and I said, do you want to sell this product to me, the whole startup? And also when you sell it, you will join me for a year and you will teach me how to be bootstrapper and how to be an indie maker. And he said yes. So I paid almost a million dollars for that startup and then and he guided me on another thing. So he was my mentor for a year. I went from being VC backed founder who knows nothing about bootstrapping to becoming a pretty prominent bootstrapper in the scene.",
      "start": 104510,
      "end": 169830
    },
    {
      "speaker": "B",
      "text": "Cool. Well on that topic I would love if you actually did a deep dive on your projects. You don't have to go through all of them but some of the products you're most proud of and that bring in the most revenue for your business.",
      "start": 170390,
      "end": 180790
    },
    {
      "speaker": "A",
      "text": "So all my products are for bus founders. So the first one is Unicorn Platform. It's a website builder and directory builder for busy founders and it has 600,000 users. The second one is SEObot, it has 100K MRR and it has grown in less than 12 months and it was one of the first SEO AI agent on the market. The third one is listing bot. It finds all relevant directories on the Internet and it lists your product there.",
      "start": 180950,
      "end": 207490
    },
    {
      "speaker": "B",
      "text": "Thank you for sharing all that. You seem like you're pretty good at finding ideas that work. I would love if you walk through your process for ideating and validating an idea that you're going to end up working on and building.",
      "start": 207650,
      "end": 217790
    },
    {
      "speaker": "A",
      "text": "Yeah, so I used the same process over and over again for all my 20 plus products. It all starts with my own pain at work that I want to solve and then I look for solutions for that pain. And if I don't find the solutions on the market then I go and talk about this pain on the Internet and if I see other people resonate with my pain and they say yeah, I have the same pain and I wish there was a solution then that's going to grand signal for me to go to the next step. I launch a wait list and I see whether I am able to generate hundred signups. I email them all and I offer them 90% discount on a pre sale before I build anything. And then if I get five sales I build the first mvp. I don't even build a product. I actually deliver the solution manually at this stage I don't care about the margins yet, I just care about the solution being delivered to the customers and whether they actually satisfied with that. And usually it's not that straightforward. Usually I have to iterate and deliver solution to the customers and they don't like it. So I iterate, iterate until they like it. And it's easier to iterate when there is no product. When there's no code it's much easier because I just have to change my own routine and my own service and once I find the sweet spot where it satisfies the users, I go and find a co maker. The co maker joins in, we spend two, three months building and then I have this big launch on Twitter and that's it. That's it. The blueprint for all the products I have.",
      "start": 217950,
      "end": 305900
    },
    {
      "speaker": "B",
      "text": "Cool. Well let's talk about that kind of co maker strategy. I haven't seen that too much before or heard too much about that. So I'm curious, how does it actually work? How do you find great developers or product managers for this and how does partnerships work for that?",
      "start": 306380,
      "end": 320780
    },
    {
      "speaker": "A",
      "text": "Finding a co maker is really hard, same as finding a co founder. So I usually talk to other makers and I become friends with them and that runs for years or months. And then eventually when I'm looking for a co maker, it's not that difficult for me to, to figure out who to reach out to because I see that I'm building a tool for social media and there were these three founders building something similar in the past and they have failed. And now if I pitch them the idea that has passed the validation part. I have pre sales done and I have some users, it's really easy to convince them to join and we share the ownership. 50 50. It's just regular co ownership where I take care of all the operation, legal, parts, accounting and the co maker takes care of the coding and support. If you want to be co maker people want to work with, the best thing to do is to build things in public because that makes it so easy for anyone else to evaluate you and to just see whether you have things in common, etc.",
      "start": 320860,
      "end": 380580
    },
    {
      "speaker": "B",
      "text": "All right, before we finish talking about John's projects, I need you to hear this. Shipping 20 projects is insane productivity. But the minute you aim one of those apps at the enterprise, well, B2B, the questions from leads and customers start to change. Enterprise buyers don't just ask, does it work? They ask, are, are you SOC 2 compliant? HIPAA compliant? ISO 27001 compliant? Miss that box and your six figure deal evaporates. Especially since these frameworks can take months and months to achieve. And that's why Starter Story has partnered with Vanta on this video. Vanta is a trust management platform that automates the painful parts of compliance. It hooks into your stack, runs continuous checks and keeps the evidence all clean for auditors so you can stay in build mode while Vanta handles the paperwork. Vanta saves teams about 530, $35,000 a year and pays for itself in three months. It's built for Startup speed and shaped by thousands of teams. No wonder 10,000 plus companies like Ramp, Atlassian, LangChain and Cursor use it to prove security in real time. So if you're looking to land Enterprise and B2B customers, or just make your project as secure as possible, get started with Vanta's free compliance for Startup bundles. It has compliance checklists, case studies, videos and more to help you get compliant quickly demonstrate security and build customer trust. Just head to the first link in the description, access it, get compliant, close the deal. Huge thanks to Vanta for supporting the channel. Now let's get back to the video. Okay, let's talk about marketing because you told me that you handle the distribution side of things. I'd love to hear what your kind of secret sauce is that comes to marketing so many different businesses and getting hundreds of thousands of users.",
      "start": 380740,
      "end": 486880
    },
    {
      "speaker": "A",
      "text": "I think that the key essence of good marketing marketing is good product. The ideal marketing is where the product just drives the sales and drives word of mouth. But it's difficult to build a great product right away. So usually you start with an average product and you have to do the boring marketing methods to bring first users and then use those users to improve your product and make it great. So before my product is great I usually go for SEO and then the second most popular that they have is social media marketing. So I run that on X, on LinkedIn, on Substack, on Facebook, everywhere. I repurpose the same content on all platforms and I do that every day. So I share at least 30 tweets a month and sometimes more. And then the third one is the listings on directories. This is very, very good way to grow your product if your product is hot and interesting. In my case, all products are connected to AI and it's easy to package them in a way that people want to click them when they see them on directories. So if your product is also clickbaity, it's easy to drive traffic from directories. Then I do cross promo, which is quite unique to me. Every user that tries one of my product ends up trying at least one more product. And often I have people who try all of my products. The cross promo works really, really well because people trust you already and they know you deliver cool.",
      "start": 486880,
      "end": 566730
    },
    {
      "speaker": "B",
      "text": "What I think is really cool about how you have all these different projects is actually the marketing strategy that comes with that is this idea of cross selling or cross promotion. Can you tell me a little bit more about that?",
      "start": 566730,
      "end": 578070
    },
    {
      "speaker": "A",
      "text": "So I have over 20 tools where some tools are premium tools. I make money on and some tools are just to bring traffic in and channel it to my premium tools. I do two things. So one thing is that I link tools with each other and the other thing that's more interesting is that I integrate tools with each other. For example, in SEO bot I have a button called boost my domain rating and if you click that then it brings you to my other tool called listing bot that helps you to boost your domain rating. I have this integrations across all the products. So users natively float from product to product and end up using my entire ecosystem.",
      "start": 578230,
      "end": 615810
    },
    {
      "speaker": "B",
      "text": "Let's move on to the next topic which is AI. I'd love to know how you are using AI to build, run, grow and make your business more efficient.",
      "start": 615810,
      "end": 625130
    },
    {
      "speaker": "A",
      "text": "The way I use AI for building the products is that I built my own tool, my own AI code generator that lets me build all my SaaS products, no code tools and AI agents. And it works extremely well. I think AI in coding is probably the best application of AI in the modern days. And then I use AI a lot for design. I make all my logos with AI, I make all my images with AI. So basically I don't use designers for most of my work. And then I use AI for research. In the past I would hire people and I would give them research tasks, but now I just go for O tree research mode or grope research mode and I give it a task and then it spends like 10 minutes and then I have perfect table with all the data I need. And then I use AI for marketing. That's where I gained the most profit from AI, I think, because marketing is consuming a lot of resources otherwise. So I use it for SEO, I use it for generating emails, I use it for copywriting and generating ads and everything. So basically I generate everything with AI. Then I use AI for operation. So I built one tool called Nova. So it's like a project manager AI and it manages all the projects I have with the co makers because I have a lot of co makers and this AI is just taking care of all those processes.",
      "start": 625130,
      "end": 706930
    },
    {
      "speaker": "B",
      "text": "Well, on that note, when we talk about some more tools, tell me about what kind of tools and languages are you using on a daily basis. What are your favorite tools? What runs a business?",
      "start": 707010,
      "end": 715730
    },
    {
      "speaker": "A",
      "text": "Yeah, So I use JavaScript and tailwind for coding and it turned out that AI is perfect for these two. Then I use Grok for learning. So if I have a question, I ask Grok because Grok has connection to real time tweets and that's where all the best data is. Like all the best Content is on Twitter and then Grok has access to that. I use Discord for chats and for project management and then I use Apple Notes for writing. I tried everything that's complicated and then I went back to Apple Notes and then I use Cloud and Gemini and OpenAI APIs inside my tools. It's kind of a race where every month I keep switching between because one model is better this month than the other model. So I use all three of them at the same time and then let users choose. The AI tools are pretty expensive to run. For example, in SEO bot we have around 70% margins, so we make 100k a month and then we pay 30k for APIs. And then in non AI tools where the costs are pretty low, I have 90% margins. The main cost for Unicorn platform, for example, is support agents. And I have humans doing that and I like to have humans for that because AI doesn't have the soul. So people don't want to chat with AI, they just ask questions and they leave. But when you have humans in support, then people might just start chatting about random things and create this relationship. So I think I want to keep human support for all my products.",
      "start": 715890,
      "end": 800330
    },
    {
      "speaker": "B",
      "text": "Well, on that note, I think what's cool about your story is you did vc, you had an exit even, and then you also did solopreneurship. You've done both, you've seen both. So tell me about some of the differences between VC bootstrapping and what you think the future of startups are.",
      "start": 800490,
      "end": 814790
    },
    {
      "speaker": "A",
      "text": "In the VC world, I think people have to understand the game and I did not understand the game. I was all about building great products, making happy users, but the game was about exits. So everything has to be optimized for an exit. In the bootstrap world it's totally different. You optimize for profits rather than for the next funding round. In a VC world you pay for growth. In a bootstrap world you want to have product led growth. In the VC world you have many people working for you and you want to grow the headcount as much as possible because that increases your valuation. And in the bootstrap world you want to cut the headcount as much as possible. Ideally, you want to be a solo because then there are no cost at all.",
      "start": 814790,
      "end": 856010
    },
    {
      "speaker": "B",
      "text": "Okay, on more of a personal topic, I would love to learn a little bit more about what your life is like. What does a day in life look like for you?",
      "start": 856170,
      "end": 863090
    },
    {
      "speaker": "A",
      "text": "I live in a forest and I have no social life. I have family and children and animals. So I wake up in the morning, I go outside, I take care of animals, I change their water, I bring them food, I cut some grass, I do some exercise outside and after one hour I come back and I work for five hours. Then my kids come from studying and then we spend time together for two, three hours. Then they go to sleep. Then I go back to work for another five hours. Then I go to sleep at 4am and I wake up at 10am so I sleep six hours a day. And it worked well until now, but now I felt like I had to sleep more than that.",
      "start": 863090,
      "end": 901510
    },
    {
      "speaker": "B",
      "text": "Cool. Wow. That was not the answer I was expecting that you're on a farm. But I love that. What is something that you learned in your journey that surprised you or you didn't expect?",
      "start": 901590,
      "end": 908790
    },
    {
      "speaker": "A",
      "text": "So the first time when I seen build in public, I thought it's all about marketing. So people do that to get more eyeballs on their products and that's free marketing. And that's true. But I realized that even the bigger value of building in public is that you build that up a direct channel with the audience and the users that helps you to build great products. Before building in public, my failure rate was really high. 90% of the things I've done failed. And when they start building in public, it flipped. So now only 10% of my products fail and 90% don't fail because I adjust them before I ship them. Just because I build in public.",
      "start": 909190,
      "end": 949120
    },
    {
      "speaker": "B",
      "text": "Cool. I like that last question that we'll ask that we ask all founders that. Come on, starter story. If you could stand on John John's shoulders when you were getting started with that first bootstrapped that ended up becoming in your whole portfolio, what advice would you give him or anyone building SaaS.",
      "start": 949360,
      "end": 963640
    },
    {
      "speaker": "A",
      "text": "Getting started today, the most important thing when you build a startup is the idea and the founder idea fit. So people start looking for random ideas in random spaces. And I think that's wrong. I think people should try to build something they understand. In my case, I went into the extreme and I built things for my own work. And that's something I understand really, really well. But I think people should build for their own work. They should solve their own problems. And I'm sure at any job in the world there are hundreds of things you can solve with software. So don't go too far, don't look for random things. Just look around you and see what are the pain points in your job founder market fit.",
      "start": 963640,
      "end": 1007480
    },
    {
      "speaker": "B",
      "text": "Build something that you are passionate about or you have some expert knowledge in and you have such an advantage and such a head start start. I love that. Thanks for coming on the show, John. I love what you built. 26 businesses, 3 million. ARR. It's amazing. It's only going to keep growing. I'm stoked to watch your journey. Thanks for coming on and sharing all that.",
      "start": 1007480,
      "end": 1024700
    },
    {
      "speaker": "A",
      "text": "Thanks for having me.",
      "start": 1024700,
      "end": 1025740
    },
    {
      "speaker": "B",
      "text": "What I think is probably the coolest part about what you built is how all your different apps kind of all work together. That kind of cross selling and cross promotion thing. I see a lot of people building lots of different things that are unrelated. But what I think really works for him is that everybody, every app he builds kind of compounds onto the next one. But it all starts with actually building something, building that first idea, and then doing that over and over and over again. So Shameless Plug I would love if you checked out Starter Story Build. It is our platform to teach you how to build startups, apps and projects with AI tools. I'll put the link in the description for that. If you're serious about actually building something in 12 days you will take an idea to a real ship product that can actually have users and I think that's awesome. Thanks guys for watching. I'll see you in the next one. Peace.",
      "start": 1025900,
      "end": 1077050
    }
  ]
}