{
  "source": "/home/salouri/Projects/starter_story/transcripts/KpVPST_P4W8/KpVPST_P4W8_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "I run four different businesses that currently make $60,000 per month.",
      "start": 160,
      "end": 4240
    },
    {
      "speaker": "B",
      "text": "How does this guy make $60,000 a month from four very different online businesses? Well, it's all thanks to one simple marketing strategy.",
      "start": 4480,
      "end": 14240
    },
    {
      "speaker": "A",
      "text": "I spent a lot of money on Facebook ads. It never really worked. I tried Google Ads. It never really worked. And then the thing that worked really.",
      "start": 14320,
      "end": 21760
    },
    {
      "speaker": "B",
      "text": "Well was Uray started his journey as a normal guy working as a software engineer at Microsoft. But eventually he got fed up with building someone else's dream. So he started building his own ideas and eventually stumbled upon an opportunity.",
      "start": 21760,
      "end": 35430
    },
    {
      "speaker": "A",
      "text": "That first month we did about $700. The second money was $4,000. Their third money was about 12.",
      "start": 35670,
      "end": 42150
    },
    {
      "speaker": "B",
      "text": "I spent over an hour talking to Uray about his businesses and about how anybody can start building profitable products from scratch. Luckily, he shared everything. How to find winning ideas, how to build apps with no experience, and how he racked up 300 million DOL views without spending a dime on advertising. Now let's get into it. I'm Pat Walls and this is Starter Story. Jure, thank you for coming on. Tell me about who you are and what business that you built.",
      "start": 42550,
      "end": 76210
    },
    {
      "speaker": "A",
      "text": "My name is Jure and I'm a developer who has co founded and runs four successful online businesses that are currently doing $60,000 per month in revenue. The first one is Rammer. So Rummer is a device that looks like this and you plug it into the OBD2 port of your car. I launched this business about two years ago and last year we sold 6,000 units. We generated 300,000 in revenue and most of the sales came from the 200 million organic short form content views that we did on TikTok, Instagram and YouTube. The second business I run is called Parakeet AI. It's basically a real time AI interview assistant, primarily used for for job interviews. I launched this business about six months ago and in the last 30 days we made over 35,000 in revenue. The third business I co founded is called Optibase. It's a B2B SaaS business and it's basically an A B testing tool for Webflow. We launched about a year ago and it's currently doing about 6.5k in MRR. Most of the sales for that business are coming organically from the Webflow app Store, Google and Word of Mouth. The fourth business that I just launched is called Parakeet AI Apply Agent. It's an AI agent that applies to jobs for you. I launched this product two weeks ago and it's already done about $1,000 in sales so far.",
      "start": 76370,
      "end": 154660
    },
    {
      "speaker": "B",
      "text": "So you build these four businesses in a bunch of different industries. What did you learn in this process that you feel that you want to share with the world?",
      "start": 154900,
      "end": 162020
    },
    {
      "speaker": "A",
      "text": "Originally I was just a programmer, so I was a very technical person. I knew how to build products. I knew all the technical ins and outs of it. But I didn't really have a good idea of how to market them or what marketing even means. And I think a lot of programmers go through the same struggle. They kind of have an idea of what they want to build. They know how to build it. When there comes time to sell, that's where they give up. I think this marketing part of it is just as big and just as complex as building the actual product.",
      "start": 162340,
      "end": 194850
    },
    {
      "speaker": "B",
      "text": "That's great advice. So tell me a little bit about what got you into building SaaS products or just building online businesses. Give me a timeline of when things first started, when you first got the bug. Until becoming an entrepreneur.",
      "start": 195420,
      "end": 207420
    },
    {
      "speaker": "A",
      "text": "I'm 26 years old, so I grew up in kind of the peak Internet business success stories, right. I watched the social network and I think during that time was very much an influential thing for me because the world of entrepreneurship was presented as this ultimate lifestyle you can live. So from a very young age I always dreamt about starting my own business and doing my own thing. I started off around 1314 building apps. I never really made any money up until three years ago with it. And then at some point I worked for Microsoft for about a year and a half. When you have a job, you're kind of limited by the structure of the company you work at. You go to work every day, you and it doesn't really matter if you put in 2x, 5x or even 10x the effort. You know, at the end of the month you get the same salary and you will usually wait the same amount of time for a promotion. When you run your own company, if you put in 10x the effort, you will see 10x the results. When things go wrong, you know it's entirely on you to fix it and to make it better. That level of ownership really brings a lot of meaning to just day to day work.",
      "start": 207740,
      "end": 276380
    },
    {
      "speaker": "B",
      "text": "Okay, so let's talk about business ideas. That's why a lot of people are watching today. How do you find ideas? Like how you found the idea for your first successful business Rumor.",
      "start": 276710,
      "end": 286870
    },
    {
      "speaker": "A",
      "text": "You will not come up with ideas randomly sitting on your sofa. You need to be out there doing stuff. When I came up with the idea of Rummer at the time I was building Shopify stores for e commerce brands and I was amazed by just how much money they were making. At the same time, I was also buying a used car. So I purchased like a car diagnostics device and while playing around with it, I discovered that the device can read live RPMs of the car. And that's when the idea popped into my head that I could use that to generate fake engine sounds through the speakers and sell it as a device online. It's so easy to kind of package it all into one story because it's a cheap device you can sell online. You can tell a very good story about it. People find the idea funny. It, it's kind of controversial. So I thought the marketing side of it, you know, had potential. You need to spark interest through a 10 second video of people, which is going to be very hard. If your product is boring, you're going to be able to sell products that are compulsive buys on TikTok. Anything that takes a lot of time and consideration into buying TikTok is not going to be that effective.",
      "start": 287030,
      "end": 355160
    },
    {
      "speaker": "B",
      "text": "Okay, can you tell me a little bit more about how you validate ideas or when you see an idea, how do you know if it's valuable? Validated?",
      "start": 355240,
      "end": 361490
    },
    {
      "speaker": "A",
      "text": "When you first come up with a product or business idea, it's almost 100% guaranteed that somebody else has come up with that idea before and they've done it before. You need to be able to evaluate the competition and see if there's any kind of space for you to squeeze in with your own product. And there's two main areas for you to focus on. Could you either make a better product or could you do marketing better than them? I think if you're trying to start an online business right now, the way to do it is to bet on organic short form content. Most other marketing channels are saturated to a point where you just coming in is going to be so hard for you to break through and make something that's profitable. But organic short form content, if you have a phone, you can make a TikTok that's going to get million views and those million views can convert into thousands of dollars in revenue. You're only constrained by your willingness to work hard and make the right content. So that's why I would suggest to anybody who's just starting off, there's a lot of potential in short form content and building businesses around that.",
      "start": 361810,
      "end": 427350
    },
    {
      "speaker": "B",
      "text": "Perfect. So you're a developer. A lot of people probably want to know how you build these products. What is your process to go from idea in your raised head to live product v1 beta?",
      "start": 427590,
      "end": 439270
    },
    {
      "speaker": "A",
      "text": "The primary thing I focus on when starting off a product is thinking about what is the mvp, right? So MVP stands for minimum viable product. And the viable part is very important. Now if the product is not good enough to make that first sale, it's not viable. If I can build a product from zero to making the first sale in two weeks, but it takes you six months, it's going to be very hard for you to compete with me. I made a web app that could in real time transcribe what's going on and generate answers. With ChatGPT now turning that proof of concept into a product took about two weeks. And obviously like doing the landing page, you know, doing some kind of marketing and just having something that's, that's digestible to the end customer. If you can do two times more in the same amount of time, you have a two times higher chance of success than some somebody else.",
      "start": 439700,
      "end": 491320
    },
    {
      "speaker": "B",
      "text": "Okay, so Yuri understands that content and distribution is king when it comes to building an online business. And I know a lot of you guys want to do something similar to Yuri. Build things, create content that can go consistently viral and actually make money with your ideas. If you want to take advantage of this viral content wave while it's hot and have AI help you do it along the way, then head to the first link in the description to to get this free guide on how to use AI to generate high impact social media content. This guide is super comprehensive and it's what I would use if I was just getting started with AI and social media. It includes how to find trends, how to write solid prompts, and a bunch of other tools that help you analyze your content's data. It also goes step by step into everything you might need from research to analysis. I personally found the AI powered Hooks and framework section the most helpful because it gives you the exact templates for for writing scroll stopping scripts. I recommend heading to the first link in the description to download it for free right now. This guide was made by HubSpot, which is today's video sponsor. A big shout out to them for putting together this free resource. All right, back to the video. Let's jump into the actual marketing, the meat and potatoes of the marketing. How do you get users to your landing pages, to your apps and to buy your products?",
      "start": 491560,
      "end": 573990
    },
    {
      "speaker": "A",
      "text": "You could write down a list of 10 ways for you to do marketing. You have kind of a limited set of distribution channels. You could do short form organic content. You could do Facebook ads, Google Ads, Reddit. Think about each one which has the highest chance of succeeding. Pick that One and dedicate your full time attention to it for the next two months and whatever you saw work, just double down on it and do more of that. So for example, for Rummer, I tested so many things out and then the thing that worked really well was organic short form content. We make funny short videos for TikTok, Instagram and YouTube and they do go viral by themselves because the product by itself is interesting enough. In the last year we did about 200 million organic short form content views that generated about 600,000 page visits, over 6,000 orders, and altogether about $300,000 in revenue.",
      "start": 574550,
      "end": 630300
    },
    {
      "speaker": "B",
      "text": "And if someone were starting out, they have new product, like new AI SaaS like you, how many different types of ideas would you try and how many would you post in like the first week?",
      "start": 630460,
      "end": 640120
    },
    {
      "speaker": "A",
      "text": "I, I leave a lot of the content creation part out to my co founder. He kind of creates these batches of content, right? So he would write down five to 10 ideas for hooks, main part and ending. So we would make for example, three hooks, five main parts, three endings. Now if you do all the different combinations, you combine the three hooks with five main parts and three endings, I mean, you can get a lot of videos out of it. And then when we find the concept of a video that works, we just keep remaking the same concept.",
      "start": 640440,
      "end": 668870
    },
    {
      "speaker": "B",
      "text": "I like that. So tell me a little bit about this co founder you have. I think it's cool that you're a developer, you're building the product, you found someone who can really help with the video side of things, which takes a lot of work. How did you find this person? What's the partnership kind of set up on something like that?",
      "start": 669190,
      "end": 683670
    },
    {
      "speaker": "A",
      "text": "The way I found Urban, which is my co founder that does the content, is I must have sent out like hundreds of emails to different content creators that I saw on TikTok and just kind of pitching them the idea of my product. And Urban is the one that really believed in it. And I think the second video he filmed went viral. And the way we work currently is we just work on a revenue split. That way our incentives are very much aligned.",
      "start": 683910,
      "end": 711310
    },
    {
      "speaker": "B",
      "text": "All right, so we talked about getting attention, getting eyeballs on your product. How do you actually convert that attention into users and paying users and revenue?",
      "start": 711310,
      "end": 720430
    },
    {
      "speaker": "A",
      "text": "So specifically speaking for Rummer, where we've done 200 million views last year that converted to about $300,000 in revenue. I just have a simple landing page. I don't really do much AB testing. I think especially when you're just starting out and you're kind of a small team and not doing that many sales. If you're not confident that the change you're making is going to increase sales, then you're probably like focusing on the wrong thing. So we just kind of make big sweeping changes that I know are going to make a difference.",
      "start": 720900,
      "end": 754590
    },
    {
      "speaker": "B",
      "text": "Okay, that's great. Can you tell me a little bit about your strategy on payment plans? Freemium? Anything that you've learned in your experience building a few software products?",
      "start": 754750,
      "end": 764190
    },
    {
      "speaker": "A",
      "text": "Yeah, I think it's very important that the way you monetize needs to fit the way your product is being used. And there's a big tendency for people to make a subscription out of everything. So for Parakeet AI, credit based is just such an obvious way to monetize this product. And that's a big selling point for us because a lot of our competition does subscription. And we have a big banner saying, you know, no subscription, one time payment. So make sure that the way you monetize your product fits the nature of the product.",
      "start": 764670,
      "end": 795880
    },
    {
      "speaker": "B",
      "text": "Now that you have paying users, the natural question is, how do you actually keep those users coming back and buying more? How are you thinking about this While building a SaaS?",
      "start": 796520,
      "end": 804920
    },
    {
      "speaker": "A",
      "text": "If you have the type of product that we have with Rummer, you need to find that consistency and repetition in the marketing itself. Right. Because you need to always be bringing in new customer and always chasing that next sale. Because if you're not, your business just kind of dies off. With Parakeet AI, the most important thing is you have a good product. There's no amount of marketing and kind of re emailing and retargeting that you can do. That's going to be a good product and a service people are happy with.",
      "start": 805430,
      "end": 835860
    },
    {
      "speaker": "B",
      "text": "So what kind of tools do you use to build this business?",
      "start": 836180,
      "end": 839060
    },
    {
      "speaker": "A",
      "text": "Yeah, so the actual stack I used to build the app is very much like a modern web stack. So it's primarily built on next JS and React. For transcriptions, we use something called Speechmatics. And for the actual like AI answers, we use ChatGPT. So for transcription, we pay about a dollar an hour of transcription for that. Right now we're pay paying about 2 to $3,000 per month. And then the actual AI, we also pay about 1 to $2,000 per month for ChatGPT.",
      "start": 839780,
      "end": 872240
    },
    {
      "speaker": "B",
      "text": "Okay, I'd love to know your a what a day in the life currently looks like for you. What are you working on these days and what does a typical day look like for you?",
      "start": 872800,
      "end": 880960
    },
    {
      "speaker": "A",
      "text": "Every day I wake up and I kind of think about what is the most effective thing I can do. To push my business forward. The last week, for example, I spent revamping the landing page because I thought that was kind of the bottleneck for Parakeet AI at the time. It varies from day to day and I think that's the charm of being an entrepreneur.",
      "start": 881200,
      "end": 902210
    },
    {
      "speaker": "B",
      "text": "All right, so what are some of the key lessons that you've learned building SaaS?",
      "start": 902450,
      "end": 906450
    },
    {
      "speaker": "A",
      "text": "If you're founding your own business, there's so many things you need to be able to handle at the same time and think about at the same time and do effectively at the same time. In the morning I might be improving the product and working on some super niche technical issue. And then by the end of the day, I'm deciding which, you know, stupid TikTok hook we're going to use that's going to get us the most views. The context which you need to do in a very short period of time and do it effectively is, I think, a very big challenge. And I think that makes building products like I'm doing it very hard.",
      "start": 906690,
      "end": 940940
    },
    {
      "speaker": "B",
      "text": "All right, well, the last question that we ask on that same note. If you could sit on Uri's shoulder when you were just starting out, what would be a piece of advice you would give him or what would you say?",
      "start": 941180,
      "end": 950690
    },
    {
      "speaker": "A",
      "text": "It's gonna sound very cliche, but you really need to believe in yourself. It's a very long journey for you to go from like nothing to making money doing your own thing. I think the biggest hurdle people encounter is giving up just because like, of how long the journey is and how hard it is and just how much kind of random advice you will get along the way from people who are well meaning but don't know what they're talking about. Going through life, you very rarely have to push for something that's so kind of unknown as starting a business. Because when you're going to school, it's very clear this is what you need to learn. If you learn it, you'll get a good grade. This is very much different. There's a chance you're going to hustle it out for 10 years and get nothing at the end, which is what makes it like, scary, especially when you haven't had any success yet.",
      "start": 951080,
      "end": 1000590
    },
    {
      "speaker": "B",
      "text": "Ouray is the perfect example of how a solo builder can turn a simple idea into thousands of dollars. But that comes with knowing the right information and finding the right problem to solve. Now imagine there was a place that gave you all this. The problems to solve, the blueprints for building, and the marketing strategies that turn simple ideas into million dollar online businesses. Well, at starter story. We have a library of over 4,000 case studies and business idea breakdowns where you can access all of this. And it's all backed by data from real businesses and real online builders. So if you're serious about building a profitable side project like Uray, head to the link in the description and we're going to give you 52 micro SaaS, ideas just like Youray's, so you can get started on your journey. Much love and I'll see you guys in the next one. Peace.",
      "start": 1000750,
      "end": 1050730
    }
  ]
}