{
  "source": "/home/salouri/Projects/starter_story/transcripts/Km0FNcBI9CM/Km0FNcBI9CM_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "Have helped people sell over a billion dollars of businesses.",
      "start": 240,
      "end": 2640
    },
    {
      "speaker": "B",
      "text": "Meet Thomas. He went from flipping websites in his Dorm room for 100 bucks to selling over $1 billion in online businesses.",
      "start": 2720,
      "end": 10120
    },
    {
      "speaker": "A",
      "text": "And it took a very, very long time to get to that stage.",
      "start": 10120,
      "end": 12400
    },
    {
      "speaker": "B",
      "text": "He invited me up to his office in New York City to tell his story and show me how anyone can become rich by buying and selling businesses.",
      "start": 12400,
      "end": 19680
    },
    {
      "speaker": "A",
      "text": "My first deal was something like $100 into $500. And now we regularly close eight figure transactions. You are not going to make your living long term buying things for $100 and selling them to two. You will do if you can apply that same skill to buy for a million and sell for 2 million because all you're really trying to do is learn the process.",
      "start": 19840,
      "end": 38220
    },
    {
      "speaker": "B",
      "text": "He shares a masterclass on how to flip businesses for profit, how to negotiate deals, and how you can buy your first business with $0. Welcome to Starter Story. All right, so let's go back to the early days. I know you got a big team, now you're in this big fancy Manhattan high rise, but how did you get into this industry?",
      "start": 38540,
      "end": 56940
    },
    {
      "speaker": "A",
      "text": "Yeah, so when I was at college, like many college kids, I was trying to find ways to make extra money. I discovered very early on the idea of buying and selling domain names. And this is back in 2008, 2009, bought my first domain name, sold it for slightly more money. I never really understood the idea of domains because I didn't really get how they had any value. So I then discovered you could buy established websites which were businesses because they made money and you could buy them and sell them for more. I think the first deal I ever did was I bought a website for $100, got that to making a little bit of money every month and then I sold it at the end of the month more than I paid. So I think my first deal was something like $100 into $500. And because I didn't have any money that was on my credit card. So I was paying off my credit card by physically selling and then moved up from there. So started with nothing. Started out buying, selling myself after I'd done that for a while. In 2010, when I technically founded FE International, I was graduating college, I didn't want to get a job. I wanted to turn it into a full time business. But because I didn't have any money, it was very difficult to make a full time living buying and selling. So I wrote a book about buying and selling websites domains. So I thought back then it was very popular. I got really fortunate. It got off the ground, started making enough to pay rent. I thought I would never have to do anything other than just sell courses or sell books. Essentially what ended up happening is people that would go through the course and they'd read the book and they'd say, thomas, I've watched all the videos, read the book, listened to everything. I'm in the, the membership area. I have a business, can you sell it for me? So I had no idea what M and A was either. And I thought, well, I can help you sell. I didn't have to put up any money myself. It's a process I already understand and I can get paid to do that. So that's how I accidentally stumbled into M and A. There was no M and A firms that did this. There were no business brokers. If you had a really big business, you couldn't call a big investment bank because they wouldn't return your phone call. So very much offered a service that no one else did and really built it from, from there.",
      "start": 56940,
      "end": 170760
    },
    {
      "speaker": "B",
      "text": "Okay, so in college you were just flipping websites almost like for fun. Can you tell me a little bit more about that?",
      "start": 170760,
      "end": 176920
    },
    {
      "speaker": "A",
      "text": "Yeah, I think at the time when you're at college, if you didn't have any money, like I didn't, you had to make some, some money somehow. So the option was either go work at a bar, work at a restaurant, or find a way to make money myself. So after I did my first deal, and even though it was only a tiny amount of money, I figured it's something you can do basically any time of day as long as you had a laptop and an Internet connection. My challenge was always the fact I just didn't have any money. So the challenge I always set myself was either max out my credit card or put as much as I could on my credit card at the beginning of the month and then try sell it by the end of the month. And if I hadn't, it'd be accruing interest. So it was kind of an incentive to get a deal done. Businesses like yours and like helpful resources didn't exist 15 years ago. There's no way you could go to learn about how to build a business. So there were some forums. Forums don't really exist today. People go in Facebook groups, they go on Twitter, they go on TikTok, wherever they might be. But that's where people now discover information and tips. But back then there was no playbook. You had to figure it out. That's what I did for a long time. So I was very much self taught. I think if I were to start the business today, I probably would have never started the same business because there's so much information out there. I probably would have found something else to start that I would have found equally interesting.",
      "start": 176920,
      "end": 251830
    },
    {
      "speaker": "B",
      "text": "You finished up with college and you sold a course and you made $30,000 on that course. Then you took that money and reinvested and actually started the firm. How did that look at the time?",
      "start": 257750,
      "end": 268580
    },
    {
      "speaker": "A",
      "text": "I think one of the first things I learned very early on is I didn't know how to do everything. And as you grow in your business, you'll realize that becomes even more the case. And you get to the stage as you scale where you should just focus on the things you are best at. And if you're not the best at it, you should hire people to do that. Believe it or not, I was not in any way technical, so buying, selling websites, but I had no idea and I still don't today anything server related, anything technical. I could make some basic edits myself but that was really it. So the first thing I did was we opened a small office and we hired two people. They were helping on the technical side. I was essentially doing all the selling. And that was the very early days of the business. My current business partner, Ismail joined he, he'd worked at a big investment bank, came into what we were doing and applied everything he had learned doing multi billion dollar transactions to the tiny. The biggest deal we'd done back then was $30,000 applying the same processes to that. So 2012 onwards, that was really how we got the business off the ground. Because if it's always just you and you never hire any people, it's very difficult to scale. And I knew from the start I didn't want to be a freelancer which is a perfectly good way to make a living if that's what you wanted to do. I wanted to build a business and the only way you do that is by hiring people.",
      "start": 268740,
      "end": 340490
    },
    {
      "speaker": "B",
      "text": "When you look back at that time, what was your biggest learnings from that?",
      "start": 340850,
      "end": 343810
    },
    {
      "speaker": "A",
      "text": "I think firstly, once you have some scale so you're making some money, you have to look at things very objectively, look at the data and make a decision what is most profitable for you and your business. So Ismail came in. I remember we had this conversation very early on. He said, Thomas, you're working on four different parts of the business. This part makes all the money. These parts do not make so much, but you're spending 80% of your time on the things that don't make any money. So you could call it Pareto Principle, I was spending 20% of my time on the thing that made 80% of the money. So we said, and we decided, why continue doing the other things? Let's stop doing them and focus on the things that are working. But yeah, very early on we were data driven and it was really just what made us the most money. And like, ultimately we were trying to build a business. You don't have a business if you're not making money. So that's what we decided to do for our audience.",
      "start": 343970,
      "end": 397100
    },
    {
      "speaker": "B",
      "text": "Who wants to maybe find the first business that they'll buy. What would be your advice on how to find good businesses for cheap?",
      "start": 397100,
      "end": 403500
    },
    {
      "speaker": "A",
      "text": "Yeah, so the first thing you need to do is figure out what you want to invest. There's no point looking for a business to acquire if you don't know how much money you have or what you're looking to achieve. So start with budget. Start by identifying a business model you're comfortable with. So maybe you want to buy a blog, maybe it's a SaaS business. There's no right or wrong answer to what you want to buy. From there, once you've established what your budget is, then the best way to find potential deals is email. People reach out. The great thing about the Internet today, it's relatively easy to find out where people are hanging out. So find them and reach out in a human way. You don't even in the first message, have to tell them you want to buy their business. Maybe you just want to have a conversation. I would definitely avoid a generic message if you want to get hold of a busy founder like me. For example, if you reach out and say, hey, Thomas, love what you're building. Can we do a phone call? The answer is always going to be no. If you explain what you're doing, like, hey, I'm starting out, I'm looking to acquire a business. Yours looks like a great fit. Are you interested in a conversation? Then if it is a potential good fit and they're interested, they will apply to you. And from there there's no tricks. You don't have to be technical about it, particularly if it's a small business. If you're buying something for $10,000, you don't need to hire a firm like us. You don't need professional advice. It's really that kind of human connection. A lot of it's gut feeling.",
      "start": 403740,
      "end": 481940
    },
    {
      "speaker": "B",
      "text": "I want to explore more about what makes a good business. You've looked at probably thousands or tens of thousands. Tens of thousands of businesses. When you see a business and you're like, That's a great business. I want to buy this business. What does that look like to you?",
      "start": 482020,
      "end": 495620
    },
    {
      "speaker": "A",
      "text": "So generally good businesses are evergreen. And by that that means they're offering something that's forever going to be interesting. That doesn't mean the product you're selling or the software or the information you're giving away has to be relevant forever. But it does mean that the audience you're building and the customers you're building should be able to be interested in the niche or the industry you're building in forever. The second part of that is good businesses and great businesses have repeat and recurring customers. That doesn't necessarily mean you have to build a SaaS business where people pay you hundred dollars, $1,000 every month to access your product. But what it probably means if you're selling a physical product or a digital product or whatever it might be, do you have people coming back? So that could be use a newsletter, that could be you email people on a consistent basis. So you have to have some repeat or recurring business. Doesn't necessarily mean you can't build a business without that. But it's much, much easier if you have a hundred dollars to spend on marketing. It's always better to spend that $100 making more out of customers you already have rather than trying to, trying to find new people and persuading them to spend money when they don't know who you are or what your business is. And then the third thing that makes a really good business is ultimately a business that's growing. Growing businesses have advantages for many different reasons, but particularly when it comes to M and A and selling a business, buyers are almost always willing to pay more for a company that's growing than a company that's not growing.",
      "start": 495780,
      "end": 581760
    },
    {
      "speaker": "B",
      "text": "All right, so let's talk successes. What was your most successful deal or at least a business that you bought or sold that really changed the game for you?",
      "start": 586560,
      "end": 595320
    },
    {
      "speaker": "A",
      "text": "The first deal for us, which really moved the needle and changed the business into a completely different level, is the first time we sold an eight figure business. So that means a business that sold for over $10 million in the M and A space at that level, you start breaking into a different level of deals, you start attracting a different type of client. And it took a very, very long time to get to that stage. And the nature of MA is once you've done one deal, it then compounds and you do more and more. And now we regularly close eight figure transactions. But yeah, the very first deal over that level was at least starting in the industry. No one was selling businesses over $10 million. The biggest deals you would see would be 100,000, 500,000, maybe a million. So first deal over 10 million, and then it really like compounded and snowballed from there.",
      "start": 595320,
      "end": 641270
    },
    {
      "speaker": "B",
      "text": "And what did that deal look like or how did it manifest?",
      "start": 641270,
      "end": 643510
    },
    {
      "speaker": "A",
      "text": "So it actually came from a referral from a past client we'd worked with. We had sold a smaller business for him, and he said if I was going to trust anyone with my business, it would be FE International. So the client knew we hadn't sold anything that big before, but because they had the referral, they knew we would do a good job. And ultimately we did. And really the difference between selling a million dollar business and $20 million business isn't really that different. It's slightly more technical, it takes a bit more time. It involves generally more attorneys and accountants and different third parties. But fundamentally, if you know how to sell something for a million, you can sell something for 20.",
      "start": 643590,
      "end": 683600
    },
    {
      "speaker": "B",
      "text": "What kind of commission or structure do you usually get on a deal like that? Or generally in the M and A space?",
      "start": 683680,
      "end": 688960
    },
    {
      "speaker": "A",
      "text": "Yes, it depends on the size of the deal. But fees generally on smaller transactions start at 15% and then tear down. So the bigger the business gets, the lower the fee you get to, and that really continues to tear up. Until you have a multibillion dollar business, fees will be even lower. So if you're selling something for $100,000, while it would be too small for us, you're probably going to be paying 15%. If you're selling a business for 100 million, you're going to be paying significantly less than that.",
      "start": 689180,
      "end": 716840
    },
    {
      "speaker": "B",
      "text": "All right, let's talk pricing and valuation. If you sell a business, is it generally a multiple of revenue or profit, or how does that look?",
      "start": 716840,
      "end": 724120
    },
    {
      "speaker": "A",
      "text": "So for most small businesses, so probably everyone listening, you generally don't get a revenue multiple. There's a lot of misinformation out there around valuations, but revenue multiples are uncommon. You generally get a multiple of profit. I think the reason sometimes that misinformation gets spread around is a lot of small businesses. If you're running them by yourself, your revenue and profit number might be really similar. We see lots of businesses which make $50,000 a month, but only have $5,000 a month in expenses, that's fine, but you're still going to get a multiple of profit. And that multiple range can really vary. Like the average small business is probably in the 4 to 10 times annual profit range. Like really good businesses might be higher than that. Like bad businesses might be below that. Or not sellable at all. But generally you're going to be like the middle of that range for the majority of businesses, particularly if you have recurring customers, you're growing and you're in a space which is going to be around for a long time. Okay.",
      "start": 724120,
      "end": 782290
    },
    {
      "speaker": "B",
      "text": "I think a lot of people, me included back in the day, dream about building a business with their own idea. But that comes with a lot of downsides. The idea might not work out, lose momentum. I think there is a lot of upside to buying a business rather than starting it. So what does that look like to you?",
      "start": 782290,
      "end": 797990
    },
    {
      "speaker": "A",
      "text": "Yeah, so the worst thing about buying a business is you need the money. The best thing is almost everything else. So if you're buying a business, assuming it's making some money, and you shouldn't buy a business if it isn't making money, depending on your skill set, you might identify something that the existing owner has done a good job of but you don't really know much about or saying they haven't done much of, you can do a really good job of. So a good example might be a software business. People buy good software businesses which are small. The founder of the business is extremely technical, but they don't know how to do marketing. So if you're a good marketer, you can take that business which has traction. You can build. Doesn't even need to be multiple marketing campaigns. You can build SEO campaigns, social media campaigns, email campaigns, whatever it might be to build that business. But the variable you're never worrying about is will someone pay for it because it already has an audience? And does the product work? Because again, it's already got people paying for it. So that's generally the best way to approach something if you're going to buy it, buy something where your skill set can add to it. You don't necessarily need to have the same skills as the founder. Ideally, you need to have slightly different skills.",
      "start": 798860,
      "end": 866920
    },
    {
      "speaker": "B",
      "text": "All right, let's talk about negotiation. Everyone's thinking about that when they go to buy. How can you get the best price as a buyer and sell for the most as a seller? How does negotiation typically work in your experience?",
      "start": 866920,
      "end": 877730
    },
    {
      "speaker": "A",
      "text": "The thing with negotiation is, firstly, negotiation is a really useful skill to learn because you can use it in every single part of your life. That doesn't mean I'm suggesting you go into a grocery store and start negotiating the price of apples, but you can do many, many different things if you're a good negotiator when it comes to buying or selling a business. The first thing to think about as a Seller or a buyer, it doesn't matter which side of the table you're on is what are you trying to achieve? Is it the most money possible in your bank account if you're a seller? Is it the least amount of transition time possible as a seller? Is it you want to sell to someone who's going to maintain the business as you have been and keep the same team. And then often as a seller, it's a bit of a trade off. You will get multiple offers on the table and all of them will be different. You won't have two offers which are exactly the same. So you might have one buyer who offers you the most cash, but they want the longest transition period. So they want you to work for them for two years. And then you might get another offer which is slightly lower amount cash, but they're happy for you to leave the business in three months. So when it comes to negotiating and approaching that negotiation, you need to decide what matters to you the most. If you don't know, the worst thing to do is just pushing back on every point. And that's the same with any negotiation. If someone sends you a list of 10 things they want, if you argue back on all of those 10 points, you're far less likely to be successful. The best way to approach it with any negotiation, particularly when it comes to business, is go through the list, decide what you care about, and decide where you want to pick battles and realize that it's important you give the other side, buyer or seller, some wins. But I've always found the best way to approach it is decide what you want, decide what the most important things to negotiate on for you. And hopefully the best negotiations work where the things that mattered most to you as a buyer and most to me as a seller are different. So I push on what I care about, you push on what you care about, and we meet somewhere in the middle. That's the best way to approach negotiation.",
      "start": 877890,
      "end": 994100
    },
    {
      "speaker": "B",
      "text": "You're doing big things now and you have a lot of capital at your disposal. But what would be your advice for someone who has no money and wants to buy their first business or flip their first business, as you did in your early career?",
      "start": 994500,
      "end": 1005980
    },
    {
      "speaker": "A",
      "text": "So first thing, don't necessarily decide. It has to be a business. You can find anything to flip. And then the second thing is you need to find some money. So I don't care where you find it, but you need at least something. So either go get a job for a few days and make some money, borrow some money, or do something to get you access to Some capital. It's significantly easier to do deals if you have a hundred dollars versus zero dollars, because very few people are willing to give you anything for zero. Whereas a hundred dollars, you have lots of different options. You can buy, buy from there. The most important thing when you're starting out is like learning a process and learning how to make some money. There's lots of people that will tell you can do this, but it's unlikely. You don't need to turn a hundred dollars into a million. It's perfectly fine to buy something, turn that $100 into 150 or 200 or 300. And you also, early on, regardless of what you're buying, selling, you shouldn't worry about something that's necessarily going to make you a living or, or even worth your time by the hour, because all you're really done trying to do is learn the process. You're learning how to sell, you're learning how to negotiate, you're building up subject matter expertise. You are not going to make your living long term buying things for $100 and selling them for 200. But you will do, if you can apply that same skill to buy for a million and sell for 2 million or 10 million and sell for 20 million. But you have to start somewhere. If you don't get any capital to do the first deal, it's going to be difficult. And if you don't learn the process, it's going to be difficult as well. So start small. Appreciate the first couple of deals you're going to do. The goal is just to make a profit. It doesn't matter how much that profit is, some profit over time. If you ever want to work with investors, for example, investors are much more likely to work with people who can show a track record, even if the track record is small. If you can show, hey, look, look how many times I've turned $10,000 into 20,000. I'm trying to build something bigger. Will you back me? If that's what you want to do, there'll be options for you.",
      "start": 1005980,
      "end": 1122320
    }
  ]
}