{
  "source": "/home/salouri/Projects/starter_story/transcripts/a1EXyJlSx9g/a1EXyJlSx9g_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "I'm going to be honest. I get a lot of DMs from people who want to come onto the channel. I'm sure they're cool, but 90% of those DMs don't go anywhere. But what about the other 10%? Well, that's who you're going to meet today. This is Joe. He's never shared his story before, and he DM me and said I'm a solo founder and I make over $40,000 a month with this app. This sounded cool, so I had to know more, and what he shared blew me away. So I decided to bring Joe onto the channel to share how he took a simple problem and turned into a $40,000 per month business. In this video, we'll dive into how he found this idea in the most unexpected of places, why he quit his career in engineering to build it and become a solopreneur, and how simple apps like his can compete with billion dollar competitors. I'm really excited for this one. So let's get into it. I'm Pat Walls, and this is Starter Story. All right, welcome to the channel, Joe. Tell me about who you are, what you built, and what's your story?",
      "start": 80,
      "end": 59500
    },
    {
      "speaker": "B",
      "text": "Yeah. Hi, my name is Joe. I built an app called Waitly. I originally launched it as a side project, and now it makes over $40,000 a month.",
      "start": 59580,
      "end": 67220
    },
    {
      "speaker": "A",
      "text": "All right, cool. Before we get into Waitly and what you built, I'd love to learn a little bit more about your background and how you get here.",
      "start": 67220,
      "end": 72740
    },
    {
      "speaker": "B",
      "text": "So I was always into computers growing up, and so I went to college and got a degree in computer science, came out of college and started a career as a software Engineer. But in 2008, I landed a job with Shutterfly, the online photo gif company. And it was the first time in my career that I thought I was building something fun and cool. I. I continued my career by moving into management at Shutterfly, and I immediately missed the coding aspects or building aspects of my job. I was building teams rather than apps. So I started looking for a side project where I could learn how to build iOS apps. It's something I hadn't done in the past, and I was interested in learning.",
      "start": 72820,
      "end": 107300
    },
    {
      "speaker": "A",
      "text": "That's cool. I'd love to learn more about how you came across the idea for Waitly. How did that happen?",
      "start": 107300,
      "end": 111940
    },
    {
      "speaker": "B",
      "text": "In 2017, I went to brunch and it was a busy Saturday morning, and we got put on the wait list. I got a text that I was on the wait list and there was a link that said, click here to see Your wait time. Tapped the link on my phone and it immediately wanted me to download Yelp and sign up for an account just to see my wait time. By the time that I signed up for an account and everything, I got a text that my table was ready. So I thought to myself, this link should just take me to a page where I could see my wait time. I shouldn't have to sign up for an account. That's when my wife suggested maybe you could build a waitlist applied. So six months in, I was really fired up. Had a working prototype. I could add people to the list. It couldn't text anyone yet. And about a year and a half in, I really dug deep and said, all right, I'm going to get to the point where I can launch this in the App Store. Finally launched it and within the first week I had 10 downloads. And then about two years in is when I finally launched in App purchases in the App Store and really started growing the business.",
      "start": 112180,
      "end": 167210
    },
    {
      "speaker": "A",
      "text": "Okay, quick pause. Let's talk about something that is secretly killing so many new founders. Not getting your business foundations right. I'm talking missed deadlines, messy vendors, tax confusion, compliance drama. This kind of stuff builds up fast and then suddenly you're buried in admin work instead of building stuff and generating revenue. That's why I'm a huge fan of today's sponsor, Doula. Doula will help you set up your llc, handle your bookkeeping, stay tax compliant, all in one place. It's basically like having an ops team without all the overhead. And what I really like is they don't just hand you a checklist and leave you to figure it out. They stick with you and make sure you're set up for success from day one. Thousands of entrepreneurs in over 175 countries use doula because it actually works. Stop burning time on admin work. Let Doula handle the boring stuff so you can focus on what actually matters, building your business. If you're starting something right now, then head to the first link in the description and use the code starter story for 10% off. Thanks to Dula for supporting the channel. Now let's get back into it. Now. This business is doing over 40,000 mrr. Can you give me a little bit of a timeline of that growth? How do you get there?",
      "start": 167290,
      "end": 242180
    },
    {
      "speaker": "B",
      "text": "Yeah, absolutely. So in year one, made no money when it launched. Like I said, there was free version. Year two we made 14,500. Year three is when it really took off. Made about 116,000. Year four was 186,000. Year five was 307,000. Year six was 354,000. Year seven was 445,000. And this year we're on pace to make over half a million dollars.",
      "start": 242180,
      "end": 268970
    },
    {
      "speaker": "A",
      "text": "Okay, well, congrats. Your business is doing half a million dollars subscription business. Can you break down some of the growth strategies or marketing strategies that got you there?",
      "start": 269050,
      "end": 277490
    },
    {
      "speaker": "B",
      "text": "Yeah. So one of the main drivers for us is Apple search ads. We run ads on certain keywords that helps drive people downloading the app. Cost to acquire a customer for US is about $130. The lifetime value of those customers is between 700 dol 50 and $1,000. So as much money as we can put into those ads, there's definitely ROI there. Next we try to nurture those customers with emails. We have some emails with tips to get started, some quick start videos. We offer onboarding through Zoom, staff training of employees if necessary. And near the end of those trials, we offer promotions to really try to get them to make that first purchase.",
      "start": 277490,
      "end": 319350
    },
    {
      "speaker": "A",
      "text": "I'd love to see the app that you built. What is Waitly? How does it work? Can you show it to the people watching here so we can really understand you built?",
      "start": 319350,
      "end": 326810
    },
    {
      "speaker": "B",
      "text": "Absolutely. So Waitly is a waitlist and reservations platform for any business that has waiting customers. You go to a restaurant, it's busy, they don't have a table for you quite yet, so they might add you to the waitlist. So you can just put in a name, a party size, what your estimated weight might be, guest phone number, and then any seating preference you may have, like inside, outside. And now suddenly you're on the wait list. Within a few seconds, that customer would get a text message letting them know they're on the wait list. There's a link in that text message that they tap. They'll their wait time. They don't need to download any app. And then when I'm ready to serve that customer, I can just tap notify and they'll receive a second text message than just letting them know that the table is ready. Once I'm served that person, I just simply check them off the list.",
      "start": 326810,
      "end": 371310
    },
    {
      "speaker": "A",
      "text": "All right, cool. My next question is why would any restaurant use your software over these bigger companies? How do you compete with billion dollar companies?",
      "start": 371390,
      "end": 380030
    },
    {
      "speaker": "B",
      "text": "We compete a couple different ways. One is on price. Whaley has a flat fee of $100 a month to unlock all the features where Yelp and Opentable, their flat fees are hundreds of dollars a month. And then for any reservations that are booked through their platform, they charge cover fees. The second thing we compete on Is simplicity. One of the benefits of only doing waitlist and reservations is it can work for other industries. During COVID we had a bunch of retail chains who had limited capacity in their stores, want a wait list so people can could wait outside for their turn. And we put waitly in over 700 locations around the United States and that 10x star business that year. And the third thing we compete on is customer service. So anytime that someone calls our support line, someone answers immediately. They're always surprised that someone picked up right away to answer their call.",
      "start": 380190,
      "end": 431880
    },
    {
      "speaker": "A",
      "text": "All right, cool. For anyone watching this right now, what would be your framework for looking for an idea today?",
      "start": 431960,
      "end": 436360
    },
    {
      "speaker": "B",
      "text": "You don't need a new idea. There's plenty of ideas out there, problems that have been solved that you could improve upon. And while you're improving upon that, you might find a niche within that industry. Waitley is a perfect example of that. I competed with the giants like OpenTable and found a little niche within that industry where I can serve the small restaurants that are underserved. Step two would be I would use AI to build my minimum viable product quickly. Nowadays you could do that in just a couple of weeks. Get something out there quickly. Number three would be get feedback on that idea from your early customers. And number four is just expect the unexpected. Get ready to adapt because things never go as you expect and you're going to have to adapt.",
      "start": 436440,
      "end": 477550
    },
    {
      "speaker": "A",
      "text": "Okay, that's all great advice. I'd also love to get some specific ideas you think might be worth building.",
      "start": 477550,
      "end": 483550
    },
    {
      "speaker": "B",
      "text": "Yeah, so one idea I'm actually playing around with is I play in a pickleball league. The spreadsheets that we keep to keep track of everyone's points is getting out of hand. So I'm looking at building a pickleball league management app, maybe with a social aspect for people to find games in their area to play in. A second idea would be an AI support chatbot that can be used and trained on specific products or websites. And one big idea I have, and this is another competing with giants moment, is social media. I feel like social media today is run by corporations and influencers and everyone's doom scrolling. And I think people are really itching to connect with friends and family again like they did in the early days of social media. So I think there's definitely room for someone to come in and mix up the social media space.",
      "start": 483790,
      "end": 531210
    },
    {
      "speaker": "A",
      "text": "Okay, I like those ideas. Switching topics a little bit, I'd love to hear some of the numbers behind behind weightly. Can you break down some of the metrics and numbers behind this Business.",
      "start": 531370,
      "end": 539430
    },
    {
      "speaker": "B",
      "text": "We've had over 15,000 businesses. Try Weightly. We currently have 700 paying customers around the US and Canada. Since Waitley launched, we've had over 59 million parties. Waitlisted on waitlists.",
      "start": 539430,
      "end": 551270
    },
    {
      "speaker": "A",
      "text": "Wow, that's crazy. Can you break down the tech stack? How did you build this app?",
      "start": 551270,
      "end": 554750
    },
    {
      "speaker": "B",
      "text": "Yeah, so Waitley is built on top of Google Firebase. We use it for hosting, authentication and database. We use Node JS as language for our backend services. The iOS app is written in Swift. And finally the web version of Waitly is written in React js.",
      "start": 554750,
      "end": 570730
    },
    {
      "speaker": "A",
      "text": "And on that same note, I'd love to hear some of the costs and margins of this business. I understand you're a solo developer. What do the costs look like for a business like this?",
      "start": 570810,
      "end": 578570
    },
    {
      "speaker": "B",
      "text": "Yeah, so Firebase costs us about $700 a month. All the business text messages we send is about $2,500 a month. We use Revenuecat for subscriptions in the iOS app. That's 1% of revenue. Apple search ads. Currently we're spending about 15, $500 a month. This fluctuates different times of the year. Stripe is 3% of revenue for any payments that we take from our website. We use SurveyMonkey to capture feedback from our customers. That's $35 a month. We use Hive for project management. That's about $25 a month. Fresh desk for customer support tickets, this is about $40 a month. And now we're spending about $200 a month on Claude code. We use ChatGPT for email content and that's about $20 a month. And we use Calendly for booking demos on our website and that's about $12 a month.",
      "start": 578570,
      "end": 627010
    },
    {
      "speaker": "A",
      "text": "Nice. Final question that we asked to everyone who comes on the channel. If you could go back and stand on Joe's shoulders when you had gone into that management role, you were looking for the right side project to build. What would be your advice for young Joe?",
      "start": 627810,
      "end": 640490
    },
    {
      "speaker": "B",
      "text": "Keep going. Definitely. When that self doubt creeps in, when you're competing with giants, you're not sure if you can actually go forward. Just keep going. Acknowledge that your doubts have no basis in reality because you cannot predict the future. Launch your product and see what the future holds.",
      "start": 640490,
      "end": 656010
    },
    {
      "speaker": "A",
      "text": "Well, that's great advice. Thank you for coming on the channel, Joe. I love the business you built. I love your story and hope to see you on again soon.",
      "start": 656010,
      "end": 662930
    },
    {
      "speaker": "B",
      "text": "Thanks, Pat.",
      "start": 663009,
      "end": 663650
    },
    {
      "speaker": "A",
      "text": "Thanks again to Joe for coming onto the channel. I love his story because it's proof that you can solve a simple problem and build a really nice, successful business. I'm willing to bet that in the last week you may have come across some similar problems as well as so why not try to build something that solves them? Well, that's what we created with Starter Story Build, our program where we will guide you on how to use AI to go from an idea to an app in just a few days. Imagine you build something that solves a real problem and you ship it to the world for real users to use and get value from. That is a really cool feeling. So if you're interested, just head to the link in the description to check out Starter Story Build. Thanks again for watching. I'll see you guys in the next one. Peace.",
      "start": 663890,
      "end": 705650
    }
  ]
}