{
  "source": "/home/salouri/Projects/starter_story/transcripts/Fk2J2U7669o/Fk2J2U7669o_raw.json",
  "segments": [
    {
      "speaker": "A",
      "text": "This is Danny Miranda, the man who went from his parents basement to sitting down, face to face with the most influential people in the world. How did he do it? With this laptop and this microphone, he started a podcast. But before I tell you about Danny, I have to remind you about this. The incredible Joe Rogan.",
      "start": 400,
      "end": 16160
    },
    {
      "speaker": "B",
      "text": "Joe Rogan, you would have heard of this guy. He's got the most listened to podcast in the world. Spotify bought the Joe Rogan podcast. Joe Rogan just got a hundred million dollar deal from Spotify.",
      "start": 16160,
      "end": 27200
    },
    {
      "speaker": "A",
      "text": "How in the world is a podcast worth $100 million to? I flew out to Austin, Texas to sit down with Danny, who might just be the next Joe Rogan. He broke down exactly how he started a podcast with $0, how it makes money, and how he's landed some of the biggest guests on the Internet.",
      "start": 27520,
      "end": 43700
    },
    {
      "speaker": "B",
      "text": "That's how I got Gary Vaynerchuk for episode 39 of the podcast.",
      "start": 43700,
      "end": 47180
    },
    {
      "speaker": "A",
      "text": "He also shared with me the reason why everyone should start a podcast and how the business of podcasting is a lot bigger than you think. Danny has proved that anyone with a laptop and an Internet connection can start a podcast that changes their life. I'm Pat Walls and this is Starter Story. Danny, you went from hanging out in your parents basement to starting one of the most influential podcasts in the world. You've had guests like Gary Vaynerchuk and Andy Frisella. Tell me about what you're doing and why you're doing it.",
      "start": 47180,
      "end": 75340
    },
    {
      "speaker": "B",
      "text": "I created the Danny Miranda podcast in September of 2020 because I enjoyed talking to people on the phone. And I would have such great phone conversations that I said, why don't I record this? Why don't I share this information, even if no one listens? And so I started this podcast by putting out three episodes a week in September 2020. And I grew it to the point where 30 to 50,000 downloads a month. And I've talked to some of the most interesting people in the world who were my heroes and who still are. And it's been an incredible journey.",
      "start": 75580,
      "end": 106180
    },
    {
      "speaker": "A",
      "text": "Tell me a little bit more about that journey.",
      "start": 106340,
      "end": 107860
    },
    {
      "speaker": "B",
      "text": "I started by thinking about who are the people that were fascinating me, who were the people that I was inspired by, that I was curious with and how could I talk to them for an hour? That was Kamal Ravikant, that was Gay Hendricks. And these books were so influential on how I thought that I wanted to talk to them, I wanted to learn more about them, their story and connect with them. And so I didn't really have any reason to do that. But once I had a podcast. I suddenly could. And that was a game changer for me, that I had an excuse to talk to any person I wanted to for an hour or more.",
      "start": 107860,
      "end": 140070
    },
    {
      "speaker": "A",
      "text": "I know podcasting may seem like something people just do for fun or as a hobby, but actually, it might be one of the biggest opportunities of our generation. Tell me more about that.",
      "start": 140230,
      "end": 149270
    },
    {
      "speaker": "B",
      "text": "Podcasting as a medium is so new, it's only been around for 20 years. And that might sound like a long time, but if you think about the radio, the radio was invented in 1895. And so if you think about the radio being involved in the world in 1915 compared to where it was at its peak, if you think about podcasting compared to that trajectory, we're in the early days. Even though it seems like everyone and their mom has a podcast, the truth is that it's just getting started. And the truth is that listenership increases year over year. The ways of listening increase year over year, and the desire and hunger for conversations has never been higher.",
      "start": 149510,
      "end": 185770
    },
    {
      "speaker": "A",
      "text": "And tell me a little bit more about the business opportunity of podcasting. I know that there are businesses behind it that are built. What have you seen?",
      "start": 185930,
      "end": 192650
    },
    {
      "speaker": "B",
      "text": "Yeah. So advertising is the most common model for the biggest podcast in the world. But there are other models that I think are worth exploring and are interesting. One is courses or subscriptions to newsletters. So you funnel people from a podcast to a newsletter or to a course. Another potential avenue is consulting of some sort. So for me, I help people and connect people to some of my guests. They help me with money, and I help them build their podcast up from the ground up. So on day one of their show, they're getting phenomenal guests. Another one that's potentially interesting is creating some sort of conference or a summit, bringing the people together that you've had as guests and maybe become friends and have them as speakers, and maybe they'll do it at a lesser cost or for free, because they're your friends now. So I think there are many different avenues to explore when you're connected to amazing people.",
      "start": 192730,
      "end": 242650
    },
    {
      "speaker": "A",
      "text": "What are some of the biggest businesses you've seen podcasters build, and what does that look like?",
      "start": 242650,
      "end": 246810
    },
    {
      "speaker": "B",
      "text": "So Joe Rogan, I believe, had a 50% stake in on it, and they sold that company for $300 million. But I think that it's the early days. I think this is like looking at, like, NBA players in 1970 or 1980. Podcasters are going to have a deep connection with people who, for a long amount of time, people who have deep connections to a lot of people, can Build amazing, huge businesses on top of that. And so Joe Rogan's Spotify deal of 100 million, or Alex Cooper getting paid $20 million a year from Spotify as well. Those are the early signs of what's to come.",
      "start": 246970,
      "end": 281040
    },
    {
      "speaker": "A",
      "text": "Let's talk about how to get started with a podcast. What is the most basic fundamentals?",
      "start": 281040,
      "end": 284800
    },
    {
      "speaker": "B",
      "text": "To get started, you just need a zoom connection and an ability to want to reach out to people. For me, it started with sending DMs to the people that I was interested in. And what people don't realize when they're starting a podcast is they underestimate the amount of people who will say yes to them. There are more people who will come on your podcast than you probably imagine. Just send 100 messages and really be interested in a wide range of people, and you might be rejecting yourself before you actually are even sending the message. So send more messages is my tip for people who are just starting out.",
      "start": 284800,
      "end": 320030
    },
    {
      "speaker": "A",
      "text": "And then in terms of tools and equipment you might need, what does that look like?",
      "start": 320030,
      "end": 323510
    },
    {
      "speaker": "B",
      "text": "So I think you can start with a Shure MV7 and a Zoom connection, and you can get it done just with that alone. You can upload on anchor, which is free, which I use to this day. It doesn't cost much. What costs is the effort that it takes to build the podcast.",
      "start": 323590,
      "end": 340870
    },
    {
      "speaker": "A",
      "text": "Yeah, I see you as one of the best podcast interviews, at least in my experience. How do you become a great interviewer?",
      "start": 340870,
      "end": 347670
    },
    {
      "speaker": "B",
      "text": "For me, it's about putting care and attention on the other person. And that starts with the research process. So in the research process, I will try to spend five to 20 hours of podcast episodes Googling their name, Twitter, Instagram, really stalking the hell out of them. Being my own private investigator so I can spend so much time with them that I can live in their shoes, so I can get context for the things to ask them and the best questions give people a new insight or a new aha to oh, that's why I've been acting that way, or oh, that's why I did a certain thing. So I'm aiming to give people interesting experiences about their own life by shaping the way in which they think about themselves.",
      "start": 347910,
      "end": 387800
    },
    {
      "speaker": "A",
      "text": "All right, Danny, you've had a ton of amazing guests on your podcast. How did you get your first guest? And how do you get amazing guests?",
      "start": 387800,
      "end": 393840
    },
    {
      "speaker": "B",
      "text": "So the first guest, I would recommend going to a friend, somebody you already feel comfortable with and somebody you're excited to talk to, and do that for 10 episodes. Try to connect and actually be interested in the guest, but also have the Guest be interested in you. That eases some of the pressure off. Who was my first amazing guest? That was gary Vaynerchuk, episode 39. And that idea of him coming on the show was so out of left field and so unexpected, but it gave me a lot of confidence to know that I could talk to him and he could have a great conversation from it. So I think that. How do you get amazing guests? You need to hack their attention. How do you hack their attention? You use the platform that they spend the most time on, and you give them value in some way that could be. In ways they've impacted your life. That could be sending them interesting messages, that could be with an interesting subject line or something unexpected. But you need to figure out a way to hack people's attention if you want to get amazing guests.",
      "start": 394080,
      "end": 450100
    },
    {
      "speaker": "A",
      "text": "In terms of getting good guests, the outreach side of things, what do you tell people?",
      "start": 457060,
      "end": 461620
    },
    {
      "speaker": "B",
      "text": "Use Twitter. Twitter is the most untapped resource there is for getting guests, and I think it's because the most awful people in the world are on Twitter, and everyone checks their mentions. And I've been public about. I think a lot of people are scared to tweet out at this person. I would love to have you on my podcast, or I would love to have you on my YouTube show. They're. They're scared because they don't want to be rejected. Right. Or publicly rejected at that. And I've always been comfortable with. Let me just throw this out there. The odds of them saying yes to come on the show are very low. But if they do, that's a home run. Yeah. That's how I got Gary Vaynerchuk for episode 39 of the podcast. I got him because I just tweeted he was one of my dream guests. And then I put out a screenshot of a blog post that I wrote about him in 2009. And then he followed me, and then I tweeted that he followed me. And then people said in the comments and the replies to me tweeting that he followed me, people telling him that he should come on the podcast, and then he did. So I've used Twitter really effectively, I think, to help get amazing guests on the show that I otherwise wouldn't have been able to get.",
      "start": 462100,
      "end": 528840
    },
    {
      "speaker": "A",
      "text": "Yeah. Hey, guys, that snippet you just saw with me and Danny is from an exclusive interview we filmed just for Starter Story members. We dive even deeper into the business of podcasting, creating a vision, landing guests, and a ton more. If you want to see the full interview, join Starter Story and You'll also get access to over 4000 business idea breakdowns that can help you find the perfect idea. Take Luke for example. He joined Starter Story and dove into our case study that breaks down a newsletter business that makes $25 million a year. Just one month later, he launched his own newsletter and did $5,800 in revenue in his first 30 days. He studied what works and implemented it and avoided the mistakes of entrepreneurs that were just a few steps ahead of him. So if you're serious about building a business, check out the link at the top of the Description. The first 100 people that click that link will be able to try Starter story for just $1. Alright, enjoy the rest of the video with Danny. Peace. All right, let's talk about marketing. It's easy to start a podcast. A lot of people start it, but usually find that the hardest thing to do is to get people to listen to it. How have you approached marketing when you started and also today?",
      "start": 528840,
      "end": 595180
    },
    {
      "speaker": "B",
      "text": "So a lot of people think that if they have an amazing big time guest that is going to bring in new listeners, that's not enough. The marketing is something you have to do. You have to grow the show. You have to take a big concept and you have to chop it down into things that people will want to watch. In short, snippets that might not know who you are. Tap into a bigger conversation Right? So let's say we have a podcast and we talked about entrepreneurship. Entrepreneurship is a bigger conversation than Danny Miranda or Pat Walls. Tapping into bigger conversations is really how you grow the podcast. Because people might not be interested in either of us, but they'll be interested in the bigger conversation of entrepreneurship.",
      "start": 595740,
      "end": 635270
    },
    {
      "speaker": "A",
      "text": "And tell me a little bit more about that marketing strategy. Looks like you how many clips are you posting a day and what does that look like?",
      "start": 635270,
      "end": 640550
    },
    {
      "speaker": "B",
      "text": "So on YouTube, we're posting at least one video every single day. So that's a full length video, a video that's over one minute long every single day. We'll also post at least two shorts on YouTube every single day. We'll also post at least three Instagram Reels every single day. And we'll have at least five Twitter clips from our show every day. So if you think about how much content is getting distributed, how many conversations are getting started because of this podcast, it's insane, but not to make someone feel bad who's just getting started. If they're in your first day, your first iteration, just focus on what you can control. I built up to that process. By now I have an editor on the team, when you're just getting started, focus on the most important part, which is the conversation.",
      "start": 640630,
      "end": 682290
    },
    {
      "speaker": "A",
      "text": "There's a lot of podcasts out there and a lot of them go unnoticed. How do you stand out as a podcast?",
      "start": 682530,
      "end": 688210
    },
    {
      "speaker": "B",
      "text": "You care. You care more than other people and that means caring about the clips that you put out, caring about the guests, giving the guests a good experience, and doing everything you can to to care more than the other person. If everyone has a podcast, the person who cares the most about their podcast and their guests are going to win long term. Yeah, but if you can also go a different route, you can also care more by having a specific niche that you want to focus on. I know there are people who have been successful by having the marketing show or by having the entrepreneurship podcast, or by doing a slight tweak on something that people don't want to discuss. Call Her Daddy by Alex Cooper succeeded because she talked about a topic that was taboo in the mainstream, but that she was able to use and navigate through. All of that goes to say you can be a niche and succeed, or you can be yourself and succeed. Regardless, you have to care a lot about the person on the other end as well as the audience when you are thinking about growing the podcast.",
      "start": 688370,
      "end": 746360
    },
    {
      "speaker": "A",
      "text": "Okay, let's talk about consist. And you've done 359 episodes in two and a half years. Really haven't missed a day if you think about it. Tell me about your approach to consistency.",
      "start": 754200,
      "end": 764500
    },
    {
      "speaker": "B",
      "text": "I put out three episodes a week because I understood and reverse engineer Joe Rogan. Joe Rogan has put out three episodes a week for 10 years. I put out three episodes a week for two and a half years. So what is that going to mean? It's not going to mean that at the end of 10 years I will be Joe Rogan, but it means at the end of 10 years I will be better at communicating my thoughts and asking questions. And really that's what I'm trying to do with the podcast. So the consistency is helpful to help me be a better communicator. And I look at each episode as going to the gym. It's like showing up even when you don't feel like it. It's not like I'm sitting there so excited every single moment of every day, but I know that it's helping me lay a brick to be better.",
      "start": 765140,
      "end": 804960
    },
    {
      "speaker": "A",
      "text": "Tell me a little bit about your routine. I know you like routines and you're into meditation. Tell me more about that because I think it's amazing what you did.",
      "start": 805040,
      "end": 811760
    },
    {
      "speaker": "B",
      "text": "Thanks, man. I mean, I think meditation and having presence is the key for being a successful podcaster. It's very difficult to do what I do. Asking questions, listening, really being with somebody, if you haven't first been with yourself as deeply as you can connect with someone is as deep as you connect with yourself. So medication is a key part of that. Going on walks, going outside in the morning just to hear the birds chirping.",
      "start": 811760,
      "end": 835650
    },
    {
      "speaker": "A",
      "text": "Right.",
      "start": 836040,
      "end": 836200
    },
    {
      "speaker": "B",
      "text": "Is just like something I love doing for 10 minutes. And it's such a subtle thing, but it just reinforces, wow, like, life is great. And like, I can be present in this moment when, quote, unquote, nothing's happening. As well as fitness, I wouldn't be the podcaster I am today without spending a lot of time in the gym. That's the consistency piece of it. And also spending a lot of time with my own thoughts and thinking about how do I view the world and what are the topics and messages that I want to promote through this podcast. Yeah.",
      "start": 836200,
      "end": 863800
    },
    {
      "speaker": "A",
      "text": "If you could sit on Danny's shoulder when you're just getting started podcasting or in the early days, what would you tell him?",
      "start": 863960,
      "end": 869880
    },
    {
      "speaker": "B",
      "text": "Keep going. This is what you are here to do. This is your calling. This is something that will help you build a network of people you love, trust, respect, and admire, and make your heroes your friends. So even though you haven't recorded with some of the people you will meet someday, the things that you are doing right now are helping build skills that will forever help you in whatever endeavor you do in life.",
      "start": 870680,
      "end": 893890
    }
  ]
}